Repository: tony37/sledhelp
Catalog: translated_po/*/*_settings.po
Languages: es

source: My Settings
es: Mis ajustes

source: The My Settings page in Sugar is similar to a Control Panel or System Settings window in other operating systems. It provides a way to set various values needed by system functions, such as the language for menus and messages, the keyboard layout for typing and otherwise controlling the system, date and time values and format, and much more.
es: La ventana Mis ajustes en Sugar es similar a una ventana del Panel de control o configuración del sistema en otros sistemas operativos. Proporciona una manera de establecer diversos valores necesarios para las funciones del sistema, tales como el idioma de los menús y mensajes, la distribución del teclado para escribir y otros tipos de control de los sistemas, los valores de fecha y hora y el formato, y mucho más.

source: To access My Settings, go to the Home view and activate the menu on the central XO icon, either by hovering with the cursor, or by right-clicking (O button on an XO). Then select My Settings. The following view appears.
es: Para acceder a Mis ajustes, ve a la vista de inicio y activa el menú en el icono central XO, ya sea con solo pasar con el cursor, o haciendo clic derecho (botón O en una XO). A continuación, selecciona Mis ajustes. La siguiente vista aparece.

source: My Settings page
es: Ventana Mis Ajustes

source: Click any icon to open the indicated control. If you make changes, the window will offer you the choice whether to save (check mark) or discard (x) those changes. It may be necessary to reboot the computer or restart the Sugar session in order for the changes to take effect.
es: Haz click sobre cualquier icono para abrir el control indicado. Si realizas cambios, la ventana te ofrecerá la opción de guardar (marca de verificación) o desechar (x) tales cambios. Puede ser necesario reiniciar el ordenador o reiniciar la sesión de Sugar para que los cambios surtan efecto.

source: About Me
es: Acerca De Mí

source: View and change your XO colors and name.
es: Ver y cambiar los colores de tu icono XO y tu nombre.

source: About my Computer
es: Acerca de mi ordenador

source: View technical information about your computer: serial number, software versions (Sugar, firmware, wireless), copyright, and license.
es: Ver información técnica sobre tu equipo: número de serie, versiones de software (Sugar, firmware, inalámbricos), derechos de autor y licencias.

source: Background
es: Fondo

source: Date & Time
es: Fecha y hora

source: Set timezone for date and time display.
es: Establecer zona horaria para la fecha y visualización.

source: Frame
es: Marco

source: View and set activation rules for the frame. Set the dial as to whether you would like the frame to show up instantaneously (right away), never or somewhere in between when you move your cursor to both the corner and edge of your screen.
es: Ver reglas de activación establecidos para el marco. Ajuste el dial si te gustaría que el marco a aparezca instantáneamente (de inmediato), nunca o en algún punto intermedio al mover el cursor hasta la esquina y el borde de la pantalla.

source: Language
es: Idioma

source: View and set user interface language. The language you are currently using will show on line 1. If you click on the arrow at the end of the line, you can select another language. Select from the menu by country and language, or click the + icon by the last line to add another line. If there are two or more lines, a - icon will appear by the last line to allow you to delete it.
es: Ver y establecer idioma de la interfaz de usuario. El idioma que estás utilizando actualmente se mostrará en la línea 1. Si haces clic en la flecha al final de la línea, puedes seleccionar otro idioma. Seleccioa en el menú de país e idioma, o haga clic en el icono + en la última línea para añadir otra línea. Si hay dos o más líneas, un icono - aparecerá en la última línea para que pueda eliminarla.

source: Modem Configuration
es: Configuración del módem

source: Enter settings for a mobile broadband connection to a cellular (3G) network. Not required for WiFi.
es: Introduzca la configuración de una conexión de banda ancha móvil a una red celular (3G). No se requiere para WiFi.

source: Network
es: Red

source: View and change settings for turning off wireless in order to save battery power, and view or set the jabber server name for collaboration.
es: Ver y cambiar los ajustes para apagar la red inalámbrica con el fin de ahorrar energía de la batería, y ver o establecer el nombre del servidor jabber para la colaboración.

source: Software update
es: Actualización de software

source: If you are able, check over the Internet for software updates, and install any that are available.
es: Si es posible, comprobar a través de Internet por actualizaciones de software e instalar las que estén disponibles.

source: Configure your Web Services
es: Configurar los servicios Web

source: Manage your online accounts and interventions to Journal.
es: Administra tus cuentas en línea y las intervenciones al Diario.
