Repository: tony37/sledhelp
Catalog: translated_po/*/abacus.po
Languages: es

source: Abacus
es: Ábaco

source: About
es: Acerca de

source: Abacus lets the learner explore different representations of numbers using different mechanical counting systems developed by the ancient Romans and Chinese. There are several different variants available for exploration: a suanpan, the traditional Chinese abacus with 2 beads on top and 5 beads below; a soroban, the traditional Japanese abacus with 1 bead on top and 4 beads below; the schety, the traditional Russian abacus, with 10 beads per column, with the exception of one column with just 4 beads used for counting in fourths; and the nepohualtzintzin, a Mayan abacus, 3 beads on top and 4 beads below (base 20). There is also a binary abacus, a hexadecimal abacus, and several abacuses that lets you calculate with common fractions: 1/2, 1/3, 1/4, 1/5, 1/6, 1/8, 1/9, 1/10, and 1/12. And there is a customization toolbar that lets you design your own abacus. The Incan abacus (Yupana) as a standalone program.
es: Ábaco permite al estudiante explorar diferentes representaciones de números utilizando diferentes sistemas de conteo mecánico desarrollado por los antiguos romanos y los chinos. Hay varias variantes diferentes disponibles para la exploración: el Suanpan, el ábaco chino tradicional con 2 cuentas en la parte superior y 5 cuentas por debajo; el Soroban, el ábaco japonés tradicional con 1 grano en la parte superior y 4 cuentas por debajo; el Schety, el ábaco tradicional ruso, con 10 cuentas por columna, con la excepción de una columna con sólo 4 bolas utilizadas para contar en cuartos; y el Nepohualtzintzin, un ábaco maya, con 3 cuentas en la parte superior y 4 cuentas siguientes (base 20). También hay un ábaco binario, un ábaco hexadecimal, y varios ábacos que te permite calcular con fracciones comunes: 1/2, 1/3, 1/4, 1/5, 1/6, 1/8, 1/9, 1/10, y 1/12. Y hay una barra de herramientas de personalización que te permite diseñar tu propio ábaco. El ábaco inca (Yupana) es una actividad independiente.

source: Using Abacus
es: El uso de Ábaco

source: Clearing the abacus
es: Borrado del ábaco

source: Before you start an arithmetic operation, you need to "clear" the abacus. The upper beads should be positioned against the top of the frame and the lower beads should be positioned against the bottom of the frame. This is the default position for the abacus when you launch the activity.
es: Antes de iniciar una operación aritmética, es necesario "limpiar" el ábaco. Las perlas superiores deben colocarse contra la parte superior del marco y las perlas inferiores deben colocarse contra la parte inferior del marco. Esta es la posición por defecto para el ábaco al iniciar la actividad.

source: Note that some of the abacuses (e.g., the schety) do not have any upper beads. In such cases, all of the beads should start in the down position. Also note that the Clear Button on the main toolbar will also clear the abacus for you.
es: Ten en cuenta que algunos de los ábacos (por ejemplo, el Schety) no tienen ninguna perla superior. En tales casos, todas debe comenzar en la posición baja. También ten en cuenta que el botón Borrar en la barra de herramientas principal borrará el ábaco por ti.

source: Reading the abacus
es: Leyendo el ábaco

source: In each column, the bottom beads represent 1s and the top beads represent 5s. (The exception is the column in the schety with only 4 beads. These are 1/4 each.) So for each bead you raise up from the bottom in a column add 1 and for each bead you lower from the top in the same column, add 5.
es: En cada columna, las perlas inferiores representan 1s y las perlas superiores representan 5s. (La excepción es la columna en el Schety con sólo 4 perlas. Estos valen un cuarto cada una. ) Así que por cada cuenta se eleva desde el fondo de una columna hay que agregar 1 y por cada cuenta que baja desde la parte superior de la misma columna, hay que añadir 5.

source: The columns themselves represent decimal positions from right to left, e.g., 1s, 10s, 100s, 1000s, etc. (There are some exceptions: (1) the nepohualtzintzin uses base 20, e.g., 1s, 20s, 400s, 8000s, etc.; (2) on the schety, the beads to the right of the column with just four beads are 0.1s, 0.01s, 0.001s, and 0.0001s; the black beads on the Caacupé abacus are fractions; and the custom abacus lets you choose whatever (integer) base you want.)
es: Las columnas representan por sí mismas posiciones decimales de derecha a izquierda, por ejemplo, 1s, 10s, 100s, 1000, etc.. (Hay algunas excepciones: (1) el Nepohualtzintzin utiliza de base 20, ejemplo, 1s, 20s, 400s, 8000s, etc. ; (2) en el Schety, las perlas a la derecha de la columna con sólo cuatro perlas son 0.1s, 0.01s, 0.001s y 0.001s; las perlas negras en el ábaco Caacupe tienen valores fraccionarios; y en los ábacos diseñados por el usuario las cuentas pueden tener cualquier valor entero

source: The current value is always displayed on the frame. Experiment and you will quickly learn to write and read numbers.
es: El valor actual se muestra siempre en el marco. Experimenta aprenderás rápidamente a leer y escribir números.

source: Examples: In the gallery below, several simple examples are shown. In the gallery of images above, the number 54321 is shown on each of the different abaci.
es: Ejemplos: En la galería a continuación, se muestran varios ejemplos sencillos. En la galería de imágenes de arriba, el número 54321 se muestra en cada uno de los diferentes ábacos.

source: From left to right,
es: De izquierda a derecha,

source: 1 bottom bead is up, corresponding to 1 unit
es: 1 perla inferior se ha levantado, que corresponde a 1 unidad

source: 1 top bead is down, corresponding to 5 units
es: 1 perla superior se ha bajado, correspondiente a 5 unidades

source: 5 bottom beads are up, also corresponding to 5 units
es: 5 cuentas de abajo han subido, también correspondiente a 5 unidades

source: 1 bottom bead is up and 1 top bead is down, corresponding to 6 units
es: 1 perla inferior está arriba y una perla de arriba está abajo, correspondiendo a 6 unidades

source: 5 bottom beads are up and 1 top bead is down, corresponding to 10 units (time to "carry" to the left)
es: 5 cuentas de abajo estan subidas y una perla de arriba está abajo, lo que corresponde a 10 unidades (tiempo para "llevar" a la izquierda)

source: This 10 is equivalent to...
es: Esto es equivalente a 10. . .

source: ... this 10
es: . . . este 10

source: Note: The display always assumes a fixed unit column, but you can override this choice.
es: Nota: La pantalla siempre asume una columna unidad fija, pero se puede anular esta elección.

source: The beads moved most recently are highlighted.
es: Las perlas que se movieron recientemente se destacan.

source: Addition
es: Adición

source: To add, simply move in more beads to represent the number you are adding. There are two rules to follow: (1) whenever you have a total of 5 units or more on the bottom of a column, cancel out the 5 by sliding the beads back down and add a five to to the top; and (2) whenever you have a total of 10 units or more in a column, cancel out the 10 and add one unit to the column immediately to the left. (With the nepohualtzintzin, you work with 20 rather than 10.)
es: Para agregar, simplemente mueve más cuentas para representar el número que está agregando. Hay dos reglas a seguir: (1) cada vez que tengas un total de 5 unidades o más en la parte inferior de una columna, cancela el 5 deslizando las cuentas de nuevo y añade un cinco a la parte superior; y (2) cada vez que tengas un total de 10 unidades o más en una columna, anula el 10 y añade una unidad a la columna inmediatamente a la izquierda. (Con el Nepohualtzintzin, se trabaja con 20 en lugar de 10. )

source: Example: 4+3+5+19+24=55
es: Ejemplo: 4 + 3 + 5 + 19 + 24 = 55

source: from left to right,
es: de izquierda a derecha,

source: carry 5s to next column
es: llevar 5s a la siguiente columna

source: Subtraction
es: Sustracción

source: Subtraction is the inverse of addition. Move out beads that correspond to the number you are subtracting. You can "borrow" from the column immediately to the left: subtracting one unit and adding 10 to the current column.
es: La resta es la inversa de la suma. Retira cuentas que corresponden al número que estás restando. Puedes "pedir prestado" de la columna inmediatamente a la izquierda: restando una unidad y añadiendo 10 a la columna actual.

source: Example: 26–2–4–6–10=4
es: Ejemplo: 26–2–4–6–10=4

source: cary 10 to the right
es: llevar 10 a la derecha

source: Multiplication
es: Multiplicación

source: There are several strategies for doing multiplication on an abacus. In the method used in the example below, the multiplier is stored on the far left of the abacus and the multiplicand is offset to the left by the number of digits in the multiplier. The red indicator is used to help keep track of where we are in the process.
es: Hay varias estrategias para hacer la multiplicación en un ábaco. En el método utilizado en el ejemplo siguiente, el multiplicador se almacena en el extremo izquierdo del ábaco y el multiplicando está desplazado a la izquierda por el número de dígitos en el multiplicador. El indicador rojo se utiliza para ayudar a mantener un seguimiento de dónde estamos en el proceso.

source: 486×24=? Begin by placing 24 in the left-most columns and 486 offset from the far right by two columns (since 24 has two digits). Set the indicator to the right of the multiplicand.
es: 486×24=? Comience poniendo 24 in las columnas de la izquierda y 486 a dos columnas de la derecha (ya que 24 tiene dos dígitos). Pon el indicador a la derecha del multiplicando.

source: Multiply the least-significant digits (LSD) of the multiplier (4) and multiplicand (6) and place the results (4×6=24) in the far right columns.
es: Multiplica los dígitos menos significativos (DMS) del multiplicador (4) y del multiplicando (6) y coloca los resultados (4 × 6 = 24) en las columnas de la extrema derecha.

source: Multiply the next digit in the multiplier (2, which corresponds to 2×10=20) and the LSD of the multiplicand (6) and add the results (2×6=12) on the right (advancing one column to the left to correspond to the power of the digit in the multiplier).
es: Multiplica el siguiente dígito en el multiplicador (2, que corresponde a 2 × 10 = 20) y el DMS del multiplicando (6) y agrega los resultados (2 × 6 = 12) a la derecha (avanza una columna a la izquierda para corresponder a la potencia del dígito en el multiplicador).

source: Move the indicator over one column to the left.
es: Mueve el indicador una columna más a la izquierda.

source: Repeat for the next digit in the multiplicand (8): 4×8=32
es: Repite para el siguiente dígito en el multiplicando (8): 4x8=32

source: Repeat for the next digit in the multiplicand (4): 4×4=16
es: Repite para el siguiente dígito en el multiplicando (4): 4×4=16

source: Clear the multiplier from the left and view the result: 486×24=11664
es: Limpia el multiplicador de la izquierda para ver el resultado: 486×24=11664

source: Division
es: División

source: Simple division (by a single-digit number) is the inverse of multiplication. In the example below, the dividend is put on the left (leaving one column vacant for the quotient) and the divisor on the right.
es: Una simple división (por un número de un solo dígito) es la inversa de la multiplicación. En el ejemplo siguiente, el dividendo se pone a la izquierda (dejando una columna vacante por el cociente) y el divisor a la derecha.

source: 123456789÷2=? Place the dividend (123456789) on the left, leaving one blank column. Place the divisor (2) on the right.
es: 123456789÷2=? Coloca el dividendo (123456789) a la izquierda, dejando una columna vacía. Coloca el divisor (2) a la derecha.

source: Working from the left to the right, divide a digit in the quotient and then move the indicator one column to the right. 1÷2=0.5
es: Trabajando desde la izquierda a la derecha, dividir un dígito en el cociente y luego mover el indicador de una columna a la derecha. 1÷2=0.5

source: The result is 61728394.5.
es: El resultado es 61728394.5.

source: Fractions
es: Fracciones

source: The fraction abacus lets you add and subtract common fractions: 1/2, 1/3, 1/4, 1/5, 1/6, 1/8, 1/9, 1/10, and 1/12, The fractional value is determined by the number of black beads on a rod, e.g., to work with thirds, use the rod with three beads, to work with fifths, use the rod with five beads.
es: La ábaco con fracciones permite sumar y restar fracciones comunes: 1/2, 1/3, 1/4, 1/5, 1/6, 1/8, 1/9, 1/10, 1/12 y, El valor fraccionario se determina por el número de perlas en negro en una varilla, ej. , Para trabajar con terceras partes, utilizar la varilla con tres cuentas, para trabajar con quintas partes, utilizar la varilla con cinco cuentas.

source: The rods with white beads are whole numbers in base 10; from left to right 100000, 10000, 1000, 100, 10, and 1.
es: Las varillas con las perlas blancos son números enteros en base 10; de izquierda a derecha 100000, 10000, 1000, 100, 10, y 1.

source: The toolbars
es: Las barras de herramientas

source: From left to right:
es: De izquierda a derecha:

source: project-toolbar button: see below
es: boton de barra de actividad: ver más abajo

source: edit-toolbar button: see below
es: boton de barra de edición: ver más abajo

source: abacus-toolbar button: see below
es: boton de barra de ábacos: ver más abajo

source: customization-toolbar button
es: boton de barra de personalización

source: clear button: clear the abacus
es: boton de limpieza: Borrado del ábaco

source: stop button: exit the activity
es: boton cerrar: salir de la actividad

source: copy: copy current value to clipboard
es: copiar: copia el valor del ábaco al portapapeles

source: paste: paste a value from the clipboard into the abacus
es: pegar: pega el valor del portapapeles en el ábaco

source: Decimal button: decimal abacus
es: boton decimal: ábaco decimal

source: Soroban button: Japanese abacus
es: boton Soroban: ábaco japones

source: Saupan button: Chinese abacus
es: boton Saupan: ábaco chino

source: Nepohualtzintzin button: Mayan abacus
es: boton Nepohualtzintzin: ábaco Maya

source: Hexadecimal button: hexadecimal abacus
es: boton hexadecimal: ábaco hexadecimal

source: Binary button: binary abacus
es: boton binario: ábaco binario

source: Schety button: Russian abacus
es: boton Schety: ábaco ruso

source: Fraction button: fraction abacus
es: boton fracciones: ábaco para fracciones

source: Caacupe button: fraction abacus with +/–
es: boton Caacupe: ábaco con fracciones con +/-

source: rod button: Cuisenaire-like abacus
es: boton barra: ábaco tipo Cuisenaire

source: custom button: your custom abacus
es: boton personalizar: tu propio ábaco

source: rods: select the number of rods:
es: varilla: seleccionar el número de varillas

source: top beads: select the number of beads on the top of the frame
es: perlas superiores: seleccionar el número de perlas en la parte superior del marco

source: bottom: select the number of beads on the bottom of the frame
es: inferior: seleccionar el número de perlas en la parte inferior del marco

source: factor: select the multiplication factor of top beads (e.g., on the Chinese abacus, each top bead counts as 5× the value of a bottom bead on the same rod)
es: factor: seleccionar el factor de multiplicación de las perlas superiores (ej. en el ábaco Chino, cada perla superior vale 5 veces el valor de la perla inferior en la misma varilla)

source: base: select the base to determine the value of bottom beads across rods; this is 10 on most conventional abacuses, but 20 on the Mayan abacus, 16 on the hexadecimal abacus, and 2 on the binary abacus.
es: base: seleccionar la base para determinar el valor de las perlas inferiores a traves de las varillas; es 10 en los ábacos más convencionales, pero 20 en el Maya, 16 en el hexadecimal y 2 en el ábaco binario.

source: create: you must push this button to activate the selections you've made
es: crear: debes presionar este boton para activar los parametros que has elegido

source: Gallery of abaci
es: Galería de ábacos

source: suanpan (Chinese)
es: Suanpan (chino)

source: soropan (Japanese)
es: Soropan (japonés)

source: schety (Russian)
es: Schety (Rusia)

source: nepohualtzintzin (Mayan)
es: Nepohualtzintzin (maya)

source: binary (base 2)
es: Binario (base 2)

source: fractions (1/2, 1/3, 1/4,...)
es: Fracciones (1/2, 1/3, 1/4,. . . )

source: Caacupe (fractions with +/–)
es: Caacupe (fracciones con +/-)

source: Cuisenaire-style rods (fractions)
es: Varillas de estilo Cuisenaire (fracciones)

source: custom, as shown: octal (base 8)
es: Personalizado, como se muestra: octal (base 8)

source: Learning with Abacus
es: Aprender con Abacus

source: `Some lesson plans <http://wiki.sugarlabs.org/go/Activities/Abacus/Worksheet>`_ for using Abacus are found here.
es: `Algunos planes de lecciones <http://wiki.sugarlabs.org/go/Activities/Abacus/Worksheet>`_ para el uso del ábaco se encuentran aquí.

source: Using beads or pebbles, you can make an abacus. What is the difference between the abacus on the computer and a physical abacus?
es: Usando perlas o piedras, se puede hacer un ábaco. ¿Cuál es la diferencia entre el ábaco en el ordenador y un ábaco físico?

source: It is possible to create a custom abacus. I often use the example of `Sumerian mathematics <https://en.wikipedia.org/wiki/Babylonian_mathematics#Sumerian_mathematics_.283000_.E2.80.94_2300_BC.29>`_: the Sumerians counted on the digital bones (phalanges) of their fingers, so the base of their counting system was 12. All of the 12s (and 60s) we have in our mathemateics, e.g., 12 hours, 60 seconds, etc. have their roots in Sumerian math. But the Sumerians never invented an abacus. What would a Sumerian abacus look like?
es: Es posible crear un ábaco personalizado. A menudo utilizo el ejemplo de `matemáticas sumerias <https://en.wikipedia.org/wiki/Babylonian_mathematics#Sumerian_mathematics_.283000_.E2.80.94_2300_BC.29>`_: los sumerios contaban con los huesos (falanges) de sus dedos, por lo que la base de su sistema de conteo fue 12. Todos los 12 (y 60) que tenemos en nuestras matematicas, ej. , 12 horas, 60 segundos, etc.. tienen sus raíces en las matemáticas sumerias. Pero los sumerios nunca inventaron el ábaco. ¿Cómo crees que sería un ábaco sumerio?

source: Extending Abacus
es: Extendiendo Ábaco

source: A fun project is to compare calculations using Abacus with the Calculate Activity. Which is faster? Which is more accurate? Which is better for estimating? Which is better for comparing?
es: Un proyecto divertido es comparar cálculos utilizando Abacus con la actividad Calcular. ¿Qué es más rápido? ¿Qué es más preciso? ¿Qué es mejor para la estimación? ¿Qué es mejor para comparar?

source: Abacus supports paste, so you can take numeric values from other programs and paste them into the abacus to see what their representations are; for example, I often paste numbers into the hexadecimal abacus as a quick way of converting decimal to hexidecimal.
es: Abaco soporta 'pegar', así que puedes tomar valores numéricos de otros programas y pegarlos en el ábaco para ver sus representaciones; por ejemplo, a menudo pego números en el ábaco hexadecimal como una forma rápida de convertir de decimal a hexadecimal.

source: Abacus also supports copy, so you can take a sum calculated on an abacus and export it into SimpleGraph or some other data-visualization Activities.
es: Abacus también soporta 'copiar', para que puedas tomar una suma calculada en un ábaco y exportarlo en SimpleGraph o algunas otra-actividad de visualización de datos.

source: A fun collaborative mode might be to have a number randomly selected and each sharer work independently to post it on the abacus of their choice first. There could be a tally of beads awarded for each correct answer.
es: Un modo de colaboración divertido podría ser la de tener un número seleccionado al azar y que cada partícipe independiente deba ponerlo en el ábaco de su elección. Podría haber un recuento de los granos otorgados por cada respuesta correcta.

source: Reporting Problems
es: Informar fallos

source: If you discover a bug in the program or have a suggestion for an enhancement, please `file a ticket <https://bugs.sugarlabs.org/newticket?component=Abacus>`_ in our bug-tracking system.
es: Si descubres un error en el programa o tienes una sugerencia para una mejora, por favor `llena un ticket <https://bugs.sugarlabs.org/newticket?component=Abacus>`_ en nuestro sistema de seguimiento de bugs.

source: You can `view the open tickets here. <https://bugs.sugarlabs.org/query?status=accepted&status=assigned&status=new&status=reopened&component=Abacus>`_
es: Puedes `ver los tickets abiertos aquí. <https://bugs.sugarlabs.org/query?status=accepted&status=assigned&status=new&status=reopened&component=Abacus> `_

source: References
es: Referencias

source: `Wiki page <http://wiki.sugarlabs.org/go/Activities/Abacus>`_
es: `Página Wiki <http://wiki.sugarlabs.org/go/Activities/Abacus>`_
