Repository: tony37/sledhelp
Catalog: translated_po/*/about_sugar.po
Languages: es

source: About Sugar
es: Acerca de Sugar

source: What is Sugar?
es: ¿Qué es Sugar?

source: *"We like to think that a child's play is unconstrained—but when children appear to feel joyous and free, this may merely hide from their minds their purposefulness; you can see this more clearly when you attempt to drag them away from their chosen tasks. For they are exploring their worlds to see what's there, making explanations of what those things are, and imagining what else could be; exploring, explaining and learning are among a child's most purposeful urges and goals. The playfulness of childhood is the most demanding teacher we have. Never again in those children's lives will anything drive them to work so hard." —Marvin Minsky, The Emotion Machine*
es: *"Nos gusta pensar que el juego de los niños no tiene restricciones, pero cuando parecen sentirse alegres y libres, esto puede simplemente esconderse de sus mentes su intencionalidad; se puede ver esto más claramente cuando se intenta arrastrarlos lejos de sus tareas elegidas. Porque ellos están explorando sus mundos para ver lo que hay allí, buscando explicaciones de cuáles son esas cosas, e imaginando ¿qué otra cosa podría ser?; explorar, explicar y aprender son los impulsos y objetivos más urgentes para un niño. La alegría de la infancia es el maestro mas exigente que tenemos. Nunca más en la vida de esos niños nada va llevarlos a trabajar tan duro. " -Marvin Minsky, La Máquina Emocional

source: Sugar is a learning platform that reinvents how computers are used for education. Collaboration, reflection, and discovery are integrated directly into the user interface. Sugar promotes "studio thinking [1]_" and "reflective practice [2]_". Through Sugar's clarity of design, children and teachers have the opportunity to use computers on their own terms. Students can reshape, reinvent, and reapply both software and content into powerful learning activities. Sugar's focus on sharing, criticism, and exploration is grounded in the culture of free and open-source software (FOSS).
es: Sugar es una plataforma de aprendizaje que reinventa cómo se usan las computadoras para la educación. Colaboración, reflexión, y el descubrimiento se integran directamente en la interfaz de usuario. Sugar promueve " pensamiento de estudio [1] _" y "práctica reflexiva [2] _". A través de la claridad del diseño de Sugar, los niños y los maestros tienen la oportunidad de utilizar las computadoras en sus propios términos. Los estudiantes pueden reformar, reinventar y reutilizar el software y contenido en poderosas actividades de aprendizaje. El enfoque de Sugar en compartir, la crítica, y la exploración se basa en la cultura del software libre y de código abierto (FOSS).

source: |sugar_sharing| Sugar facilitates sharing and collaboration. Children can write documents, share books and pictures, or make music together with ease.
es: |sugar_sharing| Sugar facilita el intercambio y la colaboración. Los niños pueden escribir documentos, compartir libros e imágenes, o hacer música juntos con facilidad.

source: |sugar_ring| There are no files, folders, or applications. Children interact with Activities. Activities includes an application, data, and history of the interaction that can be used to resume and reflect on the child's work.
es: |sugar_ring| No hay archivos, carpetas o aplicaciones. Los niños interactúan con Actividades. Las Actividades incluye una aplicación, los datos, y la historia de la interacción que se puede utilizar para reanudar y reflexionar sobre el trabajo del niño.

source: |sugar_backup| Everything is saved automatically. It is our goal that you will never lose your work. Documents will eventually be synced with a network server, adding additional protection.
es: |sugar_backup| Todo se guarda automáticamente. Nuestro objetivo es que tu nunca pierda tu trabajo. Los documentos eventualmente pueden ser sincronizados con un servidor de red, añadiendo protección adicional.

source: |sugar_journal| A Journal is used for accessing data. The Journal is a diary of things that you make and actions you take. It is a place to reflect upon your work.
es: |sugar_journal| Un diario se utiliza para acceder a los datos. El Diario es un registro de las cosas que tu haces y las acciones que tomas. Es un lugar para reflexionar sobre tu trabajo.

source: |opensource| Sugar is free and open-source software. Sugar is licensed under the GNU GPL; updates will always respect the freedom of its users.
es: |opensource| Sugar es software libre y de código abierto. Sugar está licenciado bajo la GNU GPL; las actualizaciones siempre respetaran la libertad de sus usuarios.

source: Note to parents and teachers The Sugar Philosophy
es: Nota para los padres y los maestros filosofía de Sugar

source: Information is about nouns. Learning is about verbs. The Sugar user interface differs from traditional user interfaces in that it is based on both cognitive and social constructivism. We believe that learners should engage in exploration and collaboration. The Sugar platform is based on three defining human principles. These are the pillars of user experience for learning:
es: La información es acerca de los sustantivos. El aprendizaje es sobre los verbos. La interfaz de usuario de Sugar difiere de interfaces de usuario tradicionales en tanto que se basa en el constructivismo cognitivo y social. Creemos que los estudiantes deben participar en la exploración y la colaboración. La plataforma Sugar se basa en tres principios humanos definitorios. Estos son los pilares de la experiencia del usuario para el aprendizaje:

source: Everyone is a teacher and a learner.
es: Todo el mundo es un maestro y un aprendiz.

source: Humans are social beings.
es: Los seres humanos son seres sociales.

source: Humans are expressive.
es: Los seres humanos son expresivos.

source: Two principles define the Sugar platform:
es: Dos principios definen la plataforma Sugar:

source: You learn through doing, so if you want to learn more, you want to do more.
es: Se aprende a través de hacer, así que si quieres aprender más, quieres hacer más.

source: Love is a better master than duty—you want people to engage in things that are authentic to them, things that they love. Internal motivation almost always trumps external motivations.
es: El amor es un mejor maestro que el deber. Quieres que la gente se dedique a las cosas que son auténticas para ellos,a las cosas que les gustan. La motivación interna casi siempre triunfa sobre las motivaciones externas.

source: Three experiences characterize the Sugar platform:
es: Tres experiencias caracterizan la plataforma Sugar:

source: Sharing: The Sugar interface always shows the presence of other learners. Collaboration is a first-order experience. Students and teachers dialog with each other, support each other, critique each other, and share ideas.
es: Compartir: La interfaz de Sugar siempre muestra la presencia de otros estudiantes. La colaboración es una experiencia de primer orden. Los estudiantes y profesores dialogan con otros, se apoyan entre sí, se critican unos a otros, y comparten ideas.

source: Reflecting: Sugar uses a "Journal" to record each learner's activity. The Journal serves as a place for reflection and assessment of progress.
es: Reflexión: Sugar utiliza un "Diario" para registrar la actividad de cada alumno. El Diario sirve como un lugar para la reflexión y evaluación de los progresos.

source: Discovering: Sugar can accommodate a wide variety of users, with different levels of skill in terms of reading, language, and different levels of experience with computing. It is easy to approach, yet it doesn't put an upper bound on personal expression. One can peel away layers and go deeper and deeper, with no restrictions.
es: Descubrir: Sugar puede dar cabida a una amplia variedad de usuarios, con diferentes niveles de habilidad en términos de lectura, lenguaje, y diferentes niveles de experiencia con la informática. Es fácil de abordar, sin embargo, no pone un límite a la expresión personal. Uno puede pelar capas e ir más y más profundo, sin restricciones.

source: Sugar is written in Python, an easy-to-learn interpreted language [3]_. This allows the direct appropriation of ideas in whatever realm the learner is exploring; music, browsing, reading, writing, programming, or graphics. The student can go further. They are not going to hit a wall. They can, at every level, engage with and affect the very tools they are using for their personal expression.
es: Sugar está escrito en Python, un lenguaje de programación interpretado fácil de aprender [3] _. Esto permite que la apropiación directa de las ideas en cualquier ámbito el alumno está estudiando; música, navegación, lectura, escritura, programación o gráficos. El estudiante puede ir más allá. Ellos no van a chocar contra un muro. Pueden, en todos los niveles, comprometerse y afectar las mismas herramientas que utilizan para su expresión personal.

source: Throughout this manual we have added brief "Note to parents and teachers" sections which explains the philosophy behind the Sugar platform. We hope these sections help you guide your children and students through the learning process.
es: A lo largo de este manual, hemos añadido breves "Nota para los padres y maestros" secciones que explican la filosofía detrás de la plataforma Sugar. Esperamos que estas secciones ayudan a guiar a tus hijos y alumnos a través del proceso de aprendizaje.

source: Sugar was designed for One Laptop per Child (OLPC), as part of an effort to provide an opportunity for a quality education to every children through the distribution of connected laptop computers, our most powerful tools for expression. Sugar is the user interface used on the OLPC XO laptop.
es: Sugar fue diseñado para One Laptop per Child (OLPC), como parte de un esfuerzo para proporcionar una oportunidad para una educación de calidad a todos los niños a través de la distribución de computadoras portátiles conectadas, nuestras más poderosas herramientas para la expresión. Sugar es la interfaz de usuario que se utiliza en la computadora portátil OLPC XO.

source: Sugar Labs is a non-profit foundation whose mission is to produce, distribute, and support the use of the Sugar learning platform. Sugar Labs supports the community of educators and software developers who want to extend the platform and who have been creating Sugar Activities. Sugar is a community project. It is available under the open-source GNU General Public License (GPL) and free to anyone who wants to use or extend it.
es: Sugar Labs es una fundación sin fines de lucro cuya misión es producir, distribuir y apoyar el uso de la plataforma de aprendizaje Sugar. Sugar Labs apoya la comunidad de educadores y desarrolladores de software que quieran ampliar la plataforma y que han creado Actividades para Sugar. Sugar es un proyecto de la comunidad. Está disponible bajo la licencia GNU General Public License (GPL) y es libre para cualquier persona que quiera utilizar o ampliarlo.

source: Studio thinking is a term used to describe how visual arts teachers teach and what visual arts students learn. The term is detailed in Studio Thinking: The Real Benefits of Visual Arts Education. Studio thinking includes "studio structures": demonstrations, projects, and critiques; as well as "studio habits of mind": develop craft, engage and persist, envision, express, observe, reflect, stretch and explore, and understand the art world. In the context of Sugar, studio thinking is applied not just to the arts, but to all disciplines.
es: Pensamiento de Estudio es un término usado para describir cómo los maestros y los estudiantes enseñan y aprenden las artes visuales. El término se detalla en 'Studio Thinking: The Real Benefits of Visual Arts Education'. Pensamiento de Estudio incluye "las estructuras de estudio": demostraciones, proyectos y críticas; así como "los hábitos de estudio de la mente": desarrollar la artesanía, participar y persistir, Envision, expresar, observar, reflexionar, ir más alla y explorar y entender el mundo del arte. En el contexto de Sugar, pensamiento de estudio se aplica no sólo a las artes, sino a todas las disciplinas.

source: Reflective practice is a concept introduced by Donald Schön in his book The Reflective Practitioner. Reflective practice involves students applying their own experiences to practice while being mentored by domain experts. In the context of Sugar, the expert could be a teacher, a parent, a community member, or a fellow student.
es: La práctica reflexiva es un concepto introducido por Donald Schön en su libro The Reflective Practitioner. La práctica reflexiva involucra a los estudiantes aplicando sus propias experiencias a practicar mientras que reciben orientación de expertos del dominio. En el contexto de Sugar, el experto podría ser un maestro, un padre, un miembro de la comunidad, o un compañero de estudios.

source: An interpreted language is a programming language whose instructions are interpreted "on the fly" (or compiled to a virtual machine code) as opposed to precompiled. The significance of interpreted languages to the Sugar platform include: platform independence, ease of debugging, ready access to source code, and small program size. Python is a general-purpose, high-level programming language. It emphasizes code readability and features a minimalist syntax and comprehensive standard library.
es: Un lenguaje interpretado es un lenguaje de programación cuyas instrucciones se interpretan "sobre la marcha" (o compilado a un código de máquina virtual) en lugar de precompilado. La importancia de los lenguajes interpretados en la plataforma Sugar incluyen: independencia de la plataforma, la facilidad de depuración, el fácil acceso al código fuente, y el pequeño tamaño del programa. Python es un lenguaje de propósito general, de alto nivel. Se hace hincapié en la legibilidad del código y cuenta con una sintaxis minimalista y una biblioteca estándar integral.
