Repository: tony37/sledhelp
Catalog: translated_po/*/battery.po
Languages: es

source: Charging the Battery
es: Carga de la batería

source: Using battery power
es: El uso de energía de la batería

source: The XO needs its battery or to be plugged into a wall directly. The laptop will run from either source of power. When you get your battery it should come with some amount of charge. Use the following instructions to install your battery and charge your laptop.
es: La XO necesita su batería cargada o estar conectado a una pared directamente. El portátil se ejecutará desde cualquier fuente de alimentación. Al recibirla tu batería debe venir con una cierta cantidad de carga. Utiliza las siguientes instrucciones para instalar la batería y cargar tu portátil.

source: This is the XO battery. The battery goes on the back of your XO.
es: Esta es la batería XO. La batería va en la parte posterior de su XO.

source: Installing the battery
es: Instalación de la batería

source: Line up the four tabs on the new battery with the long edge furthest from the catches.
es: Alinea las cuatro pestañas de la nueva batería con el borde más largo de las ranuras.

source: Drop the battery into place.
es: Deja caer la batería en su lugar.

source: Slide the left-hand side catch to the left, and press the battery gently into place.
es: Desliza la pestaña de la parte izquierda a la izquierda, y presiona suavemente la batería en su lugar.

source: Slide the right-hand side catch to the left, to lock the battery in place.
es: Desliza la pestaña derecha hacia la izquierda, para bloquear la batería en su lugar.

source: Charging the battery
es: Carga de la batería

source: Ensure that the battery is in the back of the XO's case.
es: Asegúrate de que la batería está en la parte posterior del cuerpo de la XO.

source: Plug the power cord into your XO.
es: Conecta el cable de alimentación en su XO.

source: Plug the other end of the power cord into the nearest power source, such as the one connected to the school's generator or a 12 Volt car battery.
es: Enchufa el otro extremo del cable de alimentación a la fuente de energía más cercana, como el que está conectado al generador de la escuela o una batería de coche de 12 voltios.

source: Plugging in your XO
es: La conexión de tu XO

source: You can use your XO while it is plugged in, when you are charging the battery or when you have a good source for power. For power sources, you can use the generator supplied by your school, the electrical grid, or another source of electricity.
es: Puede utilizar tu XO mientras está enchufado, cuando se carga la batería o cuando se tiene una buena fuente de alimentación. Para las fuentes de energía, puedes utilizar el generador suministrado por su escuela, la red eléctrica, u otra fuente de energía eléctrica.

source: When to charge the battery
es: Cuándo cargar la batería

source: The battery icon in the Frame fills with color, showing you the current charge, or amount of power in the battery. Move the pointer over the battery icon to see how full the battery is. While the battery charges, the battery light near the power button (shaped like a battery) should display yellow, turning to green when the battery is fully charged. A red light tells you that the battery is running very low and you should charge it soon.
es: El icono de la batería en el marco muestra con color, la carga actual, o la cantidad de energía en la batería. Mueve el puntero sobre el icono de la batería para ver cómo se encuentra la batería. Mientras se carga la batería, la luz de la batería cerca del botón de encendido (con forma de batería) se muestra amarilla, tornandose verde cuando la batería está completamente cargada. Una luz roja indica que la batería está muy baja y que se debe cargar pronto.

source: Troubleshooting
es: Solución de Problemas

source: If your battery charge gets extremely low during shipping, your XO may not start up. Plugging in external power may not charge the battery.
es: Si la carga de la batería se pone extremadamente baja durante el transporte, el XO no arrancará. La conexión de alimentación externa no puede cargar la batería.

source: The solution is to remove the battery, power up the laptop on external power and then insert the battery. Then it will charge and the charging light will be on.
es: La solución es quitar la batería, encender el ordenador portátil con alimentación externa y luego insertar la batería. Entonces, se cargará y la luz de carga se encenderá.

source: If you're the tinkering type, several more advanced battery troubleshooting tips are at: http://wiki.laptop.org/go/XO_Troubleshooting_Battery.
es: Si eres del tipo que investiga, varios consejos más avanzados de solución de problemas de la batería se encuentran en: http://wiki.laptop.org/go/XO_Troubleshooting_Battery.

source: Locating a battery for replacement
es: Localización de una batería de reemplazo

source: Refer to http://wiki.laptop.org/go/Directory_of_repair_centers to get to the most recent directory of repair centers, and ask for a replacement battery for your XO.
es: Consulta http://wiki.laptop.org/go/Directory_of_repair_centers para llegar al directorio más reciente de centros de reparación, y solicitar una batería de repuesto para tu XO.
