Repository: tony37/sledhelp
Catalog: translated_po/*/browse.po
Languages: es

source: Browse
es: Navegar

source: About
es: Acerca de

source: The Browse activity is your means to explore a wider source of information and content that can be found in what's called the World Wide Web (Internet or Web for short). Although there are some built-in information included on this activity (OLPC Library), to make the most of this activity you need an internet connection. Please see the chapter on "Neighborhood View and Connecting to the Internet".
es: La actividad Navegar es tu medio para explorar una fuente amplia de información y el contenido que se puede encontrar en lo que se llama World Wide Web (Internet o Web para abreviar). Aunque hay algo de información integrada incluida en esta actividad (OLPC Library), para sacar el máximo provecho de esta actividad necesitas una conexión a Internet. Por favor, ve el capítulo sobre "Vista de Vecindario y conexión a Internet".

source: The first thing that you will see when you first click on the Browse icon from the Home View is what's called the Home page.
es: Lo primero que veras la primera vez que haces clic en el icono Navegar en la vista principal es lo que se llama la página de inicio.

source: Using Browse
es: Utilización de Navegar

source: **Toolbar**
es: **Barra de herramientas**

source: Activity Tool
es: Herramienta de Actividad

source: Text/Edit Tool
es: Texto/Herramienta de Edición

source: View Tool
es: Herramientas de Visualización

source: Home
es: Casa

source: Address Bar (URL)
es: Barra de direcciones (URL)

source: Refresh/Reload
es: Actualizar / Recargar

source: Navigation Arrows (Back & Forward)
es: Flechas de navegación (Atras y adelante)

source: Bookmark
es: Marcador

source: Stop
es: Salir

source: Window tab
es: Pestaña Ventana

source: (Note: To see the name of the tool/button, you can put your mouse arrow on top of its picture)
es: (Nota: Para ver el nombre del botón de la herramienta, puedes poner su flecha del ratón en la parte superior de su imagen)

source: **Activity**
es: **Actividad**

source: **Browse Journal Entry Name** - This will serve as the name of the Journal entry. Change this to something distinctive especially when you have multiple window tabs opened that's related to one particular topic.
es: ** Nombre de Entrada en el Diario ** - Este será el nombre de la entrada en el Diario. Cambia esto a algo distintivo sobre todo cuando se ha abierto múltiples pestañas de las ventanas que está relacionado con un tema en particular.

source: **Browse Description Bar** - This will serve as the **Browse** activity description in the Journal.
es: **Descripción** - Esto servirá como la descripción de la actividad en el Diario.

source: **Privacy Tool** - Use this to change the privacy setting of the current Browse activity. The default is set to Private.
es: ** Herramienta de privacidad ** - Utiliza esta opción para cambiar la configuración de privacidad de la actual actividad Navegar. El valor predeterminado es privado.

source: **Text Finder and Edit Tool**
es: ** Buscar Texto y Herramientas de edición **

source: **Undo** - The Browse activity remembers the last change that you've made on the page. Use this button to step back to the last change that you made.
es: **Deshacer** - La actividad Navegar recuerda el último cambio que usted ha hecho en la página. Utiliza este botón para retroceder al último cambio que realizó.

source: **Redo** - Use this button to go back to the current changes that you made after doing an "Undo".
es: **Rehacer** - Utiliza este botón para volver a los cambios actuales que realizó después de hacer un "Deshacer".

source: **Copy** - This is used to copy a text or passage from the current page you are viewing. To do this, you need to first highlight (left-click while dragging your mouse arrow) the text. You know you've highlighted a text when its background color turned grey. Then, press this tool to copy it to the clipboard. A small image on the left hand side of the frame will appear. This "holds" the text you just copied. You can now "paste" this text or just simply click and drag it to other activities. The copied text will disappear once the XO is restarted or shutdown.
es: **Copiar** - Se utiliza para copiar un texto o pasaje de la página que está viendo. Para ello, es necesario en primer lugar destacador (clic con el botón izquierdo mientras arrastra el puntero del ratón) el texto. Tu sabes que ha resaltado un texto cuando su color de fondo se volvió gris. A continuación, pulse esta herramienta para copiarlo en el portapapeles. Aparecerá una pequeña imagen en el lado izquierdo del marco. Este "contiene" el texto que acaba de copiar. Ahora puede "pegar" este texto o simplemente hacer clic y arrastrar a otras actividades. El texto copiado desaparecerá una vez que el XO se reinicia o es apagado.

source: **Paste** - This tool is for pasting texts from other activities into the current page that you are viewing. You can only paste texts on areas of the page where pasting is allowed. It will remember this text until the XO is restarted or shutdown.
es: ** Pega ** - Esta herramienta es para pegar textos de otras actividades en la página actual que está viendo. Sólo se puede pegar textos en áreas de la página donde se permite pegar. Se recordará este texto hasta que el XO se reinicia o es apagado.

source: **Text Search Bar** -This tool is great to use when you need to quickly find a text on a current page you're viewing. Press the enter key to go down the page. The text that you are looking for would be highlighted in green. Press the little "x" symbol on the right of the bar to erase the text.
es: **Búsqueda de texto** -Esta herramienta es de gran utilidad cuando se necesita para encontrar rápidamente un texto en una página que estás visualizando. Pulsa la tecla Intro para pasar a la página. El texto que está buscando se resalta en verde. Pulsa el símbolo pequeño "x" a la derecha de la barra de borrar el texto.

source: **Text Search Navigation Arrows** - While you can press the Enter key to search down the page, these arrows are useful to search the page. Use the left arrow to go back up the page and the right arrow to go down the page.
es: **Flechas de navegación de búsqueda de texto** - Si bien puedes pulsar la tecla Intro para buscar abajo de la página, estas flechas son útiles para buscar la página. Usa la flecha izquierda para volver a subir la página y la flecha derecha para avanzar en la página.

source: **View Tool**
es: **Herramienta visualizar**

source: **Zoom Out** - When you want to see more of the page, use this tool to make it smaller.
es: **Alejar** - Cuando quieres ver más de la página, utilice esta herramienta para hacerlo más pequeño.

source: **Zoom In** - When you want to see things better, use this tool to make the page bigger.
es: **Acercar** - Cuando quieras ver las cosas mejor, utiliza esta herramienta para hacer la página más grande.

source: **Full Screen** - You can press this to see the entire page without the toolbar.
es: **Pantalla completa** - Puedes presionar esto para ver la página completa sin la barra de herramientas.

source: **Tray Toggle button** - This tool only works when you have things on the tray (the space on the bottom of the Browse page) like pages that you have bookmarked (Please see bookmark description). Use this tool to make the tray visible or invisible. Browse remembers your bookmarked pages even when the tray is not visible. Just simply make it visible again to see those bookmarks.
es: **Botón mostrar/ocultar bandeja** - Esta herramienta sólo funciona cuando tienes cosas en la bandeja (el espacio en la parte inferior de la página Navegar) como las páginas que has marcado como favoritos (Por favor vea la descripción marcador). Utilice esta herramienta para hacer la bandeja visible o invisible. Navegar recuerda a tus páginas favoritas incluso cuando la bandeja no es visible. Simplemente hacerla visible de nuevo para ver los marcadores.

source: **Home Icon**
es: **Icono Inicio**

source: Clicking this takes you back to the Home Page. Useful when you're lost and need a starting point.
es: Al hacer clic en este te lleva de vuelta a la página inicial. Útil cuando estás perdido y necesita un punto de partida.

source: **Address Bar**
es: **Barra de direcciones**

source: Each page on the internet has its own address. The address bar shows you the current web address of the page you are viewing. If you know the web address of a page, you can type it on this bar and press the enter key to navigate to that page.
es: Cada página en Internet tiene su propia dirección. La barra de direcciones muestra la dirección Web de la página que está viendo. Si conoces la dirección de una página, puedes escribirlo en esta barra y pulsar la tecla Intro para ir a esa página.

source: **Bookmark**
es: **Favoritos**

source: Sometimes it is useful to remember the pages that you visited. Clicking this icon will save the web address of the current page you are viewing. A small thumbnail image of this page will appear on the bottom(tray). Bookmarks are saved only on the current Browse activity. They will not show up when you open a new Browse activity.
es: A veces es útil recordar las páginas que has visitado. Al hacer clic en este icono guardar la dirección web de la página que está viendo. Una imagen en miniatura de esta página aparecerá en la parte inferior (bandeja). Los marcadores se guardan sólo en la actual actividad Navegar. Ellos no se mostrarán cuando se abre una nueva actividad Navegar.

source: **Stop Activity Tool** Closes the current Browse activity.
es: **Herramienta Salir** Cierra la actividad Navegar.

source: **OLPC Library**
es: **Biblioteca OLPC**

source: The Browse activity has built in books, information and pages that you can access even without a connection to the internet. Click on any of the texts to see what you can find. Have fun exploring!
es: La actividad Navegar tiene incluidos libros, información y páginas que se puede acceder incluso sin una conexión a Internet. Haz clic en cualquiera de los textos para ver lo que puedes encontrar. Diviértete explorando!

source: Copying Images From The Web
es: Copiar imágenes de la Web

source: Every time you create something whether it's a poem, a book or a nice picture, you own those works. The internet is filled with information and works that result from hard work and creativity of other people. Some owners of those work like to share them freely, but others don't or require that you give them the credit. Sometimes this information can be found on the page you are viewing. When in doubt make sure to make a note in your documentation on where you found the information. A great page for further reading: http://www.copyrightkids.org/
es: Cada vez que creas algo, ya sea un poema, un libro o una buena foto, tu eres dueño de esas obras. El Internet está lleno de información y obras que resultan del trabajo duro y la creatividad de otras personas. Algunos de los propietarios de los trabajos gustan compartir libremente, pero otros no lo hacen o requieren que tu les des el crédito. A veces esta información se puede encontrar en la página que se está viendo. En caso de duda, asegúrate de hacer una nota con tu documentación en donde encuentraste la información. Una gran página para lectura adicional: http://www.copyrightkids.org/

source: To copy an image, point your mouse arrow on the picture and right-click on it (press the button on the bottom of your track pad that has a circle on it). A box similar to the picture shown above will appear with information on the source or web address of the picture along with the file name of the picture. There are two ways to copy an image:
es: Para copiar una imagen, coloca el cursor del ratón sobre la imagen y haz clic en él (pulsa el botón en la parte inferior de su trackpad que tiene un círculo en él). Un cuadro similar a la imagen mostrada anteriormente aparecerá con la información del origen o sobre la dirección en la web de la imagen junto con el nombre del archivo de la imagen. Hay dos formas de copiar una imagen:

source: **Keep Image** - this will put a copy of the image to the Journal.
es: **Mantener la imagen** - esto pondrá una copia de la imagen en el Diario.

source: **Copy Image** - this will place a copy of the image to the clipboard, which you can then drag and drop to another activity. This copy is temporary and will disappear from the clipboard when you shutdown the XO. So if you need to save the image, it is best to do a "Keep Image" instead.
es: **Copiar imagen** - esto colocará una copia de la imagen en el portapapeles, que luego se puede arrastrarlo a otra actividad. Esta copia es temporal y desaparecerá del portapapeles al apagar la XO. Así que si tu necesitas guardar la imagen, lo mejor es hacer "Mantener la Imagen.

source: Learning with Browse
es: Aprender con Navegar

source: Browse gives access to the internet which is a powerful information and communication tool and allows students to participate in the global community and experience. There are so many things on the web that you can use and incorporate in your classroom, but one of the many great ways to start is to help students make sense of where they are in relation to this global context. How far are they from the earthquake's epicenter that rocked Japan? Where is their country's capital? How big is their country compared to others? Where are the historical places in their country and the world that shaped human history and culture? One of the many great tools on the web that can be readily and freely accessed is Google maps (type this on the address bar): http://maps.google.com/
es: Navegar da acceso a la Internet, que es una poderosa herramienta de información y comunicación y permite a los estudiantes participar en la comunidad global y experimentarla. Hay tantas cosas en la web que se puede utilizar e incorporar en tu salón de clases, una de las muchas maneras de comenzar es ayudar a los estudiantes a buscar sentido de dónde están en relación con este contexto global. ¿A qué distancia estan del epicentro del terremoto que sacudió a Japón? ¿Dónde está la capital de su país? ¿Qué tan grande es su país en comparación con otros? ¿Dónde están los lugares históricos de su país y al mundo que dio forma a la historia y la cultura humana? Una de las muchas herramientas en la web que se puede acceder fácilmente y libremente son los mapas de Google (tipeando esto en la barra de direcciones): http://maps.google.com/

source: If you live in an area that is adequately mapped by Google Maps, you can ask students to use the "Get directions" tool on the page to see how they can go from one place to another. The directions tool can also teach students a sense of distance by showing how far two places are from each other. Example, how far do they travel every day for school (Given that sense of distance, how far and how long will it take to get to the nearest city or town)?
es: Si vives en un área cuyo mapa se ve adecuadamente en Google Maps, puede pedir a los estudiantes a utilizar la herramienta de "Cómo llegar" en la página para ver cómo se puede ir de un lugar a otro. La herramienta de direcciones también puede enseñar a los estudiantes un sentido de la distancia, que muestra cuan lejos dos lugares estan el uno del otro. Ejemplo, ¿cuanto viajan todos los días a la escuela (Dando sentido a la distancia, hasta dónde y cuánto tiempo se tarda en llegar a la ciudad o pueblo más cercano)?

source: Extending Browse
es: Extendiendo Navegar

source: There's a built in Google search bar on the home page of Browse that you can direct students to aid in their research. Help them narrow or expand their search texts to come up with better search results.
es: Hay una barra de búsqueda de Google incluida en la página principal de Navegar que puede dirigir a los estudiantes para ayudar en su investigación. Ayúdales estrechando o ampliando sus textos de búsqueda para llegar a mejores resultados de la búsqueda.

source: To allow students to be active participants in the global community, communication tools can be freely and readily accessed via Browse: from creating free e-mail accounts to tools that allow people to create their own internet sites and pages.
es: Para permitir que los estudiantes participen activamente en la comunidad global, herramientas de comunicación pueden ser accesibles libre y fácilmente a través de Navegar: desde la creación de cuentas de correo electrónico gratuitas hasta herramientas que permiten a la gente crear sus propios sitios de Internet y las páginas.

source: But like with any type of exploration, you have to start with caution. Not all information on the internet is good. Start with educating kids to safely use and explore the internet. You can check out sites like: http://www.wiredkids.org/kids/index.html for more information.
es: Pero al igual que con cualquier tipo de exploración, tienes que comenzar con precaución. No toda la información en el Internet es buena. Comience educacando a los niños a utilizar con seguridad y explorar internet. Usted puede comprobar sitios como: http://www.wiredkids.org/kids/index.html para más información.

source: Where to report problems
es: Dónde reportar problemas

source: In http://bugs.sugarlabs.org, component Browse.
es: En http://bugs.sugarlabs.org, componente Browse (Navegar).

source: Credits
es: Créditos

source: Browse was developed and maintained by: Lucian, Sascha Silbe, erikos, manuq
es: Navegar fue desarrollado y mantenido por: Lucian, Sascha Silbe, erikos, manuq

source: Browse can be downloaded from the `Sugar Labs Activities repository <http://activities.sugarlabs.org/>`_.
es: Navegar se puede descargar desde el `repositorio de Actividades Sugar Labs <http://activities.sugarlabs.org/>`_.
