Repository: tony37/sledhelp
Catalog: translated_po/*/calculate.po
Languages: es

source: Calculate
es: Calcular

source: About
es: Acerca de

source: Using Calculate
es: Utilizando Calcular

source: For those who have used a scientific calculator, most of the functions of Calculate will be quite familiar.
es: Para aquellos que han utilizado una calculadora científica, la mayoría de las funciones de Calcular serán muy familiares.

source: The Toolbars are
es: Las barras de herramientas son

source: Activity, Calculate icon: Name session, Journal entry description, collaborate
es: Actividad, icono Calcular: Nombre de Sesión, descripción de la entrada en el Diario, colaborar

source: Edit, scissors icon: Copy, Paste
es: Editar, icono de las tijeras: Copiar, Pegar

source: Functions, {x}: Square, square root, reciprocal, exponential, power, logarithm, factorial
es: Funciones, {x}: Cuadrado, Raíz cuadrada, recíproca, exponencial, potencia, logaritmo, factorial

source: Trigonometry, triangle icon: sin, cos, tan, sin-1, cos-1, tan-1, sinh, cosh, tanh
es: Trigonometría, icono triángulo: seno, coseno, tangente, arcoseno, arcocoseno, arcotangente, seno hiperbólico, coseno hiperbólico, tangente hiperbólica

source: Boolean, Venn diagram icon: and, or, =, !=
es: Booleanos, icono diagrama de Venn: y, o, =, =!

source: Constants, Greek letters icon: pi, e, gamma, phi
es: Constantes, letras griegas icono: pi, e, gamma, phi

source: Plot: Hover menu offers Help
es: Graficos: menú ofrece Ayuda

source: Degrees/Radian angle measure
es: Grados/Radianes para la medida de ángulos

source: Scientific/Engineering notation
es: Notación Científico / Ingeniería

source: Number of digits to show: 6, 9, 12, 15
es: Número de dígitos a mostrar: 6, 9, 12, 15

source: Base: Decimal, binary, octal, hex
es: Base: decimal, binaria, octal, hexadecimal

source: Exit
es: Salir

source: Getting help
es: Obteniendo ayuda

source: To see a help option for plot, enter the command
es: Para ver una opción de ayuda para gráficas, entre el mandato

source: on the text entry line.
es: en la línea de entrada de texto.

source: The general help function is
es: La función de ayuda general es

source: The list of help topics is available with the command
es: La lista de temas de ayuda está disponible con el comando

source: including topics not supported on the menus. Help is not provided for the constants pi, e, gamma (Euler-Mascheroni Constant) and phi (Golden Ratio), but these can be looked up on the Internet. Clicking their icons inserts their numeric values.
es: incluyendo temas que no son compatibles en los menús. La ayuda no se proporciona para las constantes pi, e, gamma (Euler-Mascheroni constante) y phi (Golden Ratio), pero éstas se puede consultar en Internet. Al hacer clic en sus iconos inserta sus valores numéricos.
