Repository: tony37/sledhelp
Catalog: translated_po/*/collaborating.po
Languages: es

source: Collaborating
es: Colaborando

source: About Collaborating
es: Acerca de la Colaboración

source: One of the most important features of Sugar is the ability for you to collaborate, or network, and share a project that you are working on with others. This can take the form of multiple cursors in a document, multiple musical instruments, two players in a game, multiple uses in chat (below), and so on. Many Activities support collaboration, see below, :ref:`Where to get Collaborating`
es: Una de las características más importantes de Sugar es la capacidad para que tu puedas colaborar, y compartir un proyecto que se está trabajando con los demás. Esto puede tomar la forma de múltiples cursores en un documento, múltiples instrumentos musicales, dos jugadores en un juego, múltiples usos en el chat (abajo), etc.. Muchas actividades soportan la colaboración, véase más adelante,: ref: `¿Dónde conseguir Colaboración`

source: This image is from the Activity toolbar of Write, which is an Activity which supports collaboration.
es: Esta imagen es de la barra de herramientas de la actividad Escribir, que es una actividad que apoya la colaboración.

source: The highlighted button is the collaboration, or sharing, "switch". The options are
es: El botón resaltado es para colaborar o compartir. Las opciones son

source: |Home_key_f3_small.png| Home icon, which, when you hover the cursor over, reveals "Private". This is the non-sharing option, with no networking.
es: | Home_key_f3_small. png | Icono Inicio, que, cuando se pasa el cursor sobre el muestra "Privado". Esta es la opción de no compartir, sin redes.

source: |Neighborhood_key| Neighborhood icon, which, when you hover the cursor over, reveals "My Neighborhood". This is the sharing option, that is, networked.
es: | Neighborhood_key | Icono Vecindario, que, cuando se pasa el cursor sobre, revela "Mi Vecindario". Esta es la opción de uso compartido, es decir, en red.

source: In some activities, the collaboration button is grayed (disable), that means the activity can't collaborate.
es: En algunas actividades, el botón de colaboración está en gris (deshabilitado), eso significa que la actividad no puede colaborar.

source: Chatting in Chat
es: Charla en el Chat

source: An example of collaboration, or networking, is chatting. Chatting is available in the Sugar Activity Chat.
es: Un ejemplo de colaboración, o trabajo en red, es charlar (chat). Charlar está disponible en la actividad Sugar Charlar.

source: Collaboration in Distance Activity
es: Colaboración en la actividad Distancia

source: If you want to share with one of your friends, inside the Activity that you want share, click on the "Home" icon that says "Private" then click on the "Neighborhood" icon, like below.
es: Si quieres compartir con uno de tus amigos, dentro de la actividad que desea compartir, haz clic en el icono "Inicio" que dice "Privado" y luego haz clic en el icono de "Vacindario", a continuación.

source: This will make it available to all other persons connected to your same Ad-hock network. An icon of the Activity you are sharing will appear in the Neighborhood view inviting others to join. To join, all they will need to do is hover over the icon of the Activity you are sharing and click join. (This is also how you join the work of others when they share with you).
es: Esto hará que sea disponible para todas las personas conectadas a la misma red. Un icono de la Actividad que estás compartiendo aparecerá en la vista de Vecindario invitando a otros a unirse. Para participar, lo único que tendrán que hacer es sostener el cursor sobre el icono de la Actividad que van a compartir y hacer clic en Unirse. (Así es también como se suma al trabajo de los demás cuando comparten contigo).

source: Where to get Collaborating
es: Dónde obtener Colaborar

source: Collaborating is a built-in function in the following Activities provided in the current Sugar distribution:
es: La colaboración es una función incorporada en las siguientes actividades previstas en la distribución actual del Sugar:

source: Browse
es: Navegar

source: Calculate
es: Calcular

source: Chat
es: Charlar

source: Distance
es: Distancia

source: Image Viewer (not marked Favorite)
es: Visor de imágenes (no marcada como favorita)

source: Implode
es: Implosión

source: Maze
es: Laberinto

source: Memorize
es: Memorizar

source: Read
es: Leer

source: Record
es: Registro

source: Speak
es: Hablar

source: Write
es: Escribir

source: Not all Activities are able to collaborate. There are many others available in the `Sugar Labs Activities repository <http://activities.sugarlabs.org/>`_
es: No todas las actividades son capaces de colaborar. Hay muchos otros disponibles en el `repositorio de actividades de Sugar Labs <http://activities.sugarlabs.org/>. sugarlabs. org /> `_
