Repository: tony37/sledhelp
Catalog: translated_po/*/distance.po
Languages: es

source: Distance
es: Distancia

source: About
es: Acerca de

source: Distance (earlier known as Acoustic Tape Measure) determines the physical distance between two computers by measuring how long it takes sound pulses to travel between them.
es: Distancia (anteriormente conocido como cinta métrica acústica) determina la distancia física entre dos equipos midiendo el tiempo que tardan pulsos de sonido para viajar entre ellos.

source: Download
es: Descargar

source: `Activity page in our activities portal <http://activities.sugarlabs.org/en-US/sugar/addon/4264>`_
es: `Página de la actividad en nuestro portal de actividades <http://activities.sugarlabs.org/en-US/sugar/addon/4264>`_

source: `Git Repository <http://git.sugarlabs.org/distance>`_
es: `Repositorio Git <http://git.sugarlabs.org/distance>`_

source: Using Distance
es: Utilizando Distancia

source: You need two laptops in order to use this activity.
es: Se necesitan dos ordenadores portátiles con el fin de usar esta actividad.

source: Steps
es: Pasos

source: Launch the Distance activity on one of the computers by clicking on the icon in the Home view.
es: Inicia la actividad a distancia en uno de los equipos haciendo clic en el icono en la vista de inicio.

source: Share the activity from the Share icon on the activity toolbar (or send an invitation to the another computer).
es: Comparte la actividad desde el icono de Compartir en la barra de herramientas de actividad (o envia una invitación a la otra computadora).

source: Launch the Distance activity on the second computer by clicking on the icon in the Neighborhood view (or Invitation icon).
es: Inicia la actividad Distancia en el segundo equipo, haciendo clic en el icono de la Vista Vecindario (icono o invitación).

source: Click on the "Begin Measuring Distance" button found near the top of the activity view on both computers.
es: Haga clic en el botón "Comenzar Medición.de.la.distancia" que se encuentra en la parte superior de la actividad en ambos equipos.

source: The first computer will send an audio pulse; the second computer will respond with an audio pulse of its own; then both computers will calculate and display the distance between them (by default, the measurement is displayed in meters).
es: El primer equipo enviará un pulso de audio; el segundo equipo responderá con otro pulso de sonido; a continuación, en ambos equipos se calculará y mostrará la distancia entre ellos (por defecto, la medición se muestra en metros).

source: This process (Step 5) will repeat until you click on the "Stop Measuring Distance" button or you exit the activity.
es: Este proceso (Paso 5) se repite hasta que hagas clic en el botón "Detener la medición de Distancia" o se salga de la actividad.

source: Notes
es: Notas

source: Try not to move the laptops while a measurement is taking place as it will result in a inaccurate measurement. You can move them between consecutive measurements.
es: Trata de no mover las computadoras portátiles mientras una medición se está llevando a cabo, ya que dará lugar a una medición inexacta. Puedes moverlos entre mediciones consecutivas.

source: If the "Begin Measuring Distance" button does not activate, try relaunching the Distance activity again on the second laptop from the Neighborhood view.
es: Si el botón "Comenzar Medición de la distancia" no se activa, trate de relanzar la actividad Distancia de nuevo en el segundo portátil desde el Vecindario.

source: Atmospheric conditions can impact the accuracy of the measurement; you can override the default settings by using the Atmosphere toolbar.
es: Las condiciones atmosféricas pueden afectar la exactitud de la medición; puede reemplazar la configuración predeterminada mediante la barra de herramientas Ambiente.

source: The units of measure can be changed by choosing a unit from the combo box (meters, centimeters, inches, feet, yards, or custom units) on the Customize toolbar. If you chose "custom units", the current distance between the two laptops will be used as a metric. For example, you could measure the height of a student, Pedro, and then select that distance to define a new unit of measure, the "Pedro".
es: Las unidades de medida pueden ser cambiadas por la elección de una unidad en el cuadro combinado (metros, centímetros, pulgadas, pies, yardas, o unidades personalizadas) en la barra de herramientas Personalizar. Si eliges "unidades personalizadas", la distancia actual entre las dos computadoras portátiles se utilizará como unidad. Por ejemplo, se podría medir la altura de un estudiante, Pedro y, a continuación, seleccione esa distancia para definir una nueva unidad de medida, el "Pedro".

source: The Copy button found on the Edit toolbar can be used to copy measurements to the toolbar.
es: El botón Copiar que se encuentra en la barra de herramientas de edición se puede utilizar para copiar las mediciones.

source: The Paste button found on the Edit toolbar can be used to paste a new measurement unit into the activity. The scale of the measurement units should be specified in terms of meters, e.g., 39.37 for specifying inches.
es: El botón Pegar que se encuentra en la barra de herramientas de edición se puede utilizar para pegar una nueva unidad de medida en la actividad. La escala de las unidades de medida debe especificarse en términos de metros, ej. 39.37 para que especifican pulgadas.

source: Reporting problems
es: Informe de problemas

source: `File Bug Report <https://bugs.sugarlabs.org/newticket?component=Distance>`_
es: `Archivo Bug Report <https://bugs.sugarlabs.org/newticket?component=Distance>`_

source: Credits
es: Créditos

source: Distance was written by Benjamin Schwartz. It is maintained by Rafael Ortiz and Walter Bender
es: Distancia fue escrito por Benjamin Schwartz. Es mantenido por Rafael Ortiz y Walter Bender

source: References
es: Referencias

source: `Wiki Page <http://wiki.sugarlabs.org/go/Activities/Distance>`_
es: `Página Wiki <http://wiki.sugarlabs.org/go/Activities/Distance>`_
