Repository: tony37/sledhelp
Catalog: translated_po/*/finance.po
Languages: es

source: Finance
es: Finanzas

source: About
es: Acerca de

source: Finance is a simple financial planning activity. It can be integrated into classroom assignments, or else used to track finances for a school club. It might also be useful for students who wish to help their parents with home finances.
es: Finanzas es una actividad sencilla de planificación financiera. Se puede integrar en las tareas de clase, o utilizarlo para rastrear las finanzas de un club de la escuela. También podría ser útil para los estudiantes que desean ayudar a sus padres con las finanzas del hogar.

source: The register view allows students to enter income and expenses, assign categories, and review past transactions. The chart view shows students a visual breakdown of their expenses by category. The budget view allows users to assign a monthly budget to each category, and to see how each month's expenses compare to the budget.
es: La vista de registro permite a los estudiantes entrar los ingresos y gastos, asignar categorías, y revisar las transacciones pasadas. La vista gráfica muestra a los estudiantes un desglose visual de sus gastos por categoría. La vista presupuesto permite a los usuarios asignar un presupuesto mensual para cada categoría, y ver los gastos de cada mes en comparación con el presupuesto.

source: Finance is designed to be extensively localized. The user interface is translatable, and local conventions are used to display monetary values.
es: Finanzas está diseñado para ser localizada ampliamente. La interfaz de usuario es traducible, y las convenciones locales se utilizan para los valores monetarios.

source: Git It!
es: Git él!

source: Gallery
es: Galería

source: References
es: Referencias

source: `Sugar Wiki Activity Page <http://activities.sugarlabs.org/sugar/addon/4040>`_
es: `Página de la Actividad <http://activities.sugarlabs.org/sugar/addon/4040>`_

source: `Source <https://github.com/godiard/finance-activity>`_
es: `Fuentes <https://github.com/godiard/finance-activity>`_
