Repository: tony37/sledhelp
Catalog: translated_po/*/fototoon.po
Languages: es

source: About
es: Acerca de

source: The FotoToon Activity will allow you to create everything from a simple "comic" strip to a long elaborate illustrated document. You will be able to import many kinds of images into the panes of your project and add text bubbles to help tell the story. You can use photo images taken with the XO or imported from a camera, drawings made with Activities such as Paint, and images of all kinds downloaded from the web. This could include photos, charts and graphs, maps, and the like.
es: El actividad FotoToon te permitirá crear de todo, desde una simple tira de "comic" a un documento ilustrado largo y elaborado. Serás capaz de importar muchos tipos de imágenes en los cuadros de tu proyecto y añadir burbujas de texto para ayudar a contar la historia. Puedes utilizar las imágenes de fotos tomadas con la XO o importada de una cámara, dibujos hechos con actividades como Pintar, e imágenes de todo tipo descargados de la web. Esto podría incluir fotos, cuadros y gráficos, mapas, etc..

source: This introduction to FotoToon will show you how to get started with a simple 4 panel project.
es: Esta introducción a FotoToon te mostrará cómo empezar con un simple proyecto de 4 cudros.

source: FotoToon, like many other Sugar Activities, is often updated to fix "bugs" that users report. There was one update, from version 15 to version 16 during the time this instruction chapter was written. By the time you use it, there may be others. The changes are usually minor and should not interfere with the usefulness of this information. Always try to be sure you are using the latest version.
es: FotoToon, como muchas otras actividades de Sugar, a menudo se ha actualizado para corregir "errores" que reportan los usuarios. Hubo una actualización, desde la versión 15 a la versión 16 durante el tiempo en que este capítulo instructivo fue escrito. En el momento en que lo utilices, puede haber otras. Los cambios son generalmente de menor importancia y no deben interferir con la utilidad de esta información. Siempre trata de asegurarte de que estás utilizando la última versión.

source: Using FotoToon
es: Utilizando FotoToon

source: The Main FotoToon Toolbar
es: El barra de herramientas principal de FotoToon

source: The FotoToon Toolbar has 9 icons including 3 with pulldown menus. The main FotoToon toolbar allows you to access many features of the Activity. Here is a description of what each of the icons will allow you to do:
es: La barra de herramientas FotoToon tiene 9 iconos, 3 los cuales tienen menúes desplegables. La barra de herramientas principal FotoToon te permite acceder a muchas características de la Actividad. He aquí una descripción de lo que cada uno de los iconos te permitirá hacer:

source: The FotoToon icon. When you hover your cursor over this icon you will open a small pulldown that allows you to export your work as an image or a book (pdf file). See below for more details.
es: El icono FotoToon. Al pasar el cursor sobre este icono se abrirá un pequeño menú desplegable que te permite exportar su trabajo como una imagen o un libro (archivo pdf). Ve a continuación para obtener más detalles.

source: This icon allows you to view the content in full screen or presentation mode.
es: Este icono te permite ver el contenido en pantalla completa o en modo de presentación.

source: The **Add Photo** icon. This icon allows you to add an image to your project. It can be a photo you take with the XO or digital camera, or import from the web. It can also be a picture, page, or project you create in another Sugar Activity.
es: El icono **Añadir foto**. Este icono te permite añadir una imagen a tu proyecto. Puede ser una foto que tomes con la XO o una cámara digital, o importada de la web. También puede ser una imagen, página o proyecto que crees en otra actividad Sugar.

source: The **Add a globe** icon. This allows you to add a globe. It is used to tell what the characters of your image is speaking. This also include some other icons such as whispher and think.
es: El icono **Añadir un globo** . Esto te permite añadir un globo. Se utiliza para escribir lo que los personajes de tu imagen están diciendo. Esto también incluye algunos otros iconos como susurro y pensamiento.

source: The **Choose a movement line** icon. This can be used to insert some other icons such as highlight and idea to the image.
es: El icono **Elije una línea de movimiento** . Esto se puede utilizar para insertar algunos otros iconos como resaltar e idea a la imagen.

source: The **Rotate** icon. This allows you to rotate the selected object in the clockwise direction in 90 degrees for each click.
es: El icono **Girar**. Esto te permite rotar el objeto seleccionado hacia la derecha 90 grados por cada clic.

source: The **Delete** icon. This allows you to delete the selected object.
es: El icono **Eliminar**. Esto te permite eliminar el objeto seleccionado.

source: This icon allows you to change the text properties of what you have typed. See below for more details.
es: Este icono te permite cambiar las propiedades del texto que has escrito. Ve a continuación para obtener más detalles.

source: The familiar stop-sign icon is one way to stop the FotoToon Activity. You can also use the keyboard shortcut: ctrl-Q.
es: El icono de señal de Parar es la manera de detener la actividad FotoToon. También puedes utilizar el atajo de teclado: Ctrl-Q.

source: **Title:** box allows you to give a name to your project. Click on it and replace the content with the name you wish for your work.
es: **Título:** cuadro te permite dar un nombre a tu proyecto. Haz clic en él y reemplaza el contenido con el nombre que desees para tu trabajo.

source: The Export Pulldown
es: El barra de Exportación

source: 1a- This little panel allows you to name your project before you export it as an image. If you do nothing, it will appear in the Journal as, "FotoToon as image." If you give it a name, such as "My Project-1" before exporting it will appear in the Journal as "My Project-1 as image". This will make it easier to find later in the Journal. Just erase the FotoToon label and replace it with the title you want to use. If you forget to name it when saving, you can always go to the Journal and select and rename it.
es: 1a- Este pequeño panel te permite nombrar tu proyecto antes de exportarlo como imagen. Si no haces nada, aparecerá en el Diario como "FotoToon como imagen. "Si le das un nombre, como" Mi Proyecto-1 "antes de exportarlo aparecerá en el Diario como" Mi Proyecto-1 como una imagen ". Esto hará que sea más fácil encontrarlo más adelante en el Diario. Simplemente borrar la etiqueta FotoToon y reemplazarlo con el título que deseas utilizar. Si te olvidas de darle un nombre al guardar, siempre se puede ir al Diario y seleccionarlo y cambiar su nombre.

source: 1b- This allows you to add a description to the journal entry.
es: 1b- Esto te permite añadirle una descripción a la entrada de diario.

source: 1c- This greyed out icon for home view is currently inactive.
es: 1c- Este icono en gris para vista de inicio está actualmente inactivo.

source: 1d- Click on this icon to export your project as an image. The export will just show your project. The tool bars and other things on the screen will not be included. If you wish a screen shot of the entire screen, you can make one by using the usual alt-1 (press the alt key and the 1 key at the same time).
es: 1d Haz clic en este icono para exportar el proyecto como una imagen. La exportación sólo mostrará tu proyecto. Las barras de herramientas y otras cosas en la pantalla no se incluirán. Si deseas una captura de pantalla de toda la pantalla, puedes hacer uno usando el habitual alt-1 (pulsa la tecla Alt y la tecla 1 al mismo tiempo).

source: 1e- Click this icon to export your project as an book. The export will just show your project. The tool bars and other things on the screen will not be included. The book will be saved in PDF format. It can be viewed from Read Activity.
es: 1e Haz clic en este icono para exportar el proyecto como un libro. La exportación sólo mostrará tu proyecto. Las barras de herramientas y otras cosas en la pantalla no se incluirán. El libro se guarda en formato PDF. Se puede ver con la actividad Leer.

source: The View Pulldown
es: La barra de vista

source: 2a- Click this to view your project in slideshow mode. It will allow you to view your project slide by slide. In the slideshow, click on the arrows by the sides to navigate forward and backword in your slides. Click on the **slidshow** icon again to return to edit mode.
es: 2a- Haz clic aquí para ver el proyecto en modo de presentación. Se te permitirá ver tu proyecto cuadro por cuadro. En la presentación, haz clic en las flechas de los laterales para navegar hacia adelante y atras en las cuadros. Haga clic en el icono ** ** Slidshow de nuevo para volver al modo de edición.

source: 2b - Click this to work in full screen. This will hide the toolbar and thus you will have more space for your design. Once you are in the full screen mode, the same icon will appear on the top right corner of the window. Click that icon to return to the normal edit mode.
es: 2b - Haz clic en este icono para trabajar en pantalla completa. Esto ocultará la barra de herramientas y por lo tanto tendrás más espacio para el diseño. Una vez que estes en el modo de pantalla completa, el mismo icono aparecerá en la esquina superior derecha de la ventana. Haz clic en ese icono para volver al modo de edición normal.

source: Add a globe menu
es: Menu añadir un globo

source: 3a- You can use this to present an expression of exclamation.
es: 3a- Puedes usar esto para agregar una expresión de admiración.

source: 3b- You can use this when some one (a character) in your projects whispers someting to another.
es: 3b-Puedes usar esto cuando alguien (un personaje) en tus proyectos susurra a otro.

source: 3c- You can use this to express what the characters of your projects are speaking.
es: 3c- Puedes usar esto para expresar lo que los personajes de tus proyectos están diciendo.

source: 3d- You can use this to add a box to your project.
es: 3d- Puedes usar esto para añadir un cuadro de texto a tu proyecto.

source: 3e- You can use this to express that some character in your project are thinking.
es: 3e- Puedes usar esto para expresar lo que algún personaje en tu proyecto están pensando.

source: Choose a movement line menu
es: Menú de selección líneas de movimiento

source: 4a- You can use this to add a highlight to your project.
es: 4a- Puedes usar esto para resaltar algo en tu proyecto.

source: 4b- You can use this to add straight lines to your project.
es: 4b- Puede usar esto para añadir líneas de movimiento rectas a tu proyecto.

source: 4c- You can use this to add an idea to your project.
es: 4c- Puede usar esto para añadir un icono de una idea a tu proyecto.

source: 4d- You can use this to add curves to your project.
es: 4D- Puedes usar esto para añadir lineas de movimiento curvas a tu proyecto.

source: The Text Pulldown
es: Barra de herramientas de Texto

source: The Text Pulldown menu allows you to control the appearance of the text you add to your project. Generally, they apply to everything in the box or bubble you are currently working on. You do not have to highlight the text to change it.
es: La barra de herramientas de texto te permite controlar el aspecto del texto que se agrega a tu proyecto. En general, se aplican a todo en la caja o a la burbuja en la que está trabajando actualmente. No tienes que resaltar el texto para cambiarlo.

source: 8a- Selecting this icon will change the text you are working on to Bold. Clicking it again reverts back to regular text,
es: 8a- La selección de este icono cambiará el texto en que se está trabajando a Negrita. Al hacer clic de nuevo vuelve al texto normal,

source: 8b- Selecting this icon will change the text your are working on to Italics.
es: 8b- La selección de este icono cambiará el texto en el que se esté trabajando a cursiva.

source: Note: clicking on both of these icons, in any order, will give you Bold Italic text. Clicking both again, in any order, will get you back to regular text.
es: Nota: al hacer clic en estos dos iconos, en cualquier orden, seleccionará negrita y cursiva. Al hacer clic otra vez, en cualquier orden, te llevará de nuevo a texto normal.

source: 8c- Clicking on this icon will open the Text Color Palette. See below for information on how to use it.
es: 8c- Al hacer clic en este icono se abrirá la selección de Paleta de colores. Véase más abajo para obtener información sobre cómo usarla.

source: 8d- Clicking this will reduce the size of the text. The current size will be displayed just next to this icon.
es: 8d- hacer clic en este reducirá el tamaño del texto. El tamaño actual se mostrará justo al lado de este icono.

source: 8e - Clicking this will increase the size of the text. The current size will be displayed just before the icon.
es: 8e - Al hacer clic en esta aumentará el tamaño del texto. El tamaño actual se mostrará justo antes del icono.

source: 8f- This pull down offers a choice of different fonts, listed in alphabetical order. Some, such as "Ding Bats" don't actually produce anything. Be sure to test the font on your text to see if it looks the way you would like it to.
es: 8f- Este desplegable ofrece una selección de diferentes fuentes, por orden alfabético. Algunos, como "Ding Bats" no producen nada en realidad. Asegúrese de probar la fuente en el texto para ver si se ve la forma en que le gustaría.

source: The Color Palette Pulldown
es: La paleta de colores desplegable

source: The Color Palette Pulldown allows you to choose the color of your font. It will apply to everything in the box or bubble but can vary from one box or bubble to the next as you choose. There are 12 preset colors you can use, or you can create a custom color by selecting one of the preset colors and dragging the sliders to give more or less Red, Green, or Blue in the selected color. The little circle at the top of the Color Palette shows the current color. When you are satisfied with the color you have selected/modified, click on the little circle to accept the chosen color and close the Color Palette. It may take a few seconds for the new color to appear in the text box. But, don't worry, it will!
es: La paleta de colores desplegable te permite elegir el color de la fuente. Se aplicará a todo en la caja o una burbuja, pero puede variar de una caja o de burbujas a la siguiente que tu elijas. Hay 12 colores predefinidos que se pueden utilizar, o puedes crear un color personalizado mediante la selección de uno de los colores predefinidos y arrastrando los deslizadores para dar más o menos rojo, verde o azul en el color seleccionado. El pequeño círculo en la parte superior de la paleta de colores muestra el color actual. Cuando estés satisfecho con el color que has seleccionado / modificado, haz clic en el pequeño círculo para aceptar el color elegido y cerrar la paleta de colores. Puede tomar unos segundos para que el nuevo color que aparezca en el cuadro de texto. Pero, no te preocupes, lo hará!

source: Learning with FotoToon
es: Aprender con FotoToon

source: Plan Ahead
es: Planifica con anticipación

source: FotoToon can be used for a wide variety of learning activities, but the general process is always similar. For the sample project in this section, we will make a 4 panel page using 4 photos. This is a good way to get started since the page can be printed on a single page.
es: FotoToon se puede utilizar para una amplia variedad de actividades de aprendizaje, pero el proceso general es siempre similar. Para el proyecto de ejemplo de esta sección, vamos a hacer una página de 4 cuadros con 4 fotos. Esta es una buena manera de empezar ya que se puede imprimir en una sola página.

source: Here are the general steps you need to complete before you build your first FotoToon project:
es: Estos son los pasos generales que debes completar antes de construir tu primer proyecto FotoToon:

source: **Step One: Decide what your project will be about.** You can tell a story about anything. For example, it could be about your pets, your home, your family, your town, or, even some photos you took at a party. Any topic is fine for our first project. The sample project will be about "Healthy Snacks" and the photos will be pictures of food.
es: **Primer paso: Decide acerca de que tratará tu proyecto.** Se puede contar una historia acerca de cualquier cosa. Por ejemplo, podría ser acerca de tus mascotas, tu hogar, tu familia, tu ciudad, o, incluso acerca de fotos que has tomado en una fiesta. Cualquier tema está muy bien para nuestro primer proyecto. El proyecto de ejemplo será sobre "Desayunos saludables" y las fotos serán imágenes de alimentos.

source: **Step Two: Make a plan.** Before you begin you should make a plan that will guide you through the construction of your project. Some people like to draw a little sketch of each pane showing what will be in the picture and a suggestion for what words will be added. If you like the panes can each be on a separate small piece of paper so you can re-arrange them easily This is called a **Story Board**. You may have another way you would like to make your plan, just be sure to include information about what pictures you will use, where you will get them, and what text you plan to add.
es: **Paso dos: Haz un plan.** Antes de comenzar, deberás hacer un plan que te guiará a través de la construcción de tu proyecto. A algunas personas les gusta dibujar un pequeño bosquejo de cada panel que muestra lo que va a salir en la foto y una sugerencia acerca de las palabras que añadiran. Si te gusta los cuadros pueden ser cada uno en un pequeño trozo de papel por separado para que puedas volver a organizarlos fácilmente, esto se le llama **Story Board**. Puedes tener otra forma que te guste para hacer tu plan, sólo asegúrate de incluir información sobre las imágenes que vas a utilizar, donde las obtendrás, y que texto vas a agregar.

source: **Step Three: Gather your images.** For starters, we will use images that were taken either with a camera, or using the **Record Activity** on the XO. Any image that can be imported to the Journal on your XO and viewed in **Image Viewer** can be used. It is a good idea to rename each of the photos you will be using in the Journal. The name can include the number of the pane you plan to use it in so it is easy to find when you begin putting things together.
es: **Paso tres: Reúne a tus imágenes.** Para empezar, vamos a utilizar las imágenes que se tomaron ya sea con una cámara, o utilizando la acttividad **Grabar** en la XO. Cualquier imagen que se puede importar del Diario de tu XO y ver en **Visor de Imágenes** se puede utilizar. Es una buena idea cambiar el nombre de cada una de las fotos que se van a utilizar en el Diario. El nombre puede incluir el número del panel en el que tienes previsto utilizarla para que sean más fácil de encontrar cuando se empiecen a poner las cosas juntas.

source: Place Your Images
es: Agrega tus Imágenes

source: Open the Journal and check to be sure your images are there and can be viewed in the Image Viewer (click on the file to open it and check). Be sure the images have names that include the number of the pane you plan to place them (1,2,3, or 4).
es: Abre el Diario y comprueba que tus imágenes están ahí y se pueden ver en el visor de imágenes (haz clic en el archivo para abrirlo y comprobar). Asegúrate de que las imágenes tienen nombres que incluyen el número del cuadro en el que vas a colocarlos (1,2,3 o 4).

source: Open FotoToon and find the "Add Photo" icon (number 3 in the FotoToon main toolbar shown above). A list of available images will appear. Click on the one you want to put in the first pane. When it has loaded, you can either leave it or remove it with the minus sign icon (number 7 in the main toolbar shown above). Warning: You can only remove the last image entered. That is why it is important to number the images according to the panes you wish to place them in. After the first image has been placed, continue adding images until all four for your first project have been placed. If you decide later that you want to change their order after they have been placed, you will need to delete them and replace them in the new order. It is best to get your final placement before adding any text.
es: Abre FotoToon y encuentra el icono "Añadir foto" (número 3 en la barra de herramientas principal de FotoToon como se muestra arriba). Aparecerá una lista de imágenes disponibles. Haz clic en la que quieras poner en el primer panel. Cuando se haya cargado, puedes dejarla o quitarla con el icono de signo menos (número 7 en la barra de herramientas principal que se muestra arriba). Advertencia: Sólo puede eliminar la última imagen agregada. Por eso es importante contar las imágenes de acuerdo con los paneles en que desea colocarlas). Después de la primera imagen se ha colocado, continúa agregando imágenes hasta que las cuatro para tu primer proyecto se han colocado. Si más adelante decides que deseas cambiar su orden después de que hayan sido colocadas, tendrás que eliminarlas y sustituirlas en el nuevo orden. Lo mejor es definir su ubicación final antes de añadir cualquier texto.

source: If you would like to use the same images that will be used in this sample project, you will find them at these links. Go to each link, upload the photo to a usb drive, plug it into your XO, and open by clicking on the image names. They will open in the Image Viewer and be automatically saved so you can access them for your project.
es: Si deseas utilizar las mismas imágenes que se utilizaron en este proyecto de ejemplo, las encontrará en estos enlaces. Ve a cada enlace, descarga la foto a una unidad USB, conéctalo a tu XO, y abrelas haciendo clic en los nombres de las imágenes. Se abrirá en el Visor de imágenes y se guarda automáticamente para que puedas acceder a ellos para tu proyecto.

source: Pane-1 http://wiki.laptop.org/go/File:1-Apple-Fries.png
es: Cuadro-1 http://wiki.laptop.org/go/File:1-Apple-Fries.png

source: Pane-2 http://wiki.laptop.org/go/File:2-Soda-Milk.png
es: Cuadro-2 http://wiki.laptop.org/go/File:2-Soda-Milk.png

source: Pane-3 http://wiki.laptop.org/go/File:3-Cookies-Yogurt.png
es: Cuadro-3 http://wiki.laptop.org/go/File:3-Cookies-Yogurt.png

source: Pane-4 http://wiki.laptop.org/go/File:4-HealthySnacks.png
es: Cuadro-4 http://wiki.laptop.org/go/File:4-HealthySnacks.png

source: Add Dialog and Titles
es: Añadir Diálogos y Títulos

source: If you have planned well with your storyboard, you will have a pretty good idea of what you want to put in your dialog balloons and text boxes. You may even have a title in mind for your project. You can actually start this process anywhere in your project. All of the balloons and boxes you will be using to do this will be identified in the first image above, the The Main PhotoToonToolbar.
es: Si has planeado bien con tu storyboard, tendrás una idea bastante buena de lo que se quiere poner en los globos de diálogo y cuadros de texto. Puede incluso tener un título en mente para tu proyecto. En realidad se puede iniciar este proceso en cualquier parte de tu proyecto. Todos los globos y cajas que vas a utilizar para hacer esto se identificarán en la primera imagen de arriba, el la barra principal de FotoToon.
