Repository: tony37/sledhelp
Catalog: translated_po/*/fototoon.po
Languages: es

source: Making and placing your Title: If you know what you would like your title to be, you can start with that. It can always be changed later. When you start a project in FotoToon there will already be a tiny box for the title in a narrow band across the top of the project window. You can drag the upper left corner of the box to enlarge it (look for the cursor arrow to change to a thinner double headed arrow). You can also move it around in the band across the top. Click on the box and type all or part of your title. Then you can change the type style and size using the pull downs in the Text Pulldown menu (see 8d and 8e) in the picture above). Experiment until you find a style and size you like. You can also change the color of the type. Don't worry if it isn't perfect, you can always come back later and change it. Notice that you can erase part of the text by backspacing over it.
es: Realización y colocación del título: Si sabes cual te gustaría que sea el título, puedes empezar con eso. Siempre se puede cambiar más tarde. Al iniciar un proyecto en FotoToon ya habrá una pequeña caja para el título en una banda estrecha en la parte superior de la ventana del proyecto. Puedes arrastrar la esquina superior izquierda del cuadro para ampliarla (busca la flecha del cursor para cambiar a una doble flecha delgada). También puedes mover alrededor de la banda en la parte superior. Haz clic en la casilla y escribe todo o parte del título. A continuación, puedes cambiar el estilo de la letra y el tamaño utilizando los menús desplegables en el menú desplegable de texto (ver 8d y 8e en la imagen de arriba). Experimenta hasta encontrar un estilo que te guste. También puedes cambiar el color del texto. No te preocupe si no es perfecto, siempre se puede volver más tarde y cambiarlo. Observa que puedes borrar parte del texto sobrescribiéndolo.

source: In this image you can see that we selected bold, a red color from the color palette, a type size of 26, and the Font "Monospace".
es: En esta imagen se puede ver que hemos seleccionado negrita, de color rojo de la paleta de colores, un tamaño de letra de 26, y tipografía "Monospace".

source: Adding Text Balloons: You can place the text balloons wherever you like within a pane. Click on the pane, then on the balloon you want to use (see "Add a global menu" and "Choose a movement line menu" above for explanations). The balloon will appear in the pane. You can drag it to the position where you want it, and also can drag the little tail to point to the source of the dialog. Add the words to the balloon in the same way you added them to the Title box.
es: Agregar globos de texto: Puedes colocar los globos de texto donde quieras dentro de un panel. Haz clic en el panel, y luego en el globo que deseas utilizar (consulta "Menu añadir un globo" y "Menu elije línea de movimiento" para obtener explicaciones). El globo aparecerá en el panel. Puedes arrastrarlo a la posición que desees, y también puedes arrastrar la colita para apuntor a la fuente del cuadro de diálogo. Añade las palabras para el globo de la misma manera que las agregaste al cuadro Título.

source: In this image you can see that we have added 4 dialog balloons (#4 in the main toolbar). We could also have used the "think" balloon, or the "whisper" balloon. The first pane is OK, but the first balloon in the second pane needs to be dragged to a better shape and size. The second balloon in the second pane appears just as it does when it is first added. It still needs to have text added and to be resized (by dragging a corner). You can see that our type size is 10, text color is black, and we are still using the "Monospace" font.
es: En esta imagen se puede ver que hemos agregado 4 globos de diálogo (#4 en la barra de herramientas principal). También podríamos haber utilizado el globo "pensar" o el globo "susurro". El primer panel está bien, pero el primer balón en el segundo panel tiene que ser arrastrado a una mejor forma y tamaño. El segundo globo en el segundo panel aparece justo como lo hace cuando se añade. Todavía hay que añadir testo y cambiar el tamaño (arrastrando una esquina). Se puede ver que nuestro tamaño de letra es de 10, color del texto es negro, y todavía está utilizando el tipo de letra "Monospace".

source: As you work with the various text items, you may wish to eliminate one entirely. Just click on it, then on the icon with the minus (-) sign (#7 in the main toolbar), and it will disappear.
es: A medida que trabajes con los distintos elementos de texto, es posible que desees eliminar uno enteramente. Simplemente haga clic en él, a continuación, en el icono con el signo menos (-) signo (# 7 en la barra de herramientas principal), y desaparecerá.

source: Adding Exclamation Balloons: You may wish to include special exclamations to your project. Choose the exclamation balloon (choose from # 4 in the main toolbar). It is possible to eliminate the one longer point on the balloon by dragging it so that it matched the others. Again, type into the balloon just as you did in the title box and dialog balloons.
es: Adición de globos exclamación: Es posible que desees incluir exclamaciones especiales para tu proyecto. Elije el globo de exclamación (#4 en la barra de herramientas principal). Es posible eliminar la punta más larga en el globo arrastrando de modo de que coincida con los demás. Una vez más, se teclea en el globo, tal como hizo en el cuadro de título y globos de diálogo.

source: Adding extra Text Boxes: You can add a text box anywhere in any pane by clicking on the pane and then on the box icon in the diagram (choose from #4 in the main toolbar).
es: Cómo añadir cuadros de texto adicionales: Puedes agregar un cuadro de texto en cualquier lugar en cualquier panel haciendo clic en el panel y después en el icono de la caja en el diagrama (#4 en la barra de herramientas principal).

source: In this example you can see we have added 4 exclamation balloons and one extra text box. We used the same text size, font, and color as in the rest of the project. You could choose to use different ones in your project.
es: En este ejemplo se puede ver que hemos añadido 4 globos de exclamación y un cuadro de texto adicional. Se utilizó el mismo tamaño del texto, la fuente, y el color como en el resto del proyecto. Puedes optar por utilizar otros diferentes en tu proyecto.

source: Exporting Your Project
es: Exportación de su proyecto

source: Now, if you have followed the instructions above, you should have a small, completed FotoToon Project. You may have decided to use the same photos that are in the sample, or you may have chosen to use images you have imported. These can be from your camera, your XO, downloads from the web, projects you have made in other Activities, drawings you made in Paint, or even photos you have modified in Paint (import, then add things and/or crop as you like). When finished, your project will look something like this:
es: Ahora, si tu has seguido las instrucciones anteriores, debes tener un proyecto pequeño, completo en FotoToon. Es posible que hayas decidido utilizar las mismas fotos que se encuentran en la muestra, o puedes haber optado por utilizar las imágenes que has importado. Estos pueden ser de tu cámara, tu XO, descargas desde la web, los proyectos que has hecho en otras actividades, dibujos que has hecho en Pintar, o incluso fotos que se han modificado en Pintar (importando, y a continuación, añadir cosas y / o cortandolas como quieras). Cuando hayas terminado, su proyecto se verá algo como esto:

source: Regardless of what you have made for your project, you will probably want to share it with others. You can do this as an email attachment or print it out as a paper copy. To do this, you need to export your project as an image stored in your Journal. The instructions for exporting your project are shown above. We will repeat them here as well.
es: Independientemente de lo que tu haz hecho para tu proyecto, es probable que desees compartirlo con los demás. Puede hacer esto como un archivo adjunto de correo electrónico o imprimirlo como una copia en papel. Para ello, es necesario exportar el proyecto como una imagen almacenada en el Diario. Las instrucciones para exportar el proyecto se muestran arriba. Vamos a repetir aquí también.

source: 1b- This allows you to add a description to jounal entry.
es: 1b- Esto te permite añadir una descripción a la entrada jounal.

source: Look in the Journal. Your project should appear there with the name you gave it before exporting. If you forgot to give it a name, it will just say "FotoToon." If this happened, rename it now, in the Journal before you forget to do it.
es: Busca en el Diario. Tu proyecto debe aparecer allí con el nombre que le diste antes de exportar. Si se te olvidó de darle un nombre, dirá "FotoToon. "Si esto sucediera, cambiale el nombre ahora, en el Diario antes se olvida de hacerlo.

source: Extending FotoToon
es: Extendiendo FotoToon

source: FotoToon can be used for much more than the simple 4-pane example we built in the instructions. It can be adapted for use in many different subject areas where students and teachers can construct lessons on any topic. Here are some possible ideas for projects:
es: FotoToon se puede utilizar para mucho más que la simple ejemplo 4-panel construimos en las instrucciones. Se puede adaptar para su uso en muchas áreas diferentes, donde los estudiantes y los profesores pueden construir lecciones sobre cualquier tema. Aquí están algunas ideas posibles para proyectos:

source: Student written comic books for language arts practice. Students can write their own little "graphic novels" and even print them and take home to share with friends and family.
es: Libros de historietas escritos por los estudiantes para la práctica de artes del lenguaje. Los estudiantes pueden escribir sus propios pequeñas "novelas gráficas" e incluso imprimirlos y llevarlos a casa para compartir con amigos y familiares.

source: Student produced magazine articles for any topic they and their teachers choose. A single page or two-page "spread" will make it like the ones you see in actual magazines. One or more panes on the page can be used just for text to extend the story. The text could be written in another program and imported as an image or put in a large text box that fills the pane. The advantage of doing it all in FotoToon is that it would be easier to edit and/or change the text there than if it is imported as an image. Some possible ideas for these articles could be:
es: Artículos producidos por estudiantes para revistas de cualquier tema que ellos y sus profesores elijan. Una sola página o dos páginas de extensión hará que sea como los que se ven en las revistas actuales. Uno o más ventanas de la página pueden ser utilizados sólo para el texto para extender la historia. El texto se puede escribir en otro programa y se importa como una imagen o puesto en un cuadro de texto de gran tamaño que llene el panel. La ventaja de hacerlo todo en FotoToon es que sería más fácil de editar y / o cambiar el texto allí que si se importa como una imagen. Algunas ideas posibles para estos artículos podrían ser:

source: Cooking favorite foods (with recipes)
es: Cocinar comidas favoritas (con recetas)

source: Family pets (pictures and stories)
es: Mascotas de la familia (imágenes e historias)

source: Our neighborhood (pictures and stories of places to see or problems that need to be solved)
es: Nuestro barrio (imágenes e historias de lugares para ver y problemas que necesitan ser resueltos)

source: Science articles with photos of plants, animals, rocks, etc. including descriptions and information
es: Artículos de divulgación científica con fotos de plantas, animales, rocas, etc.. incluyendo descripciones e información

source: Historical articles with photos of people or places imported from the web
es: Artículos históricos con fotos de personas o lugares importados de la web

source: "How To" articles on any topic the students or teacher choose
es: "Cómo hacer" artículos sobre cualquier tema que los estudiantes o maestros eligen

source: Modifying FotoToon
es: Modificando FotoToon

source: FotoToon is free open source software and, as such is available to be modified by the user as they wish as long as they give the original source proper credit. So, if you are a programmer and want to change something to suit your needs, you may do so. Just don't forget to give credit where credit is due.
es: FotoToon es software libre de código abierto y, como tal, está disponible para ser modificado por el usuario como lo desee, siempre y cuando le dan el crédito apropiado fuente original. Así pues, si eres un programador y quieres cambiar algo para satisfacer tus necesidades, puedes hacerlo. Eso sí, no olvides de dar crédito a quien crédito merece.

source: If you are not a programmer, you can suggest changes or modifications to the Activity to the original programmer at the same place where you would report problems. If it is something that will improve the Activity and not interfere with other parts of it, the programmers will be happy to consider including it in a future update.
es: Si no eres un programador, puedes sugerir cambios o modificaciones en la actividad al programador original en el mismo lugar donde le informará de problemas. Si se trata de algo que va a mejorar la actividad y no interferir con otras partes de la misma, los programadores estarán encantados de considerar la inclusión en una futura actualización.

source: Because there are always updates and improvements happening with this program, be sure to always check to be sure you have the latest version.
es: Porque siempre hay cambios y mejoras que ocurren con este programa, asegúrate de comprobar siempre para asegurarse de que dispones de la última versión.
