Repository: tony37/sledhelp
Catalog: translated_po/*/frame.po
Languages: es

source: The Frame
es: El Marco

source: The Frame is the black border around the screen that holds the View icons, Activity taskbar, clipboard, wireless connections, battery level, incoming invitations and notifications, buddies, and global information that is used across all views.
es: El marco es el borde negro alrededor de la pantalla que contiene los iconos de vista, la barra de Actividad, portapapeles, conexiones inalámbricas, nivel de batería, invitaciones y notificaciones, compañeros, y información global que se utiliza en todas las vistas.

source: Accessing the Frame
es: Acceso al Marco

source: You can access the frame from any view in 2 ways:
es: Puede acceder al marco desde cualquier vista de 2 maneras:

source: By using the Frame Key on the keyboard. On XO laptops the Frame key is the square icon on the upper right hand corner of your keyboard, on other laptops you can use the F6 key.
es: Mediante el uso de la tecla de marco en el teclado. En las laptops XO la tecla Marco es el icono cuadrado en la esquina superior derecha de tu teclado, en otras computadoras portátiles puedes utilizar la tecla F6.

source: By moving the cursor to the edges or corners of your screen. (There are several options you can configure in this area, please refer to the My Settings section for more details.)
es: Al mover el cursor a los bordes o esquinas de la pantalla. (Hay varias opciones que puede configurar en esta área, por favor lee la sección Mi configuración para obtener más detalles. )

source: In the XO-4, with touch screen, is possible show the frame sliding a finger, from the top of the screen, a few centimeters. The same gesture will hide the frame too.
es: En el XO-4, con pantalla táctil, es posible mostrar el marco deslizando un dedo, desde la parte superior de la pantalla, unos pocos centímetros. El mismo gesto, oculta el marco tambien.

source: Frame Elements
es: Elementos del marco

source: The Frame view:
es: Descripción del marco:

source: Zoom menu: The Zoom menu (icons matching the important keyboard shortcuts toward the keyboard top left) appears on the upper-left edge of the Frame. Use it to move between the four Sugar views: Neighborhood, Group, Home, and Activity.
es: Menú Zoom: El menú de zoom (iconos que coinciden con los atajos de teclado importantes hacia la parte superior izquierda del teclado) aparece en el borde superior izquierdo del marco. Lo utilizan para moverse entre las cuatro vistas del azúcar: Barrio, Grupo, Inicio, y Actividad.

source: Running Activity list: The sequence of currently started Activities appears on the top edge of the Frame in the order that they were started. The active Activity is highlighted. (The Journal always appears here first.) Here you can see open Activities, save, close or switch between them, and view their source code. Sometimes an unlabeled circle appears here which represents an additional full-screen session started by an Activity whose icon already appears in the top edge of the Frame or an Activity that is having trouble completely starting. Invitations to collaborative Activity sessions also show up on this portion of the Frame. They appear as icons in the color of the person who sent them. Hover and you can see who it is and join in.
es: Lista de Actividades en ejecución: La secuencia de actividades que actualmente estn iniciadas aparece en el borde superior del marco en el orden en que se iniciaron. La actividad activa está destacada. (El Diario siempre aparece aquí primero. ) Aquí puedes abrir, guardar, cerrar o cambiar entre actividades, y ver su código fuente. A veces, un círculo sin etiqueta aparece aquí lo que representa una sesión de pantalla completa adicional iniciado por una actividad cuyo icono aparece ya en el borde superior del marco o una actividad que está teniendo problemas ppata iniciar. Las invitaciones a sesiones de actividades de colaboración también aparecen en esta parte del marco. Ellas aparecen como iconos en el color de la persona que los envió. Posa el cursor del ratón sebre ellos y se puede ver de quién se trata y unirse.

source: Active buddy list: People you are currently collaborating with appear on the right edge of the Frame.
es: Lista de contactos activa: Personas con las que actualmente estés colaborando, aparecen en el borde derecho del Marco.

source: Clipboard: The left edge of the Frame serves as a clipboard. You can drag objects such as images and text to and from the clipboard, and from and to Activities. A hover menu also lets you remove them from the clipboard, open them in an Activity, or save (keep) them in your Journal.
es: Portapapeles: El borde izquierdo del marco actúa como portapapeles. Puedes arrastrar objetos como imágenes y texto desde y hacia el portapapeles, y desde y hacia actividades. Un menú activable también te deja eliminarlos desde el portapapeles, abrir en una actividad, o guardar (mantener) en tu Diario.

source: System status (from left to right): Switch for the two modes of the touchpad (XO-1 only), external storage devices (e.g. thumb and hard drives), network status, text-to-speech, speaker (volume), and battery appear on the lower edge of the Frame.
es: El estado del sistema (de izquierda a derecha): Interruptor para los dos modos de la pantalla táctil (XO-1 solamente), dispositivos de almacenamiento externo (e. g. dispositivos usb), estado de la red, conversión de texto a voz, altavoz (volumen), y la batería aparecen en el borde inferior del marco.
