Repository: tony37/sledhelp
Catalog: translated_po/*/getbooks.po
Languages: es

source: Get Books
es: Obtener Libros

source: About
es: Acerca de

source: Get Books can be used to download your favorite books on Sugar. It helps you download from different places (Internet Archive, Feedbooks, etc) all from one place.
es: Obtener libros pueden ser utilizado para descargar tus libros favoritos en Sugar. Ayuda que descargue de diferentes lugares (Internet Archive, Feedbooks, etc) todo desde un solo lugar.

source: Once you have found the book you want to read, you can select the format in which you would like to download it (PDF or EPUB). Click on "Get Book" to start the download. At the top of the screen, a progress bar will appear that shows you the download progress. Once your book is downloaded, you can open it in the Read activity.
es: Una vez que hayas encontrado el libro que deseas leer, se puede seleccionar el formato en el que desea descargar (PDF o EPUB). Haz clic en "Obtener libro" para iniciar la descarga. En la parte superior de la pantalla, una barra de progreso aparecerá que muestra el progreso de la descarga. Una vez que tu libro está descargado, puede abrirlos en la actividad Leer.

source: How to find books
es: ¿Cómo encontrar libros?

source: There are two ways in which you can find books:
es: Hay dos formas en las que se pueden encontrar libros:

source: Using search
es: Uso de la búsqueda

source: Enter the book title in the search bar
es: Introduce el título del libro en la barra de búsqueda

source: Select from where to search(Feedbooks or My books)
es: Selecciona de dónde buscar (Feedbooks o Mis libros)

source: Press Enter
es: Pulsa Intro

source: Using the catalogs
es: El uso de los catálogos

source: Under the catalogs, you can see different genres of books
es: Bajo los catálogos, se pueden ver diferentes géneros de libros

source: Select the genre of your choice
es: Selecciona el género de tu preferencia

source: You will get a list of books, with it's Title and Author
es: Recibirás una lista de libros, con su Título y Autor

source: Click on the book you want
es: Haz clic en el libro que deseas

source: Select the format and click "Get Book"
es: Selecciona el formato y haz clic en "Obtener libro"

source: How to change language
es: Cómo cambiar el idioma

source: To change the language, click on the (settings) |set_ico| icon and from the list you can select:
es: Para cambiar el idioma, haz clic en el ícono ajustes |set_ico| y selecciona de la lista:

source: Any language
es: Cualquier idioma

source: French
es: Francés

source: English
es: Inglés

source: German
es: Alemán

source: Spanish; Castilian
es: Español; Castellano

source: How to show/hide catalogs
es: Cómo mostrar / ocultar catálogos

source: To show/hide the catalogs, all you need to do is just press the (catalogs) |cat_ico| button
es: Para mostrar / ocultar los catálogos, todo lo que tiene que hacer es presionar el boton catálogos |cat_ico|

source: Gallery
es: Galería

source: Download
es: Descargar

source: `Activites Download page <http://activities.sugarlabs.org/en-US/sugar/addon/4304>`_
es: `Página de descarga <http://activities.sugarlabs.org/en-US/sugar/addon/4304>`_

source: More Info
es: Más Info

source: If you never developed a Sugar Activity, `must read <http://www.flossmanuals.net/make-your-own-sugar-activities/>`_.
es: Si nunca has desarrollado una actividad Sugar, `debe leer <http://www.flossmanuals.net/make-your-own-sugar-activities/>`_.

source: If you want help us fixing some bugs on activities, and learn a little about how activities work, you can see at this `list of pending tickets <http://dev.laptop.org/~gonzalo/bugs_index.html>`_
es: Si quieres ayudarnos a solucionar algunos errores en las actividades, y aprender un poco sobre cómo funcionan las actividades, puedes ver en este `lista de entradas pendientes <http://dev.laptop.org/~gonzalo/bugs_index.html>`_
