Repository: tony37/sledhelp
Catalog: translated_po/*/getting_connected.po
Languages: es

source: Getting Connected
es: Cómo conectarse

source: A primary goal of the Sugar learning platform is enabling students to learn and work together.
es: Un objetivo principal de la plataforma de aprendizaje de Sugar es permitir a los estudiantes a aprender y trabajar juntos.

source: In a wireless environment, an access point (AP) is a device that allows your computer to connect to an existing set of communicating devices. The access point usually has a direct connection to the internet, and can relay data between the wireless devices and the devices it can access.
es: En un entorno inalámbrico, un punto de acceso (AP) es un dispositivo que permite al ordenador conectarse a un conjunto existente de dispositivos que se comunican. El punto de acceso tiene generalmente una conexión directa a la Internet, y puede transmitir datos entre los dispositivos inalámbricos y los dispositivos que puede acceder.

source: Multiple ways to connect to others
es: Múltiples formas de conectarse con otros

source: wireless access point (WiFi hotspot);
es: punto de acceso inalámbrico (WiFi hotspot);

source: wired network—may require an external adapter;
es: conexión cableada (puede requerir un adaptdor externo);

source: OLPC “School Server” mesh network;
es: “Servidor escolar“ OLPC red de malla (mesh);

source: OLPC “simple” mesh network, which lets you collaborate directly with other Sugar users.
es: Red de malla OLPC “simple“, que permite colaborar directamente con otros usuarios Sugar.

source: Connecting through an access point
es: Conexión a través de un punto de acceso

source: You can connect from the Neighborhood View. You can see information about the connection on the Frame.
es: Puedes conectarte desde la Vista Vecindario. Se puede ver información sobre la conexión de el Marco.

source: **Step 1: Go to the Neighborhood View**
es: **Paso 1: Ve a la vista de Vecindario**

source: Go to the Neighborhood View to connect to an access point.
es: Ve a la vista de Vecindario para conectarte a un punto de acceso.

source: Tip: To access the Neighborhood View, click on the Neighborhood Icon on the Frame or by pressing the F1 key.
es: Sugerencia: Para acceder a la vista de Vecindario, haz clic en el icono Vecindario en el Marco o pulsa la tecla F1.

source: **Step 2: Choose an access point**
es: **Paso 2: Elije un punto de acceso**

source: Networks (access points) are represented by circles on the Neighborhood View. Hover over a circle to see more information about an access point. An access point is identified by the name (ESSID) it broadcasts. An OLPC laptop mesh-point—represented by a series of concentric circles—is identified by its channel number (1, 6, or 11). You can also search for an access point by name in the search bar at the top of the page.
es: Las Redes (puntos de acceso) están representados por círculos en la Vista Vecindario. Pasa el ratón sobre un círculo para ver más información acerca de un punto de acceso. Un punto de acceso es identificado por el nombre (ESSID) que transmite. También puedes buscar un punto de acceso por su nombre en la barra de búsqueda en la parte superior de la pantalla.

source: Note: If an access point is not broadcasting its name, the Neighborhood View may show that AP with some other name.
es: Nota: Si un punto de acceso no está transmitiendo su nombre, la Vista Vecindario puede mostrar ese AP con algún otro nombre.

source: Signal strength is indicated by the fill level of the circle. The color of the circle is based upon the name of the access point. A lock icon identifies networks that are secured and require a key (passcode) to use. A star icon identifies access points that have been previously used (favorites).
es: La intensidad de la señal se indica mediante el nivel de llenado del círculo. El color del círculo se basa en el nombre del punto de acceso. Un icono de candado identifica las redes que están protegidos y requieren una clave (contraseña) para utilizarlas. Un icono de la estrella identifica los puntos de acceso que se han utilizado anteriormente (favoritos).

source: **Step 3: Activate a connection**
es: **Paso 3: Activar una conexión**

source: To activate a network connection, click once inside the circle that corresponds to your chosen access point (or click on the Connect option in the hover menu).
es: Para activar una conexión de red, haz clic una vez en el interior del círculo que corresponde al punto de acceso elegido (o haz clic en la opción Conectar en el menú flotante).

source: While the connection is being established, the inside of the circle will blink. Once the connection is established, an icon for that connection will be shown on the bottom edge of Frame. If for some reason the connection failed, the circle will stop blinking. Sometimes it is necessary to try several times before the connection is established.
es: Mientras se establece la conexión, el interior del círculo parpadeará. Una vez establecida la conexión, un icono para esa conexión se mostrará en el borde inferior del marco. Si por alguna razón la conexión falla, el círculo dejará de parpadear. A veces es necesario probar varias veces antes de establecer la conexión.

source: If the access point is secured and requires a key, a dialog prompts you for the required information. Different access points may require different types of keys. Before entering the key, be sure to select the correct type from the pull-down menu that is presented.
es: Si el punto de acceso está asegurado y requiere una clave, un cuadro de diálogo te solicitará la información necesaria. Diferentes puntos de acceso pueden requerir diferentes tipos de claves. Antes de introducir la clave, asegúrate de seleccionar el tipo correcto en el menú desplegable que se presenta.

source: **Step 4: Checking the connection**
es: **Paso 4: Comprobación de la conexión**

source: The connection status is detailed in a hover menu.
es: El estado de la conexión se detalla en un menú flotante.

source: You can check the status of your connection from the Frame (from any view). By hovering over the circle icon, you will find details about your connection status in a hover menu. OLPC deployments
es: Puedes comprobar el estado de la conexión de el Marco (desde cualquier vista). Poniendo el ratón encima del icono del círculo, encontrarás detalles sobre tu estado de conexión en un menú activable.

source: OLPC has designed a mesh network that allows XO laptops to communicate without the presence of the Internet and a School Server as a means to make their school network connectivity more efficient. The School Server also provides web and chat services.
es: OLPC ha diseñado una red de malla que permite a las computadoras portátiles XO comunicarse sin la presencia de Internet y un servidor de la Escuela como un medio para hacer su conectividad de red escolar más eficiente. El servidor de la Escuela también ofrece servicios de web y chat.

source: Note to parents and teachers
es: Nota para los padres y maestros

source: Collaboration between learners is one of the most important features of Sugar. To enable collaboration in a classroom or home setting, it is necessary to establish the same type of connection for each computer. Computers can be connected through a School Server, a simple mesh if they are OLPC XOs, or an access point.
es: La colaboración entre los alumnos es una de las características más importantes de Sugar. Para permitir la colaboración en un salón de clases o en el hogar, es necesario establecer el mismo tipo de conexión para cada equipo. Las computadoras pueden ser conectados a través de un servidor escolar, una malla sencilla si son XO de OLPC, o un punto de acceso.

source: When using an access point for the connection, the computers must all use the same Jabber server in order to collaborate. Please refer to the Sugar Control Panel discussion in the Personalizing Sugar chapter for details regarding the configuration of Jabber.
es: Cuando se utiliza un punto de acceso para la conexión, los equipos deben utilizar el mismo servidor Jabber para colaborar. Por favor refiérase a la discusión del Panel de control de Sugar en el capítulo Personalizar Sugar para obtener más información sobre la configuración de Jabber.

source: Additional hints
es: Sugerencias adicionales

source: You make your connection from the Neighborhood View.
es: Tu creas tu conexión desde la Vista Vecindario.

source: Your current connection status is shown on the Frame. Also, the hover menu will indicate "Connected". It sometimes takes 2–3 tries to connect. To disconnect, select “Disconnect” from the hover menu that appears in either of the network status menus (See Step 4 above).
es: Tu estado de conexión actual se muestra en el Marco. Además, el menú activable indicará "Conectado". Algunas veces toma 2 o 3 intentos para conectar. Para desconectar, selecciona ”Desconectar” en el menú flotante que aparece en los menúes de estado de la red (ve paso 4 previamente)

source: Access points are represented by circles. The fill level indicates signal strength.
es: Los puntos de acceso están representados por círculos. El nivel de llenado indica la intensidad de señal.

source: Access points that require keys have a lock icon. The color of the circle is calculated from the ESSID of the access point. The name of the access point is displayed when you hover over it.
es: Los puntos de acceso que requieren claves tienen un icono de candado. El color del círculo se calcula desde el ESSID del punto de acceso. El nombre del punto de acceso se muestra cuando se pasa sobre el.

source: You connect by “clicking” in the center of the circle. The center of the circle will blink while the laptop is trying to connect.
es: El centro del círculo parpadeará mientras que el portátil está intentando conectarse.

source: If you are using an OLPC XO computer, mesh points are represented by a series of concentric circles. The color of a mesh point is the same as your XO color. If your OLPC XO computer is “mesh enabled” and you have not connected to an AP, you will automatically be joined to a simple mesh network, enabling you to collaborate with others in the mesh, but not necessarily to access the Internet.
es: Si estás utilizando una computadora de OLPC XO, puntos malla están representados por una serie de círculos concéntricos. El color de un punto de malla es igual que su color XO. Si tu XO tiene la malla habilitada y tu no estas conectado a un AP, te conectrás automaticamente a una red de malla simple, habilitandote a colaborar con otros en la red de malla, pero no necesariamente a acceder a Internet

source: You are prompted if the access point requires a key.
es: Se te pedirá si el punto de acceso requiere una clave.
