Repository: tony37/sledhelp
Catalog: translated_po/*/getting_support.po
Languages: es

source: Getting Support
es: Cómo obtener apoyo

source: One Laptop per Child is an education project, not a laptop project. With connected laptops, learners are liberated to actively engage with others with similar interests in cultures of learning by doing without being limited by time or space. If you are having hardware or software problems with your XO, remember that its design is to encourage you to learn new things by trying to solve problems on your own!
es: One Laptop per Child es un proyecto educativo, no un proyecto de portátiles. Con los ordenadores portátiles conectados, los estudiantes son liberados para participar activamente con otras personas con intereses similares en culturas de aprender haciendo, sin ser limitado por el tiempo o el espacio. Si estás teniendo problemas de hardware o de software con tu XO, recuerda que está diseñado es para animaros a aprender cosas nuevas, tratando de resolver los problemas por tu cuenta!

source: That said, an entire community built this XO and everything on it, and we want to help you with it. Our OLPC global community of volunteers provide software and hardware troubleshooting and support. This section will help tell you where to find Support when you are really stuck! OLPC has proven that volunteer-driven support works, often with far more heartfelt caring than any corporate help desk!
es: Dicho esto, toda una comunidad construyó este XO y todos en ella, queremos ayudarle con él. Nuestra comunidad global de voluntarios OLPC proporciona solución de problemas de software y hardware y soporte. Esta sección te ayudará a saber dónde encontrar apoyo cuando estás realmente atascado! OLPC ha demostrado que el apoyo implusado por voluntarios funciona, a menudo con cuidado mucho más sincero que cualquier escritorio de ayuda corporativo!

source: If you have questions about the XO, ask a teacher for help, a friend, or search on the Internet. If you have a question about your XO, there is a very good chance it is already answered within our expanding Support FAQ / RTFM knowledge base:
es: Si tienes preguntas acerca de la XO, pídele a un maestro en busca de ayuda, un amigo, o buscar en Internet. Si tienes alguna pregunta sobre tu XO, hay una muy buena probabilidad de que ya está contestada dentro de nuestra extensa base de conocimientos Soporte Preguntas frecuentes:

source: Next try looking at http://support.laptop.org extensive helpful guidance for exploring and fixing your XO, allowing you to solve challenging issues right alongside others. Specifically, check out:
es: A continuación intente buscar en http://support.laptop.org una amplia orientación útil para la exploración y la reparación de tu XO, lo que te permite resolver problemas difíciles junto a otros. En concreto, echa un vistazo a:

source: Getting Started: http://laptop.org/start
es: Primeros pasos: http://laptop.org/start

source: Email Lists: http://lists.laptop.org
es: Listas de correo electrónico: http://lists.laptop.org

source: Live Chat: http://forum.laptop.org/chat
es: Chat en vivo: http://forum.laptop.org/chat

source: OLPC Community: Wiki http://wiki.laptop.org
es: Wiki de la Comunidad OLPC: Wiki: http://wiki.laptop.org

source: If you are still unable to find an answer online, please email help@laptop.org.
es: Si todavía no puedes encontrar una respuesta en línea, por favor escribe a help@laptop.org.

source: Did you know that our volunteers staff a live Help Chat site 24/7, on the Internet? Click here: http://forum.laptop.org/chat Login with the color-name shown; that's guest ID. Type your question in the chat line at the bottom. You may have to wait for a response as our volunteers come in and out. If you are patient, we can probably help you! To learn more about what Internet Relay Chat (the system that makes this possible) is, click here: http://wiki.laptop.org/go/IRC
es: ¿Sabías que nuestros voluntarios proveeen Ayuda por Chat en linea 24/7, en Internet? Haz clic aquí: http://forum.laptop.org/chat Inicia la sesión de chat con el nombre del color mostrado; eso es el ID de invitado. Escribe tu pregunta en la línea de chat en la parte inferior. Puede que tengas que esperar una respuesta porque nuestros voluntarios entran y salen. Si eres paciente, es probable que puedes ayudar! Para aprender más sobre lo que Internet Relay Chat (el sistema que lo hace posible) hace, haz clic aquí: http://wiki.laptop.org/go/IRC

source: We would also like to make special mention of our Support Gang, where an enthusiastic group of volunteers assist XO users all over the world. If you are impressed with the passion and hard work of our volunteers, please consider giving back, by joining our dedicated community. Take a look at the link below. We would welcome your participation! http://wiki.laptop.org/go/Support_Gang http://wiki.laptop.org/go/Support_FAQ Be sure to review the Frequently Asked Questions (FAQ) link above. Many of us join and "learn by doing."
es: También nos gustaría hacer una mención especial de nuestra pandilla de soporte (Support Gang), donde un entusiasta grupo de voluntarios ayuda a los usuarios de XO en todo el mundo. Si estás impresionado con la pasión y el esfuerzo de nuestros voluntarios, por favor considera la posibilidad de devolver, formando parte de nuestra comunidad dedicada. Echa un vistazo a el siguiente enlace:. Te damos la bienvenida a tu participación! http://wiki.laptop.org/go/Support_Gang http://wiki.laptop.org/go/Support_FAQ Asegúrate de revisar las Preguntas Frecuentes (FAQ) . Muchos de nosotros nos unimos y "aprendemos haciendo. "

source: Thanks very much! OLPC Support Gang
es: Muchas gracias! OLPC Support Gang
