Repository: tony37/sledhelp
Catalog: translated_po/*/give_me_the_internet.po
Languages: es

source: Give Me the Internet
es: Conéctame a Internet

source: Give Me the Internet, Please
es: Déme la Internet, por favor

source: The designers of the XO laptop designed it for primarily wireless access, so it can work well in developing nations, where it is faster and less expensive to introduce wireless connections than wired ones.
es: Los diseñadores de la laptop XO las diseñaron principalmente para el acceso inalámbrico, por lo que puede funcionar bien en las naciones en desarrollo, donde es más rápido y menos costoso introducir conexiones inalámbricas que cableadas.

source: XOs are designed to connect to other XOs using a mesh network. A mesh network allows nearby XO laptops to talk to one another directly (wirelessly) without the need for a traditional Internet Service Provider (ISP).
es: Los XO están diseñados para conectarse a otros XO utilizando una red de malla. Una red de malla permite a las laptops XO cercanas hablar entre sí directamente (sin cables) sin la necesidad de un proveedor de servicios tradicionales de Internet (ISP).

source: The XO also supports wireless connections for direct Internet connection. Collaboration with others on Activities does not require an Internet connection.
es: La XO también admite conexiones inalámbricas para la conexión directa a Internet. La colaboración con otros en actividades no requiere una conexión a Internet.

source: There are different ways to connect to the Internet:
es: Hay diferentes maneras de conectarse a Internet:

source: using a wireless access point such as a WiFi hotspot at a library or coffee shop, or a location that has a wireless router such as your house
es: utilizando un punto de acceso inalámbrico, como un punto de acceso WiFi en una biblioteca o en la cafetería, o un lugar que tiene un router inalámbrico como tu casa

source: using a "School Server" provided by your school system
es: usando un "Servidor Escolar" provisto por tu sistema escolar

source: using a USB-to-Ethernet cable that plugs into a cable modem, DSL modem, or local network such as those offered at a home or workplace
es: mediante un cable USB a Ethernet que se conecta a un módem por cable, módem DSL o red local, como los ofrecidos en el hogar o lugares de trabajo

source: Before you connect
es: Antes de conectar

source: If you are going to connect at school or at home, check with your ISP to find out if the network is protected with a password. Your router also has a password which can be found in its documentation. Become familiar with your wireless router settings so that you can troubleshoot the connection if needed. The Troubleshooting chapter offers some assistance.
es: Si vas a conectarte en la escuela o en el hogar, consulta con tu ISP para averiguar si la red está protegida con una contraseña. El router también tiene una contraseña que se puede encontrar en su documentación. Familiarízate con la configuración del router inalámbrico para que puedas solucionar la conexión si es necesario. El capítulo Solución de problemas ofrece alguna asistencia.

source: Check your current connection status as shown in the lower right area on the Frame. If you have connected successfully in the past, the XO "remembers" the connection and will connect again in the future.
es: Comprueba el estado de la conexión actual que se muestra en la parte inferior derecha del Marco. Si te haz conectado con éxito en el pasado, el XO "recuerda" la conexión y se conectará de nuevo en el futuro.

source: Go to a location with your XO where you know there is a Wireless Access Point (WAP) nearby.
es: Ve a un lugar con tu XO donde sabes que hay un punto de acceso inalámbrico (WAP) en las inmediaciones.

source: Find out the network name (or SSID) and its password, if it is secured with a password. The XO refers to this as the Wireless Key.
es: Averigüa el nombre de la red (o SSID) y la contraseña, si se protege con una contraseña. La XO se refiere a esto como la Clave Inalámbrica.

source: Connecting
es: Conexión

source: Go to the Neighborhood View.
es: Ve a la vista de Vecindario.

source: In the Search field, enter the name of the network to which you want to connect.
es: En el campo Buscar, escribe el nombre de la red a la que deseas conectarte.

source: Or roll the pointer over one of the network access circles until you recognize the name of the wireless network.
es: O pon el puntero sobre uno de los círculos de acceso a la red hasta que reconozcas el nombre de la red inalámbrica.

source: Checking name of an AP
es: Comprobación de nombre de un punto de acceso

source: Connect by clicking the center of the circle.
es: Conecta haciendo clic en el centro del círculo.

source: Wireless access points are represented by circles. The fill level indicates signal strength.
es: Los puntos de acceso inalámbrico están representados por círculos. El nivel de llenado indica la intensidad de señal.

source: Access points that require keys have a "locked" icon.
es: Los puntos de acceso que requieren claves tienen un icono de "candado".

source: Access points that you have successfully connected to become "Favorites" as indicated by a star icon.
es: Los puntos de acceso que haz conectado con éxito se convierten en "Favoritos" indicado por un icono de estrella.

source: TODO: Picture_49.png need a new screen shot for the new mesh network
es: TODO: Picture_49. png necesita una nueva captura de pantalla para la nueva red de malla

source: Access points that represent the Mesh network are indicated with a target icon, with one for channel 1, one for channel 6, and one for channel 11. Hover your pointer over the access point to see if you're already connected or if you need to click to connect.
es: Los puntos de acceso que representan la red de malla se indican con un icono de circulos, con uno para el canal 1, uno para el canal 6, y uno para el canal 11. Sitúa el puntero sobre el punto de acceso para ver si ya está conectado o si es necesario hacer clic para conectarse.

source: Connected
es: Conectado

source: Not yet connected
es: Todavía desconectado

source: The name of the access point is displayed when you hover over it.
es: El nombre del punto de acceso se muestra cuando se pasa sobre el.

source: The center of the circle blinks while the laptop is trying to connect.
es: El centro del círculo parpadea mientras que el portátil está intentando conectarse.

source: Enter the wireless key if prompted. You might need to ask your teacher or parent for the wireless key.
es: Introduce la clave inalámbrica si se te pide. Puede que tengas que pedirle a tu maestro o padre la llave inalámbrica.

source: Entering wireless encryption (WEP) password
es: Entrando contraseña de encriptación inalámbrica (WEP)

source: While the XO is connecting to the network, the Access Point blinks.
es: Mientras que el XO se conecta a la red, los punto de acceso parpadean.

source: Once you are connected, the menu on the circle in the Neighborhood View changes, and you can see a circle in the lower right area of the Frame.
es: Una vez conectado, el menú en el círculo en la Vista de Vecindario cambia, y se puede ver un círculo en la parte inferior derecha del marco.

source: if the attempt to connect fails, the circle stops blinking, but the access point icon does not appear in the Frame. Click the circle in the Neighborhood View to try again—it sometimes takes 2–3 tries to connect.
es: Si el intento de conexión falla, el círculo deja de parpadear, pero el icono de punto de acceso no aparece en el Marco. Haz clicken el círculo de la vista de Vecindario para intentar de nuevo. Algunas veces toma 2 o 3 intentos.

source: To disconnect from the network, hover the pointer over the access point and click Disconnect on the menu.
es: Para desconectarte de la red, pasa el puntero sobre el punto de acceso y haz clic en el menú Desconectar.

source: Once your XO is connected, you can return back to the Home View and launch the Browse Activity.
es: Una vez que tu XO está conectado, puedes volver de nuevo a la vista principal y poner en marcha la actividad Navegar.

source: If you have not yet added the Browse Activity to your favorites, click the List View (left) and scroll to Browse. Add the Activity to your favorites list by clicking the star next to it (1). Launch Browse for the first time by clicking the globe icon (2). Next time, you can use the freeform view to launch it (as is done in the next step).
es: Si todavía no haz añadido la Actividad Navegar a tus favoritos, haz clic en la vista de lista (izquierda) y desplaza hasta Navegar. Añade la actividad a tu lista de favoritos haciendo clic en la estrella al lado (1). Lanza Navegar por primera vez haciendo clic en el icono del globo (2). La próxima vez, puedes utilizar la vista de forma libre para lanzarla (como se hace en el paso siguiente).

source: If you have added the Browse Activity to your favorites list, you can click the globe icon to open the Browse Activity and test your access to the Internet.
es: Si haz agregado la Actividad Navegar a tu lista de favoritos, puedes hacer clic en el icono del globo para abrir la Actividad Navegar y probar su acceso a Internet.

source: Click the globe icon to launch the Browse Activity.
es: Haz clic en el icono del globo para iniciar la Actividad Navegar.

source: If you cannot see an Access Point with a name that you recognize, the wireless antenna might be too far away, or the Access Point might not be working properly. For more information, or if you have difficulties getting a network connection, refer to the Troubleshooting chapter.
es: Si no puedes ver un punto de acceso con un nombre que reconozcas, la antena inalámbrica puede estar demasiado lejos, o el punto de acceso no está funcionando correctamente. Para obtener más información, o si tienes dificultades para obtener una conexión de red, consulta el capítulo de solución de problemas.

source: More information about your XO's connection:
es: Más información acerca de la conexión de XO:

source: Your Wireless Access Point has a network name, also called an SSID, that displays in the Neighborhood View. The XO cannot recognize SSIDs that are hidden, which is configured on the access point. Refer to the Troubleshooting chapter for more information about hidden SSIDs.
es: Tu punto de acceso inalámbrico tiene un nombre de red, también denominado SSID, que aparece en la vista de Vecindario. La XO no puede reconocer SSID que están ocultos, lo que es configurado en el punto de acceso. Consulta el capítulo Solución de problemas para obtener más información acerca de los SSID ocultos.

source: If you are connected to the Internet, your XO laptop cannot be on the mesh network, and if your XO is on a mesh network, it cannot simultaneously connect wirelessly to the Internet.
es: Si estás conectado a Internet, tu computadora portátil XO no puede estar en la red de malla, y si tu XO está en una red de malla, no se puede conectar al mismo tiempo de forma inalámbrica a Internet.

source: Mesh or AP
es: Malla o AP

source: If the XO cannot find an available Internet network point after five minutes of searching, it defaults to Mesh Network 1, which enables your XO laptop to connect to other nearby XO laptops.
es: Si la XO no puede encontrar un punto de acceso a la red Internet después de cinco minutos de búsqueda, por defecto pasa a la malla de red 1, que permite a tu laptop XO conectarse a otras computadoras XO cercanas.

source: Please be patient; it can take your XO up to a minute to find newly visible networks.
es: Por favor, sé paciente; puede tomarle a tu XO hasta un minuto encontrar redes visibles nuevamente.

source: Sometimes you'll be asked to enter the "Wireless Key" again. Enter it again and repeat until your connection is complete.
es: A veces se te pedirá que introduzcas la "Clave Inalámbrica" ​​de nuevo. Ingrésala de nuevo y repite hasta que tu conexión se complete.

source: For more information about connecting, please see the Support FAQ online.
es: Para obtener más información sobre la conexión, consulta la Ayuda en línea FAQ.
