Repository: tony37/sledhelp
Catalog: translated_po/*/glossary.po
Languages: es

source: Glossary
es: Glosario

source: Activity
es: Actividad

source: Sugar education software module. In other contexts these might be called programs, but we prefer to emphasize what the students can do with them, not where they came from.
es: Módulo de software educativo Sugar. En otros contextos, estos podrían ser llamados programas, pero preferimos hacer hincapié en lo que los estudiantes pueden hacer con ellos, no de dónde vienen.

source: Definition
es: Definición

source: An association between a name which may mean nothing by itself and a description intended to convey an important idea. Frequently we need a different kind of association between names and ideas, such as pictures, animations, or actual experience. The most important purpose of definitions is to explain what the thing named does; another is to describe its uses, or as we often say its purposes; a third is to describe the appearance of something, so that we can recognize it when we see it; a fourth is to enable us to talk about the thing conveniently with those who already have some idea of it. Usually the order of importance of these purposes is entirely misunderstood.
es: Una asociación entre un nombre que puede significar nada por sí mismo y una descripción destinada a transmitir una idea importante. Con frecuencia necesitamos un tipo diferente de asociación entre nombres e ideas, como imágenes, animaciones o experiencia real. El propósito más importante de las definiciones es explicar lo que la cosa nombrada hace; otro es para describir sus usos, o como decimos a menudo sus fines; el tercero es para describir la apariencia de algo, de modo que podamos reconocerlo cuando lo vemos; cuarto es para que podamos hablar de la cosa convenientemente con aquellos que ya tienen una idea de ello. Por lo general, el orden de importancia de estos efectos se malentiende.

source: Favorite
es: Favorito

source: Activity that shows in the Home view icon ring. A user can mark an Activity as a Favorite in the List view by clicking the star outline next to the Activity name.
es: Actividad que se muestra en el anillo de íconos de la vista Hogar. Un usuario puede marcar una actividad como favorita en la vista de lista haciendo clic en la estrella junto al nombre de Actividad.

source: Frame
es: Marco

source: Popup rectangular border in Sugar showing View icons and active Activities on the top; friend icons on the right; hardware icons on the bottom; and icons for open documents on the left. The frame is activated by putting the mouse cursor into a corner of the screen, or optionally the side (see My Settings), or by pressing the Frame button on the top right of an XO keyboard. Moving the mouse cursor away from the activation area or pressing the Frame button while the Frame is active dismisses the Frame.
es: Borde rectangular emergente en Sugar mostrando iconos de vistas y Actividades activas en la parte superior; iconos de amigos a la derecha; iconos de hardware en la parte inferior; e iconos para documentos abiertos a la izquierda. El marco se activa al poner el cursor del ratón en una esquina de la pantalla, o, opcionalmente, el lado (ver mi configuración), o pulsando el botón de marco en la parte superior derecha de un teclado XO. Al mover el cursor del ratón de distancia del área de activación o presionando el botón del marco, mientras que el marco está activo desestima el marco.

source: Group view
es: Vista de grupo

source: View showing colored XO icons of the user's friends who are connected, and grayed-out icons for those who are not.
es: Vista que muestra iconos XO de color de los amigos del usuario que están conectados, y en gris iconos para los que no lo estan.

source: Home view
es: Vista Hogar

source: View showing XO icon, an icon for the current Activity (or journal if no Activity has been started), and a ring or other arrangement of available Activity icons.
es: Vista que muestra el icono XO, un icono para la actividad actual (o diario si no se ha iniciado ninguna actividad), y un anillo u otra disposición con los iconos de actividad disponibles.

source: Hover Menu
es: Menú flotante

source: A menu that pops up when the mouse cursor is held over an icon for one second, and expands further after one more second. A feature that many users cannot discover without being told about it.
es: Un menú que aparece cuando el cursor del ratón se mantiene sobre un icono durante un segundo, y se expande aún más después de un segundo más. Una característica que muchos usuarios no pueden descubrir sin que se les cuente.

source: Index
es: Índice

source: Synonym for Glossary.
es: Sinónimo de Glosario.

source: Journal
es: Diario

source: A browser for saved software sessions and documents, allowing sorting, searching, and access to metadata.
es: Un navegador de las sesiones guardadas de software y documentos, lo que permite la clasificación, búsqueda y acceso a los metadatos.

source: Menu Bar
es: Barra de menús

source: A rectangular area at the top of the screen containing text labels or icons, where clicking with the mouse results in the appearance of a drop-down menu containing further labels or icons for Activity functions available to the user.
es: Un área rectangular en la parte superior de la pantalla que contiene etiquetas de texto o iconos, en donde al hacer clic con el ratón produce la aparición de un menú desplegable que contiene nuevas etiquetas o iconos para las funciones de actividad disponibles para el usuario.

source: Metadata
es: Metadatos

source: Information about a file, such as file type, software used to create it, description, tags, a screen shot, date and time, and more. The Journal maintains metadata about saved documents and software sessions.
es: Información sobre un archivo, como el tipo de archivo, el software usado para crearlo, descripción, etiquetas, una captura de pantalla, la fecha y la hora, y más. El Diario mantiene los metadatos de los documentos guardados y sesiones de software.

source: Neighborhood view
es: Vista Vecindario

source: View showing wireless mesh and access points, connected XOs, and shared Activities.
es: Vista que muestra puntos de malla y de acceso inalámbricos, XOS conectados, y Actividades compartidas.

source: Operating System. This describes the Software that runs on your XO laptop.
es: Sistema Operativo. Esto describe el software que se ejecuta en su computadora portátil XO.

source: School server (XS)
es: Servidor de la escuela (XS)

source: A computer designed by OLPC for use in schools to hold student backups and content, and to provide school administration server software such as Moodle.
es: Una computadora diseñada por OLPC para su uso en las escuelas para mantener copias de seguridad de los estudiantes y contenido, y para proporcionar software de servidor de administración de la escuela, tales como Moodle.

source: Education software for the One Laptop Per Child project, designed to run on the XO and on other computers running the Linux operating system.
es: Software educativo para el proyecto One Laptop Per Child, diseñado para funcionar en la XO y en otros equipos que ejecutan el sistema operativo Linux.

source: Toolbar
es: Barra de herramientas

source: A rectangular area of the screen, usually at the top, containing icons representing Activity functions available to the user.
es: Un área rectangular de la pantalla, por lo general en la parte superior, que contiene iconos que representan las funciones de actividad disponibles para el usuario.
