Repository: tony37/sledhelp
Catalog: translated_po/*/group_view.po
Languages: es

source: Group View
es: Vista de grupo

source: The Group View shows you, your friends and allows you to easily interact with them.
es: La vista de grupo muestra, tus amigos y te permite interactuar fácilmente con ellos.

source: Accessing the Group View
es: Acceso a la vista de grupo

source: To show the Group View, click the Group icon on the Frame or press the F2 key.
es: Para mostrar la vista de grupo, haz clic en el icono de grupo en el Marco o presione la tecla F2.

source: The Group View shows you and your friends. XO icons that are dimmed represent friends who are currently offline.
es: La vista de grupo te muestra a ti y tus amigos. Iconos XO que están atenuados (grises) representan amigos que están actualmente fuera de línea.

source: Adding a friend
es: Agregando un amigo

source: You add friends to the Group View from the Neighborhood View.
es: Agregas amigos a la vista de grupo desde la Vista Vecindario.

source: When you hover over an XO icon, the Make friend menu option appears. Click this option to add that person as a friend.
es: Al pasar sobre un icono XO, aparece la opción de menú 'Agregar amigo'. Haz clic en esta opción para agregar a esa persona como un amigo.

source: Your new friend's icon then appears in the Group View.
es: El ícono de tu nuevo amigo luego aparece en la vista de grupo.

source: Inviting a friend
es: Invitar a un amigo

source: From the hover menu, you can also invite friends to join your current Activity. There is more information about invitations and sharing in the Collaborating chapter.
es: En el menú flotante, también puedes invitar a amigos a unirse a tu actividad actual. Hay más información acerca de las invitaciones y el intercambio en el capítulo de Colaboración.

source: Removing a friend
es: Quitando un amigo

source: You can remove a friend from the Group View using the hover menu. Click Remove friend. That person's icon disappears from the Group View.
es: Puedes eliminar un amigo de la vista de grupo utilizando el menú flotante. Haz clic en Remover amigo. El ícono de esa persona desaparece de la vista de grupo.
