Repository: tony37/sledhelp
Catalog: translated_po/*/help.po
Languages: es

source: Help
es: Ayuda

source: Help displays documentation for Sugar and the XO laptop.
es: Ayuda muestra documentación de Sugar y el portátil XO.

source: The image above is of the top of the screen, when the Activity Help is running. There is a simple range of tabs and buttons on the top row of the toolbar. Starting from the left, they are:
es: La imagen de arriba es de la parte superior de la pantalla, cuando la actividad de ayuda está en marcha. Hay una sencilla serie de pestañas y botones en la fila superior de la barra de herramientas. A partir de la izquierda, que son:

source: Activity tab or toolbar button.
es: Pestaña o botón de Actividad.

source: View toolbar button.
es: Botón Ver.

source: Home button, brings you back to the index, or contents page.
es: Botón de inicio, te trae de vuelta al índice, o la página de contenidos.

source: Back button.
es: Botón Atrás.

source: Forward button.
es: Botón Adelante.

source: Stop, or close the Activity, on the far right of the toolbar.
es: Detener, o cerrar la actividad, en el extremo derecho de la barra de herramientas.

source: Tour of Help
es: Conociendo Ayuda

source: We see, working clockwise from top left:
es: Vemos, en sentido horario desde arriba a la izquierda:

source: Activity tab, here you can enter a name for the page or project. The "pencil and book" icon the Description button allows you to add a description to the :doc:`/journal` entry.
es: Pestaña Actividad, aquí se puede introducir un nombre para la página o proyecto. El ícono con el "lápiz y libro" del botón Descripción te permite añadir una descripción a la entrada del :doc:`journal`.

source: The :doc:`/collaborating`, or sharing, icon is grayed out and not available.
es: El ícono :doc:`/collaborating`, o compartir, aparece atenuado y no está disponible.

source: In Help you do not really need to provide a name for the page you are researching, but it allows you to get back to it easily from the :doc:`/journal`.
es: En Ayuda realmente no necesitas proporcionar un nombre para la página que estás investigando, pero esto te permite obtenerla de nuevo fácilmente desde el:doc:`/ journal`.

source: View toolbar button. The buttons are zoom in, zoom out, and enlarge page to *Full screen*.
es: Botón Ver. Los botones son acercar, alejar, y agrandar página a pantalla completa.

source: *Next* button, top right of every page, takes you to the next page of Help.
es: Link *Siguiente*, arriba a la derecha de cada página, te lleva a la página siguiente de Ayuda.

source: Follow links in the index to jump to that page. Here the Activity FotoToon is being selected.
es: Siga los enlaces en el índice para ir a esa página. Aquí la Actividad FotoToon es seleccionada.

source: Forward and Back buttons help you navigate.
es: Los botones Adelante y Atrás te ayudan a navegar.

source: Use this small red icon, only showing when you hover the cursor over it, at the end of a paragraph heading, to place the paragraph well on your screen.
es: Utiliza este pequeño icono rojo, mostrando sólo cuando se pasa el cursor sobre él, al final de un párrafo de encabezado, para colocar el párrafo bien en su pantalla.

source: Here we see a link to the OLPC getting started page. Within Help you can follow links, which take you onto the internet, when you are online.
es: Aquí vemos un enlace a la página Introducción de OLPC. Dentro de Ayuda puedes seguir enlaces, que te llevan a la Internet, cuando estás en línea.

source: The Home button brings you back to the index, or contents page.
es: El botón Inicio te trae de vuelta al índice, o la página de contenidos.

source: Stop, or close the Activity.
es: Detener o cerrar la Actividad.

source: Help read aloud
es: Leer en voz alta la Ayuda

source: In Help, and other text based Activities, you can have robot Alice (the page :doc:`/speak` introduces Alice) read the page aloud in the background, while you explore the Activity. See :ref:`say_selected_text`
es: En Ayuda, y otras actividades basadas en texto, puedes hacer que el robot Alice (la página :doc:`/ speak` introduce a Alice) lea la página en voz alta, mientras exploras la Actividad. Ver :ref:`say_selected_text`

source: |more| The underlying software used to display Help, and for the user to edit within Help, is Sphinx. To explore the possibilities of documentation made using this software, please follow the link to *Sphinx* in the footnote below.
es: |more| El software subyacente utilizado para mostrar Ayuda, y para el usuario que desea editar Ayuda, es Sphinx. Para explorar las posibilidades de la documentación realizados mediante este software, por favor siga el enlace a *Sphinx* en la nota al pié.
