Repository: tony37/sledhelp
Catalog: translated_po/*/home_view.po
Languages: es

source: Home View
es: Vista Inicio

source: Use the Home View to begin new Activities.
es: Utiliza la vista Inicio para comenzar nuevas actividades.

source: Note: When you have clicked on an Activity's icon, please wait for that Activity to start. If you get impatient and happen to click again on the Activity's icon, you may end up with that Activity being started twice. When you click on an Activity's icon, you will see a start-up view while that Activity initializes. Once the Activity is running, you will be placed into its Activity View. If the Activity fails to start, you will instead be returned to Home View.
es: Nota: Una vez que haz hecho clic en el icono de una actividad, por favor espera a que la Actividad comience. Si te vuelves impaciente y pasas a hacer clic de nuevo en el icono de la actividad, puede terminar con la actividad que se iniciándose dos veces. Al hacer clic en el icono de una actividad, verás una pantalla de inicio, mientras que la Actividad inicia. Una vez que la actividad se ejecute, se te colocará en la pantalla de actividad. Si la actividad no se inicia, en su lugar volverás a la vista de Inicio.

source: To get to the Home View, click the Home icon on the Frame or press the F3 key.
es: Para llegar a la vista de Inicio, haz clic en el icono Inicio en el Marco o presiona la tecla F3.

source: The Home View has several modes. Each mode has a different arrangement of Activities:
es: La vista de Inicio tiene varios modos. Cada modo tiene una disposición diferente de las Actividades:

source: Your favorite Activities in a ring (Ring mode)
es: Tus actividades favoritas en un anillo (Modo anillo)

source: Your installed Activities in a list (List view)
es: Tus actividades instaladas en una lista (Vista de lista)

source: Your favorite Activities arranged freeform (Freeform mode)
es: Tus actividades favoritas de distribuidas en forma libre (modo Forma Libre)

source: Favorites View
es: Ver Favoritos

source: Search box: Use the search box to find Activities. Note: If in List view you see fewer Activities than expected, you may need to click on the small X at the right end of the search box to undo an unintended search request.
es: Cuadro de búsqueda: Utiliza el buscador para encontrar Actividades. Nota: Si en la vista de lista se ve menos Actividades que lo esperado, es posible que tengas que hacer clic en la pequeña X en el extremo derecho del cuadro de búsqueda para deshacer una solicitud de búsqueda no intencional.

source: Favorites modes: Click an icon to switch to a different view. Hover over the Favorites icon to see a menu that lets you pick Ring mode or Freeform mode.
es: Modos de Favoritos: Haz clic en un icono para cambiar a una vista diferente. Pon el mouse sobre el icono Favoritos para ver un menú que te permita elegir el modo de anillo o el modo Forma libre.

source: List view: Click the icon to switch over to the List view.
es: Vista de lista: Haz clic en el icono para cambiar a la vista de lista.

source: Activity icon: Click an Activity icon to launch that Activity. Its icon is colored if the Activity has been used before and clicking on it will resume its last session. (Please see the Activity Menu section below for further information.) Only Activities that have been “starred” as favorites in the List View appear in this view.
es: Icono de Actividad: Haz clic en un icono de Actividad para comenzar esa Actividad. Su icono es de color si la actividad se ha utilizado antes y haciéndole clic reanudará su última sesión. (Consulta la sección Menú de actividad abajo para más información.) Sólo las actividades que han sido seleccionado como favoritas en la vista de Lista aparecen en esta vista.

source: Active Activity icon: The icon of the currently active Activity appears under the XO icon.
es: icono de Actividad activo: El icono de la Actividad actualmente activo aparece bajo el icono de XO.

source: XO icon: Hover the pointer over the "XO" in the center of the Home View to bring up a menu and to access the Sugar Control Panel (Please see the chapter on Customizing Sugar).
es: Icono de XO: Sitúe el puntero sobre el "XO" en el centro de la vista de Inicio para que aparezca un menú y puedas acceder al Panel de Control de Sugar (Por favor, consulta el capítulo de Personalización de Sugar).

source: When a search is started the Activities which don't correspond to the result are greyed out.
es: Cuando se inicia una búsqueda las actividades que no corresponden a los resultados aparecen en gris.

source: List View
es: Vista de lista

source: Use the List view to manage all of your Activities and to choose which Activity icons will appear on the Favorites view.
es: Utiliza la vista de lista para organizar todas tus actividades y elegir los iconos de qué Actividad aparecerán en la vista de Favoritos.

source: Activity favorite icon: A star, which is colored for favorite Activities, which appear in the Ring mode or Freeform mode. Click a star to color or clear it.
es: Icono de actividad favorita: Una estrella, que es de color para actividades favoritas, que aparecen en el modo circular o el modo forma libre. Haz clic en una estrella para colorearla o desactivarla.

source: Activity icon: Click the icon to launch the Activity or hover over it to see the corresponding menu.
es: Icono de Actividad: Haz clic en el icono para iniciar la actividad o pon el mouse sobre él para ver el menú correspondiente.

source: Hover menu: In this menu you can also launch, favorite and un-favorite Activities and erase them.
es: Menú flotante: En este menú también puedes poner en marcha actividades, hacerlas favoritas o no, y borrarlas.

source: Version number: Here you can see which version of the Activity is currently installed. For more information about updating your Activities to the latest version please refer to the How to Install and Update Activities section.
es: Número de versión: Aquí puedes ver qué versión de la actividad está instalada actualmente. Para obtener más información sobre actualizar tus actividades a la última versión por favor consulta la sección de Cómo instalar y actualizar Actividades.

source: Favorites View in Freeform Mode
es: Vista de Favoritos en modo forma libre

source: The Freeform mode of the Home View works the same as the Ring mode, but the icons are arranged arbitrarily instead of in a circle. You can drag the icons in this View to visually group them in a way that makes sense to you.
es: El modo Forma libre de la vista principal funciona igual que el modo circular, pero los iconos están dispuestos arbitrariamente en lugar de en un círculo. Puedes arrastrar los iconos en esta vista para agruparlos visualmente de una manera que tenga sentido para ti.

source: Activity Menu
es: Menú de actividad

source: When hovering over an Activity icon a corresponding menu appears. From there you can directly resume the last few Activity sessions or choose to start a new one.
es: Cuando se te posas sobre un icono de actividad aparece un menú correspondiente. Desde allí puedes reanudar directamente las últimas sesiones de actividad u optar por iniciar una nueva.

source: XO Menu
es: Menú XO

source: Use the hover menu that appears over the XO icon to access the Sugar Control Panel and to shutdown or restart the computer.
es: Utiliza el menú flotante que aparece sobre el icono de XO para acceder al panel de control de sugar y para apagar o reiniciar el equipo.
