Repository: tony37/sledhelp
Catalog: translated_po/*/how_to_volunteer.po
Languages: es

source: How to volunteer
es: ¿Cómo ser voluntario?

source: Volunteers Change the World
es: Los Voluntarios Cambian el Mundo

source: Join us in our global mission to improve education for the world's children! Volunteer contribution is central to the educational spirit of OLPC. The ways to volunteer are as varied as your interests. The sections that follow provide information to learn how to become a volunteer, based on your interests and background.
es: Únete a nosotros en nuestra misión global de mejorar la educación de los niños del mundo! La contribución de los voluntarios es fundamental para el espíritu educativo de OLPC. Las formas de voluntariado son tan variadas como tus intereses. Las secciones siguientes proporcionan información para aprender cómo llegar a ser un voluntario, en función de tus intereses y tu preparación.

source: If learning matters to you, you will be welcome. To directly get involved, visit the web site http://olpcMAP.net or email volunteer@laptop.org.
es: Si te importa el aprendizaje, eres bienvenido. Para involucrarte directamente, visite el sitio web http://olpcMAP.net o envía un correo a volunteer@laptop.org.

source: Finally, know that there are LOTS of fun, cool people out in the world who'd like to work and play together with you as contributors, to help spread our mission and to improve children's lives.
es: Por último, sabemos que hay un montón de diversión, gente cool en el mundo a quienes les gustaría trabajar y jugar junto contigo como contribuyentes, para ayudar a difundir nuestra misión y para mejorar la vida de los niños.

source: Kids, siblings, and parents
es: Para niños, hermanos y padres

source: The XO is meant for the entire family to use, so learning as much as you can to help each other learn is one way to volunteer with (and for) other OLPC learners worldwide.
es: La XO es para ser usada por toda la, así que aprende lo más que puedas para ayudar a los demás, es una manera de aprender a ser voluntario con (y para) otros alumnos de OLPC en todo el mundo.

source: You can contribute to the wiki, a web site that you can edit, at http://wiki.laptop.org to share your knowledge and XO laptop experience.
es: Puedes contribuir a la wiki, un sitio web que se puede editar, en http://wiki.laptop.org para compartir tu experiencia y conocimientos con la laptop XO.

source: You can tell others about your projects and recruit others to join your efforts. To understand how easy it is to edit the wiki, go to http://wiki.laptop.org/go/Wiki_getting_started.
es: Puedes decirle a otros acerca de tus proyectos y reclutar a otros a unirse a tus esfuerzos. Para entender lo fácil que es editar la wiki, ve a http://wiki.laptop.org/go/Wiki_getting_started.

source: You might want to get involved in a regional group with other XO owners in your area. You can find many such vibrant communities at http://wiki.laptop.org/go/Regional_community_groups.
es: Es posible que desees participar en un grupo regional con otros propietarios de XO en tu área. Puede encontrar muchas de esas comunidades vibrantes en http://wiki.laptop.org/go/Regional_community_groups.

source: Teachers, students, and educators
es: Profesores, estudiantes y educadores

source: The OLPC project is an education project above all else, so your contributions are highly valued. You can contribute by testing, developing content, mentoring, or running group activities. You can start a University chapter of OLPC users -- both formal Community Service Learning and great informal clubs exist. Details may be found at wiki.laptop.org/go/University_program.
es: El proyecto OLPC es un proyecto de educación por encima de todo, por lo que sus aportes son muy valorados. Puedes contribuir haciendo pruebas, desarrollo de contenidos, tutoría, o ejecutando actividades de grupo. Puedes comenzar un capítulo en tu Universidad, existen tanto grupos de servicio a la cumunidad como grandes clubes informales. Ae pueden encontrar detalles en wiki.laptop.org/go/University_program.

source: You can try to meet with other teachers and students within your geographic region, or look up pre-existing groups within the list of regional groups here: http://wiki.laptop.org/go/Groups.
es: Puede tratar de reunirte con otros profesores y estudiantes dentro de tu región geográfica, o buscar grupos preexistentes dentro de la lista de grupos regionales aquí: http://wiki.laptop.org/go/Groups.

source: If you enjoy personally helping others, and the challenge of solving problems with learners worldwide, you would be a perfect fit for the Support Gang. We work together answering all kinds of questions about the XO, peripherals, software, volunteering, deployment, organizational development and anything else OLPC users ask about.
es: Si te gusta ayudar personalmente a otros, y el desafío de resolver los problemas con los estudiantes de todo el mundo, te gustará el grupo Support Gang. Trabajamos juntos contestar todo tipo de preguntas acerca de la XO, periféricos, software, el voluntariado, los despliegues, desarrollo organizacional y todo lo que los usuarios de OLPC puedan preguntar.

source: Community Support Volunteers are an extremely friendly and supportive group, who came together from all around the world, and work together closely online. We also meet weekly with invited guest speakers by phone, and in person whenever possible.
es: Los voluntarios comunitarios de apoyo son un grupo extremadamente amable y solidario, que se reunieron alrededor de todo el mundo, y trabajan juntos estrechamente en línea. También nos reunimos semanalmente con oradores invitados por teléfono y en persona siempre que sea posible.

source: When you volunteer, fellow volunteers and OLPC will help you get started and assist you in finding answers to difficult or unusual technical questions. Bilingual volunteers are most especially welcome. Please join us at http://wiki.laptop.org/go/Support_Gang.
es: Cuando tu te ofreces voluntariamente, otros voluntarios y OLPC te ayudarán a empezar y te ayudarán a encontrar respuestas a las preguntas técnicas difíciles o inusuales. Voluntarios bilingües son especialmente bienvenidos. Por favor, únete a nosotros en la dirección http://wiki.laptop.org/go/Support_Gang.

source: Documentation
es: Documentación

source: If you would like to help others learn about the XO then you can help with the documentation. We have a dedicated team and we eagerly welcome new contributors! You don't need to be a expert on the technology to participate - you may wish to just spell check or check images. You may also be inspired to write a chapter or improve existing chapters. You can learn more on how to contribute by joining the OLPC Library mailing list http://lists.laptop.org/listinfo/library
es: Si deseas ayudar a otros a aprender acerca de la XO entonces puedes ayudar con la documentación. Tenemos un equipo dedicado y con entusiasmo da la bienvenida a nuevos colaboradores No necesitas ser un experto en la tecnología para participar - es posible que desees simplemente chequear ortografía o verificar imágenes. También es posible que estes inspirado para escribir un capítulo o mejorar capítulos existentes. Puede obtener más información sobre cómo contribuir al unirte a la lista de correo de OLPC Biblioteca http://lists.laptop.org/listinfo/library

source: Existing XO and Sugar manuals are written and hosted at FLOSS Manuals.
es: Los Manuales XO y Sugar existentes fueron escritos y alojados en FLOSS Manuals.

source: Translators
es: Traductores

source: OLPC is a world-wide program that tries to reach people in many countries, who speak many different languages. You can get an idea of the program and look for your languages on the Sugar Labs translation server. If you speak and write more than one language, you can help translate the wiki or the software. If you can help, please see http://wiki.laptop.org/go/Translation.
es: OLPC es un programa mundial que intenta llegar a la gente de muchos países, que hablan muchos idiomas diferentes. Tu puedes tener una idea del programa y buscar tu lengua en el servidor de traducción Sugar Labs. Si hablas y escribes más de un idioma, puede ayudar a traducir la wiki o el software. Si puedes ayudar, por favor visita http://wiki.laptop.org/go/Translation.

source: Content creators, writers, artists, photographers, videographers
es: Creadores de Contenido, escritores, artistas, fotógrafos, videógrafos

source: Everyone is a creator: by creating and sharing something, you inevitably understand it better. Writing about the XO can also be one of the greatest contributions to helping others.
es: Todo el mundo es un creador: al crear y compartir algo, inevitablemente lo entiendes mejor. Escribir sobre la XO también puede ser una gran forma de ayudar a los demás.

source: Please consider offering your communications or media talents on the OLPC Wiki - whether by writing, designing, editing, storytelling or simply organizing - anywhere within http://wiki.laptop.org.
es: Por favor considera ofrecer tus talentos de comunicación o creación de medios en la OLPC Wiki - ya sea escribiendo, diseñando, editando, o narrando o simplemente organizando - cualquier lugar dentro de http://wiki.laptop.org.

source: If you want to create art for the XO, you can join other artists at the Art Community page at http://wiki.laptop.org/go/Community:Art.
es: Si deseas crear arte para la XO, puede unirte a otros artistas en la página de Arte de la Comunidad en la dirección http://wiki.laptop.org/go/Community:Art.

source: You can upload photos to a great, growing worldwide archive at http://www.flickr.com/groups/olpc. One group of photos even shows those specially taken by XO laptops themselves, using the Record Activity. Hardware designers and testers
es: Puedes subir fotos a un gran archivo global en crecimiento en la dirección http://www.flickr.com/groups/olpc. Un grupo inclusive muestra fotos tomada con las mismas laptops XO, mediante la actividad Grabar. Diseñadores de hardware y testers

source: There are lots of volunteer hardware opportunities, from brainstorming about alternative power to developing peripherals to repairing XOs. You may want to develop peripherals for the XO that use its USB ports or other inputs, for health applications or beyond: http://wiki.laptop.org/go/Health.
es: Hay un montón de oportunidades de ser voluntario relacionadas con hardware, desde intercambio de ideas sobre fuentes de poder alternativas a el desarrollo de periféricos, a reparación de las XO. Es posible que desees desarrollar periféricos para la XO que utilizan sus puertos USB u otros insumos, para aplicaciones de salud o más allá: http://wiki.laptop.org/go/Health.

source: You can get involved with community repair centers or start your own, with volunteers or as a business: http://wiki.laptop.org/go/Repair_center_locations.
es: Puedes involucrarte con los centros de reparación de la comunidad o iniciar uno propio, con voluntarios o como un negocio: http://wiki.laptop.org/go/Repair_center_locations.

source: You may want to work on power generation: http://lists.laptop.org/listinfo/power. Or firmware coding: http://wiki.laptop.org/go/OFW. To find out more about all of these types of hardware projects search for those keywords at: http://wiki.laptop.org/go/Category:Hardware.
es: Es posible que desees trabajar en la generación de energía: http://lists.laptop.org/listinfo/power. O en codificación del firmware: http://wiki.laptop.org/go/OFW. Para obtener más información sobre todos estos tipos de proyectos de hardware busca con estas las palabras clave en: http://wiki.laptop.org/go/Category:Hardware.

source: Software Developers especially should connect with Sugar Labs: http://join.sugarlabs.org
es: Los desarrolladores de software especialmente deben conectarse con Sugar Labs: http://join.sugarlabs.org

source: The XO's software is designed to be malleable because we want the help of all the people in the world who are capable of writing free software to help other people learn. To get involved, you can:
es: El software de la XO está diseñado para ser maleable porque queremos la ayuda de toda la gente del mundo que sean capaces de escribir software libre para ayudar a otras personas a aprender. Para participar, usted puede:

source: Write activities http://wiki.sugarlabs.org/go/Activity_Team.
es: Escribir actividades http://wiki.sugarlabs.org/go/Activity_Team.

source: Fix, report, or triage bugs http://bugs.sugarlabs.org and http://dev.laptop.org.
es: Resolver, informar o priorizar errores http://bugs.sugarlabs.org y http://dev.laptop.org.

source: Help test http://wiki.laptop.org/go/Friends_in_testing.
es: Ayudar con pruebas: http://wiki.laptop.org/go/Friends_in_testing.

source: Hack Sugar and our OS http://wiki.laptop.org/go/Developers_manual.
es: Hack Sugar y nuestro SO http://wiki.laptop.org/go/Developers_manual.

source: In short: "patches are welcome".
es: En resumen: "parches son bienvenidos".

source: Local opportunities
es: Oportunidades locales

source: Help create changes in the community you live in - as well as ones you'd like to visit. Start or join a grassroots group: http://wiki.laptop.org/go/Groups.
es: Ayuda a crear cambios en la comunidad en que vives en -, así como las que te gustaría visitar. Inicia o únete a un grupo local: http://wiki.laptop.org/go/Groups.

source: Create a Community Repair Center: http://wiki.laptop.org/go/Repair_center_locations.
es: Crea un centro comunitario de reparaciones: http://wiki.laptop.org/go/Repair_center_locations.

source: Help out at a nearby Pilot deployment: http://planet.laptop.org.
es: Ayudar en una implementación piloto en tu zona: http://planet.laptop.org.

source: Run, host, or attend an Event or Jam: http://olpcMAP.net.
es: Organiza, se anfitrión, o asista a un evento o Jam: http://olpcMAP.net.

source: Deployment
es: Despliegues

source: Volunteering at an OLPC deployment or school of any size is sometimes possible, in exceptional cases: http://wiki.laptop.org/go/ClassActs/Resources
es: Ser voluntario en un despliegue de OLPC o en una escuela de cualquier tamaño a veces es posible, en casos excepcionales: http://wiki.laptop.org/go/ClassActs/Resources

source: Volunteers working on their own much smaller deployments, work together leveraging their mutual insights: http://wiki.laptop.org/go/ALEARN_Network
es: Los voluntarios que trabajan en sus propias implementaciones más pequeñas, trabajan juntos aprovechando sus conocimientos mutuos: http://wiki.laptop.org/go/ALEARN_Network

source: A great way to get started is to explore others' work at http://planet.laptop.org and then email your specific interests and qualifications to: mailto:volunteer@laptop.org
es: Una gran manera de empezar es explorar el trabajo de otros en la dirección http://planet.laptop.org y envíarnos un mensaje con sus intereses y calificaciones específicas a: mailto:volunteer@laptop.org

source: Annual Community Summits
es: Cumbres anuales comunitarias

source: Nothing beats meeting in person, and the OLPC community's biggest annual summit occurs in October in San Francisco, thanks to: http://olpcSF.org.
es: Nada es mejor que reunirse en persona, y la más grande cumbre anual de la comunidad OLPC se produce en octubre en San Francisco, gracias a: http://olpcSF.org

source: Similarly a more technical spring summit generally takes plan around May in Montevideo, Uruguay: http://ceibalJAM.org.
es: Del mismo modo una cumbre más técnica generalmente se organiza alrededor de mayo en Montevideo, Uruguay: http://ceibalJAM.org.

source: Conclusions
es: Conclusiones

source: We weren't kidding when we told you that we accept volunteer contributions of all shapes, sizes, and kinds. Would you enjoy making presents for millions of children every day? Can you help?
es: Nosotros no estábamos bromeando cuando les dijimos que aceptamos contribuciones de los voluntarios de todas las formas, tamaños y tipos. ¿Te gustaría hacer regalos para millones de niños cada día? ¿Puedes ayudar?
