Repository: tony37/sledhelp
Catalog: translated_po/*/how_to_help.po
Languages: es

source: How to edit Help and contribute
es: Cómo editar Ayuda y contribuir

source: Page version for review.
es: Página para revisión.

source: Corrections, omissions, and feedback most welcome, iain at browndouglas dot plus dot com. 28 November 2013.
es: Las correcciones, omisiones y retroalimentación son bienvenidas, iain at browndouglas dot com . 28 de noviembre 2013.

source: Help displays documentation for Sugar and the XO laptop.
es: Ayuda muestra documentación de Sugar y el portátil XO.

source: This version of Help contains all the source files and images, and now a :ref:`View source` button. These files can be edited within Help, and displayed. Help is now capable of producing new pages for Help, or making completely fresh documentation.
es: Esta versión de ayuda contiene todos los archivos de código fuente y las imágenes, y ahora permite ref:`View source`. Estos archivos se pueden editar y ver en Ayuda. La ayuda es ahora capaz de producir nuevas páginas para Ayuda, o hacer documentación completamente nueva.

source: This page aims to show how to write attractive documentation, which, if users share their work, could be used to improve Help. To contribute you only need to:
es: Esta página tiene como objetivo mostrar cómo escribir documentación atractiva, que, si los usuarios compartir su trabajo, podría ser utilizado para mejorar la Ayuda. Para contribuir sólo necesitas:

source: Create a development environment
es: Crear un entorno de desarrollo

source: Make changes
es: Hacer los cambios

source: Contribute the changes
es: Contribuir con los cambios

source: XO Help.xo 17 already includes the source files ready to use.
es: XO Help.xo 17 ya incluye los archivos de fuentes listos para usar.

source: Alternatively, you can use git to get Help Activity with the most recent sources included. If you have the Activity Help already installed, uninstall it first. Generally an Activity is uninstalled from the F3, Home View, List, by selecting the Activity, and press Erase. Where Erase is not available, you need to delete ``Help.activity`` from the folder ``~/Activities``.
es: Alternativamente, puedes utilizar git para obtener la Actividad Ayuda con los fuentes más recientes incluidos. Si tienes la actividad de ayuda ya instalado, desinstalala primero. Generalmente una Actividad se desinstala desde la Vista Hogar, en la VIsta de Lista, mediante la selección de la Actividad y pulsando Borrar. Dónde Borrar no está disponible, es necesario eliminar la actividad `` Ayuda. `` de la carpeta ``~/Activities``.

source: The following guide assumes you ``git clone`` from your home directory. This command will collect all the required resources.
es: La siguiente guía supone que tu haz hecho ``git clone`` desde su directorio principal. Este comando recoger todos los recursos necesarios.

source: You can install it in your Sugar development environment doing: ::
es: Se puede instalar en el entorno de desarrollo de Sugar haciendo: ::

source: You need have a complete sugar environment to run "setup.py dev" if you have a error in your system, try run it in the Terminal Activity.
es: Necesita tener un ambiente de Sugar completa para correr "setup.py dev" si tienes un error en tu sistema, trata de ejecutarlo en la Actividad Terminal.

source: and, when you are ready, to populate your Help pages ::
es: y, cuando estes listo, llenar tus páginas de Ayuda ::

source: You can modify any .rst file in ~/help-activity/source/ directory or the images in the ~/help-activity/source/images/ directory.
es: Puedes modificar cualquier archivo .rst primero en ~ /help-activity/source/ o las imágenes en su directorio ~/help-activity/source/images/.

source: To create the new HTML files you only need do: ::
es: Para crear los nuevos archivos HTML sólo necesitas hacer: ::

source: If you see an error indicating that HTML cannot be built, the most likely cause is that ``python-sphinx`` is missing.
es: Si ves un error que indica que el HTML no se pudo construir, la causa más probable es que falte ``python-sphinx``.

source: To fix this, in Terminal Activity (or any terminal emulator) as root, ::
es: Para solucionar este problema, en la Actividad Terminal (o cualquier emulador de terminal) haz como root, ::

source: or in Debian or Ubuntu derivatives, ::
es: o en derivados de Debian o Ubuntu, ::

source: In **Sugar** you don't need restart Help to see the changes after running ``make html``, you just click with the secondary mouse button, and select reload.
es: En **Sugar** no es necesario reiniciar Ayuda para ver los cambios después de ejecutar ``make html``, basta con hacer clic con el botón secundario del ratón y selecciona recarga.

source: In any other, non-Sugar, Linux environment the command ``git clone git@github.com:godiard/help-activity.git`` works to download the sources, ``./setup.py dev`` should be omitted, and the output of ``make html`` is in ``~/help-activity/html``, and is displayed by opening ``~/help-activity/html/index.html`` in a browser.
es: En cualquier otro ambiente distinto a Sugar, Linux el comando `` git clone git@github.com:godiard/help-activity.git`` funciona para descargar el código fuente,``./setup.py dev`` debe omitirse, y la salida de `` make html`` está en ``~/help-activity/html``, y se muestra al abrir `` ~/help-activity/html/index.html`` en un navegador.

source: What if I break Help?
es: ¿Qué pasa si rompo ayuda?

source: In Sugar you cannot break Help. If you start to follow these instructions and get lost or make a mistake, and Help will not display correctly, you should not worry.
es: En Sugar no se puede romper Ayuda. Si comienzas a seguir estas instrucciones y te pierdes o cometes un error, y Ayuda no se muestra correctamente, no debes preocuparte.

source: First back up any files.rst you have already made, then visit `ASLO <http://activities.sugarlabs.org>`_ with Browse. Search for Help, and download and install a new copy of XO Help.
es: Primero haz una copia de seguridad de los archivos .rst que ya haz hecho, a continuación, visita `ASLO <http://activities.sugarlabs.org> `_ con Navegar, búsca Ayuda y descarga e instala una nueva copia de XO Ayuda.

source: Alternatively, experienced users might make a backup .xo before starting to work by doing: ::
es: Alternativamente, los usuarios experimentados pueden hacer una copia de seguridad. del .xo antes de comenzar a trabajar haciendo: ::

source: This will create a directory dist and inside, an .xo file.
es: Esto creará un directorio dist y en el interior, un. archivo .xo.

source: Tutorial 0 - Browse filesystem
es: Tutorial 0 - Explorar sistema de archivos

source: In Browse and some other browsers if you type ::
es: En Navegar y algunos otros navegadores si escribes ::

source: in the address bar, you will be browsing the root of your file system.
es: en la barra de direcciones, estarás navegando la raíz del sistema de archivos.

source: Now move progressively through ::
es: Ahora muevete progresivamente a través ::

source: You are now able to open and inspect any of the *source_files.rst* safely.
es: Ahora eres capaz de abrir e inspeccionar cualquiera de los *archivos fuentes .rst* en forma segura.

source: We can back off again and reach ::
es: Podemos retroceder de nuevo y llegar ::

source: and then select and display any of the output HTML files.
es: y luego seleccionar y mostrar cualquiera de los archivos HTML de salida.

source: In this page we use the convention of calling ``/home/your-username/help-activity/source`` by the shorter, ``~/help-activity/source``.
es: En esta página se utiliza la convención de llamar ``/home/tu-nombre/help-activity/source`` por el más corto, ``~/help-actividad/source``.

source: Orientation
es: Orientación

source: **Source**
es: **Fuentes**

source: The two source folders we look at are filled initially by the download of Help.
es: Las dos carpetas de origen que miramos se llenan inicialmente por la descarga de Ayuda.

source: The directory ``~/help-activity/source/`` contains the text files we will be altering in this guide.
es: El directorio ``~/help-activity/source/`` contiene los archivos de texto que vamos a alterar en esta guía.

source: The directory ``~/help-activity/images/`` contains all the images that are used on the various pages of Help. You can add image files to this folder, and if they are linked into documents, they will display in the *output* of the command ``make html``.
es: El directorio ``~/help-activity/images/`` contiene todas las imágenes que se utilizan en las distintas páginas de Ayuda. Puedes agregar archivos de imagenes a esta carpeta, y si están vinculados a documentos, se mostrarán en la *salida* de la orden ``make html``.

source: In Sugar you have the ability to inspect the source files safely, using the :ref:`View source` button on the Help icon in the Frame.
es: En Sugar usted tiene la capacidad de inspeccionar los archivos de origen de forma segura, utilizando el boton :ref:`View source` en el icono Ayuda en el Marco.

source: The key page in navigating Help is the Index or contents page. In the ``~/help-activity/source/`` folder, `index.rst` is the text document which automatically provides links to all other pages in the source folder.
es: La página clave en la navegación de Ayuda es la página de índice o de contenidos. En la carpeta ``~ /help-activity/source// ` el archivo, ` `índex. rst` es el documento de texto que proporciona automáticamente los enlaces a todas las otras páginas de la carpeta de origen.

source: **Output**
es: **Salida**

source: The pages displayed in Help are the output of the command ``make html``. The files are in the folder ``~/help-activity/html/``.
es: Las páginas mostradas en la Ayuda son el resultado del comando ``make html``. Los archivos están en la carpeta ``~/help-activity/html/``.

source: Also part of the output of the command ``make html`` are the files in ``~/help-activity/doctrees/``. The role of the ``all_files.doctree`` is to interlink all the HTML pages within the rules of the underlying software.
es: También forman parte de la salida de la orden ``make html`` los archivos de ``~/help-activity/doctrees/ ``. El papel de los `` archivos ``all_files.doctree`` es conseguir la interconexión de todas las páginas HTML dentro de las reglas del software subyacente.

source: Depending on the setup of your installation there may be a number of other folders present in the ``~/help-activity/html/`` folder (for instance ``_sources``, ``_static``, and ``_images``). These are also *output files*, they could be regarded as hidden folders, and should not be edited.
es: Dependiendo de la configuración de su instalación puede haber un número de otras carpetas presentes en el directorio ~/help-activity/html/ carpeta (por ejemplo ``_sources``, ``_static``, e ``_images``). Estos son también *archivos de salida*, podrían ser considerados como carpetas ocultas, y no deben ser editados.

source: You can just write a page in simple text, perhaps with some explanatory pictures or screen-shots. Screen-shots are made in Sugar from the keyboard, by pressing the "Alt" key and 1.
es: Puedes escribir una página en texto simple, tal vez con algunas imágenes explicativas o fotografías de pantalla. Las instantáneas de pantallas se hacen en Sugar desde el teclado, pulsando la tecla "Alt" y 1.

source: The page :doc:`/restructuredtext` gives some guidance on the features of the markup language we use. Do not be concerned with complex features, plain, simply written text will be of most use to new learners.
es: La página :doc:`/restructuredtext` da una orientación sobre las características del lenguaje de marcas que utilizamos. No te preocupes con características complejas, texto plano, simplemente escrito será de mayor utilidad para los nuevos estudiantes.

source: You will have your own ideas about what you would like to change and contribute. When you explain anything, which you have struggled to learn, it is likely to be of use to others. Seeing your work published gives quite a buzz!
es: Tendrás tus propias ideas acerca de lo que te gustaría cambiar y contribuir. Cuando expliques algo, que hayas tenido problemas para aprender, es probable que sea de utilidad para otros. Al ver tu trabajo publicado da una gran alegría!

source: Here are a few exercises, which demonstrate making changes, and making pages.
es: Aquí hay algunos ejercicios, que demuestran como realizar cambios, y hacer páginas.

source: Tutorial 1 - Make a page
es: Tutorial 1 - Hacer una página

source: We are going to make a fresh page in reStructuredText. It will not at first be connected to the index, or contents page, of Help.
es: Vamos a hacer una nueva página en reStructuredText. Al principio no estará conectado al índice o página de contenidos, de Ayuda.

source: Open a new file in any text editor.
es: Abre un nuevo archivo en cualquier editor de texto.

source: Save the file with the name ``my_first.rst`` in ``~/help-activity/source``. Type some text onto the page. In order to give the page a title we put a line of "=" "equal" signs above and below the title like this. Leave a line of white space, then type some text. This is an example:
es: Guarda el archivo con el nombre de ``my_first.rst`` en ``~/ help-actividad/source``. Escribe algún texto en la página. Con el fin de dar a la página un título ponemos una línea de "=" "signos de igualdad" por encima y por debajo del título como este. Deja una línea de espacio en blanco, a continuación, escribe algún texto. Este es un ejemplo:

source: Now we want to convert our little page of text into an attractive page of Help. Open Terminal Activity (or any terminal emulator) and type,
es: Ahora queremos convertir nuestra página de texto en una página atractiva de Ayuda. Abre la Actividad Terminal (o cualquier emulador de terminal) y tipéa,

source: There will be about ten lines of output, there will be mention of errors. Read the error trace, expect to see an error line like the one below, but the final two lines here report a success.
es: Habrá cerca de diez líneas de salida, habrá una mención a los errores. Leer la traza de error, esperan ver una línea de error como la de abajo, pero las dos últimas líneas reportarán un éxito.

source: The warning, "WARNING: document isn't included in any toctree" is telling us the document is not linked into the Help index yet.
es: La advertencia, "WARNING: document isn't included in any toctree" nos está diciendo que el documento no está vinculado al Índice de ayuda aún.

source: Tutorial 2 will fix this. It does exist and you could see what it looks like if you can find it as described above with a browser in ``~/help-activity/html``.
es: Tutorial 2 solucionará el problema. Ya existe y se puede ver como luce si lo puede encontrar como se describió anteriormente con un navegador en ``~/help-activity/html``.

source: Tutorial 2 - Link page to index
es: Tutorial 2 - Enlace a la página índice

source: Backup your index file. Open Terminal Activity (or any terminal emulator) and type,
es: Haz una copia de seguridad de tu archivo de índice. Abre Actividad Terminal (o cualquier emulador de terminal) y tipéa,

source: Above, we have changed directory into help-activity, changed directory into source, and copied ``index.rst`` to a new file named ``index.rst.ori``
es: Aqui, hemos cambiado al directorio help-activity, cambiado de directorio a source, y copiado ``index. rst`` en un nuevo archivo llamado ``index.rst.ori``

source: Before proceeding make sure you are familiar with how to restore your index from the backup, in case you damage your Help index.
es: Antes de proceder asegúrate de que estas familiarizado con la forma de restaurar el índice desde la copia de seguridad, en caso de que se causara daños en el índice de Ayuda.

source: Open ``~/help-activity/source/index.rst`` with a text editor. Notice the line spacing (lines of white space especially) and indents. They are very important to maintain.
es: Abre ``~/help-activity/source/index.rst`` con un editor de texto. Observa el espacio entre líneas (líneas de espacio en blanco en especial) y guiones. Es muy importantes mantenerlos.

source: Scroll down ``index.rst`` right to the bottom of the page. Put the cursor at the front of the last line. Using the arrow keys you will see that the indent is 4 "spaces", it is not "Tab".
es: Desplácese hacia abajo en ``index.rst`` derecho a la parte inferior de la página. Ponga el cursor en la parte delantera de la última línea. Usando las flechas, verá que el guión es de 4 "espacios", no es "Tab".

source: Put the cursor at the end of the last line. Press *Enter*, press space bar 4 times, and enter the file name you used above ``my_page.rst``. Use "Enter" and the space bar so that you exactly copy the indentation, and line spacing as used in the other entries.
es: Ponga el cursor al final de la última línea. Pulse *Ingresar*, presione la barra espaciadora 4 veces, y escriba el nombre de archivo que utilizó `` my_page.rst``. Utilice "Ingresar" y la barra de espacio para que se copia exactamente la sangría y espaciado de línea que se utiliza en el resto de entradas.

source: Double check your changes to ``index.rst`` and save your changes.
es: Vuelve a comprobar tus cambios ``index.rst`` y guardar los cambios.

source: Now we want to convert our index into HTML. Open Terminal Activity (or any terminal emulator) and type,
es: Ahora queremos convertir nuestro índice en HTML. Abre la Actividad Terminal (o cualquier emulador de terminal) y tipéa,

source: The newly changed index page will now display in Help, or in your browser, once you reload the page. In Sugar you click with the secondary button, and select reload, or in a browser pointing to ``~/help-activity/html/index.html`` press the reload button. In the index, or contents page, the link to your new page can be clicked to open your page "my_page.html"
es: La página de índice recién cambiado se mostrará en la Ayuda, o en su navegador, una vez que vuelva a cargar la página. En Sugar hace clic con el botón secundario y selecciona recarga, o en un navegador que apunta a `` ~/help-activity/html/index.html`` pulse el botón de recarga. En el índice o página de contenidos, el vínculo con la nueva página se puede hacer clic para abrir la página "my_page.html"

source: Tutorial 3 - Adding an image
es: Tutorial 3 - Adición de una imagen

source: Open your existing page in any text editor, or create and "Title" a new page, and add it to the bottom of the index.
es: Abre tu página existente en cualquier editor de texto, o crea y "Títula" una nueva página, y agregala a la parte inferior del índice.

source: An image which is already in ``~/help-activity/images/`` can be included by typing this on to your page.
es: Una imagen que ya está en ``~/help-activity/images/`` se puede incluir escribiendo esto en tu página.

source: The "reference line" above needs a line of white space, above and below it.
es: La "línea de referencia" anterior necesita una línea de espacio en blanco, por encima y por debajo de ella.

source: You can add an image file in .jpg or .png format to ``~/help-activity/images/``. It is best if the image does not exceed 800 pixels in width. It can be difficult to read around tall images. For this reason screen-shots 600 pixels in width may be a good compromise if the content is simple.
es: Puedes agregar un archivo de imagen en formatos .jpg o .png a ``~/help-activity/images/``. Lo mejor es que la imagen no sea superior a 800 píxeles de ancho. Puede ser difícil de leer imágenes altas. Por esta razón, capturas de pantalla de 600 píxeles de ancho pueden ser un buen compromiso si el contenido es simple.

source: If you add an image file ``my_image.png``, made in, say, Paint to ``~/help-activity/images/``, then you link it into your page with:
es: Si agregas un archivo de imagen ``my_image.png``, hecha en, digamos, Pintar a ``~/help-activity/images/``, entonces enlazalo en tu página con:

source: Now we want to convert our page with an image into HTML. Open Terminal Activity (or any terminal emulator) and type,
es: Ahora queremos convertir nuestra página con una imagen en HTML. Abre la Actividad Terminal (o cualquier emulador de terminal) y tipéa,

source: The newly changed page will now display in Help, or in your browser, once you reload the page.
es: La página recién cambiada se mostrará en la Ayuda, o en tu navegador, una vez que vuelvas a cargar la página.

source: Tutorial 4 - Write or improve a Help page
es: Tutorial 4 - Escribir o mejorar una página de ayuda

source: Decide whether you want to make a page from a fresh start, you could just start writing on a subject you know about. Alternatively experiment with improving an existing page. You could work from the text of an existing page (it might be this page) or a more simple page.
es: Decide si deseas hacer una página comenzando de cero, podrías comenzar a escribir sobre un tema del que usted sabes. Alternativamente puedes experimentar con la mejora de una página existente. Podría trabajar en el texto de una página existente (que podría ser esta página) o una página más sencilla.

source: Open ``~/help-activity/source/index.rst``.
es: Abre ``~/help-activity/fuente/index.rst``.

source: Put the cursor at the end of the last line. Press *Enter*, press space bar 4 times, and enter a new file name, perhaps, ``my_second.rst``. Use "Enter" and the space bar so that you exactly copy the indentation, and line spacing as used in the other entries.
es: Pon el cursor al final de la última línea. Pulsa *Ingresar*, presiona la barra espaciadora 4 veces, e introduce un nuevo nombre de archivo, tal vez, ``my_second.rst``. Utiliza "Ingresar" y la barra de espacio para que se copie exactamente la sangría y espaciado de línea que se utiliza en el resto de las entradas.

source: Save the page as the new file name chosen above, perhaps, ``my_second.rst``.
es: Guarda la página con el nuevo nombre de archivo elegido anteriormente, tal vez, ``my_second.rst``.

source: Type in a title like this:
es: Escribe un título como este:

source: Enter your text, and save your changes.
es: Introduce el texto y guardar los cambios.

source: Now we want to convert our page into HTML. Open Terminal Activity (or any terminal emulator) and type,
es: Ahora queremos convertir nuestra página en HTML. Abre Actividad Terminal (o cualquier emulador de terminal) y tipéa,

source: The newly generated page will now display in Help, or in your browser, once you reload the page.
es: La página recién generado se mostrará ahora en la Ayuda, o en tu navegador, una vez que vuelva a cargar la página.

source: You can now go back to your page, and improve it.
es: Ahora puedes volver a la página y mejorarla.

source: Again, write the changes to HTML version, with:
es: Una vez más, escribe los cambios en la versión HTML, con:

source: You have now written your first improved page for the Activity Help. We would love it if you could share it with the Sugar community!
es: Ahora haz escrito tu primera página mejorada para la Actividad Ayuda. Nos encantaría si pudieras compartir con la comunidad de Sugar!

source: Contribute
es: Contribuir

source: Once you are familiar with editing, adding a page, and making or improving a Help page, you could make a page with the intention of having it published in the next version of Help.
es: Una vez que estés familiarizado con la edición, la adición de una página, y hacer o mejorar una página de ayuda, podrías hacer una página con la intención de que se publique en la próxima versión de Ayuda.

source: You might write a tutorial on a subject you know about.
es: Puede escribir un tutorial sobre un tema acerca del que tu sepas.
