Repository: tony37/sledhelp
Catalog: translated_po/*/how_to_help.po
Languages: es

source: In the next version of Activity Help, better "New to Sugar" pages might be included at the beginning of Help, as a quick introduction for new Sugar learners. Contributions to be considered would be welcome.
es: En la próxima versión de la Actividad Ayuda, mejores páginas "Nuevo a Sugar" podrían ser incluidos en el comienzo de Ayuda, como una introducción rápida para los nuevos estudiantes de Sugar. Contribuciones a considerar serían bienvenidas.

source: Some Activities have no easy to find instructions. If you can write even a very short introduction, it could be very useful for other Sugar learners.
es: Algunas actividades no tienen instrucciones fáciles de encontrar. Si tu puedes escribir incluso una muy breve introducción, podría ser muy útil para otros estudiantes de Sugar.

source: The Sugarlabs wiki page http://wiki.sugarlabs.org/go/Activities/Help/Contribute might have some ideas on pages, which have been requested, or which others are working on and might appreciate collaboration.
es: La página wiki http://wiki.sugarlabs.org/go/Activities/Help/Contribute podría tener algunas ideas sobre las páginas que han sido solicitadas, o en las que otros están trabajando y pudieran apreciar colaboración.

source: What to do with your finished work
es: ¿Qué hacer con su obra terminada

source: First of all you might briefly contact gonzalo at laptop dot org by e-mail to tell him what you would like to contribute. If you write a new page , you can send him the page (as my_page.rst) as an attachment to an e-mail explaining briefly what is attached. If new images are linked into the page, send them too.
es: En primer lugar usted puede ponerse en contacto brevemente con gonzalo at laptop dot org por e-mail y decirle lo que le gustaría contribuir. Si se escribe una nueva página, se le puede enviar la página (como my_page.rst) como un archivo adjunto a un e-mail explicando brevemente lo que se adjunta. Si nuevas imágenes están vinculadas a la página, envíalas también.

source: If you have improved a page, the preferred method is to submit it as a "patch".
es: Si tu haz mejorado una página, el método preferido es el de enviar como un "parche".

source: Tutorial 5 - generate a patch
es: Tutorial 5 - generar un parche

source: Let's say you decide to work on the Help page, "Switching Activities". You might back up that page before you start. Open Terminal Activity (or any terminal emulator) and type,
es: Digamos que tu decides trabajar en la página de ayuda, "Cambiando Actividades" . Puedes hacer una copia de seguridad de que la página antes de empezar. Abre la Actividad Terminal (o cualquier emulador de terminal) y tipéa,

source: Above, we have changed directory into help-activity, changed directory into source, and copied ``switching_activities.rst`` to a new file named ``switching_activities.rst.ori``
es: Aqui, hemos cambiado el directorio help-activity, cambiado al directorio de fuentes, y copiado ``switching_activities.rst`` en un nuevo archivo llamado ``switching_activities.rst.ori``

source: Make your changes to ``switching_activities.rst``. Save your changes regularly, and check by running the ``make html`` command that the page displays nicely. Once you are happy with your work, you can generate a patch like this:
es: Realiza los cambios en ``switching_activities.rst``. Guarda los cambios con regularidad, y comprobar mediante la ejecución del comando ``make html`` que se muestre la página correctamente. Una vez que estés satisfecho con tu trabajo, puedes generar un parche asi:

source: The patch can now be sent as an e-mail attachment.
es: El parche se puede enviar como archivo adjunto de correo electrónico.

source: For more information, in Terminal Activity (or any terminal emulator) type,
es: Para obtener más información, en la Actividad Terminal (o cualquier emulador de terminal) tipéa,

source: and
es: y

source: Further reading
es: Para leer más

source: |more| For more complete help on reStructuredText:
es: |more| Para obtener ayuda más completa sobre reStructuredText:

source: Quick reStructuredText, http://docutils.sourceforge.net/docs/user/rst/quickref.html, is a cheat-sheet for reStructuredText.
es: ReStructuredText rápida, http://docutils.sourceforge.net/docs/user/rst/, es una hoja de trucos para reStructuredText.

source: "reStructuredText Directives" http://docutils.sourceforge.net/docs/ref/rst/directives.html by David Goodger, March 2013.
es: "Directivas reStructuredText" http://docutils.sourceforge.net/docs/ref/rst/directives.html por David Goodger, Marzo 2013.

source: Sphinx reStructuredText Primer, http://sphinx-doc.org/rest.html, a brief introduction to reStructuredText concepts and syntax.
es: Sphinx reStructuredText Básico, http://sphinx-doc.org/rest.html, una breve introducción a reStructuredText conceptos y sintaxis.

source: Sphinx home page, http://sphinx-doc.org/index.html.
es: Página de inicio Sphinx, http://sphinx-doc.org/index.html.

source: Another tutorial, http://matplotlib.org/sampledoc/.
es: Otro tutorial, http://matplotlib.org/sampledoc/.
