Repository: tony37/sledhelp
Catalog: translated_po/*/irc.po
Languages: es

source: About
es: Acerca de

source: |IRC_icon| The IRC activity allows you to chat with other Sugar/OLPC users and enthusiasts on the Internet via Internet Relay Chat (IRC).
es: |IRC_icon| La actividad de IRC te permite chatear con otros usuarios Sugar/OLPC y entusiastas en Internet a través de Internet Relay Chat (IRC).

source: The activity defaults to a "channel" (akin to a "room") called #sugar on the Freenode network, but you can join one of the many channels available by typing /join #channel, where #channel is the channel name. Like many Free/Open Source projects, Sugar developers frequent this channel, and are happy to help with any Sugar questions and suggestions you may have.
es: La actividad por defecto te lleva a un "canal" (similar a una "habitación") llamado #sugar en la red Freenode, pero tú puedes unirte a uno de los muchos canales disponibles escribiendo /join #channel, donde #channel es el nombre del canal. Al igual que muchos proyectos de código abierto/gratuito, los desarrolladores de Sugar frecuentan este canal, y están dispuestos a ayudar con cualquier pregunta de Sugar y sugerencias que puedas tener.

source: See the Internet Relay Chat page on `this wiki <http://wiki.sugarlabs.org/go/Internet_Relay_Chat>`_ for a list of Sugar-related channels you can join.
es: Mira la página de Internet Relay Chat en `esta wiki <http://wiki.sugarlabs.org/go/Internet_Relay_Chat>`_ para una lista de canales relacionados con Sugar a los que puedes unirte.

source: Using IRC
es: El uso de IRC

source: IRC Commands
es: Comandos de IRC

source: The following commands can be typed into the input box, all preceded by a slash (/):
es: Los siguientes comandos se pueden escribir en el cuadro de entrada, todos precedidos por una barra (/):

source: /join #channel - join a channel
es: /join #channel - unirse a un canal

source: /server irc.example.org - connect to a different network
es: /server irc.example.org - para conectar a una red diferente

source: /query user - open up a private chat window with another user
es: /query user - abrir una ventana de conversación privada con otro usuario

source: /msg user message - privately message another user without opening a new window
es: /msg user message - mensaje privado a otro usuario sin necesidad de abrir una nueva ventana

source: /nick new_name - change your nickname away from the default
es: /nick new_name - cambia tu apodo del otorgado por defecto

source: Many other commands are available, and you can create and administer your own channels as well: see the `IRC FAQ <http://www.irchelp.org/irchelp/altircfaq.html>`_ for more information.
es: Muchos otros comandos están disponibles, y tú puedes crear y administrar tus propios canales así: mira el `IRC FAQ <http://www.irchelp.org/irchelp/altircfaq.html> `_ para más información.

source: Download
es: Descargar

source: Development
es: Desarrollo

source: `Git Repository <http://git.sugarlabs.org/projects/irc>`_
es: `Repositorio Git <http://git.sugarlabs.org/projects/irc> `_

source: References
es: Referencias

source: `Wiki Page <http://wiki.sugarlabs.org/go/Activities/IRC>`_
es: `Página Wiki <http://wiki.sugarlabs.org/go/Activities/IRC> `_
