Repository: tony37/sledhelp
Catalog: translated_po/*/journal.po
Languages: es

source: Journal
es: Diario

source: The Journal Activity is an automated diary of everything you do within Sugar. Sugar Activities use the Journal as a place to save your work. You can use the Journal as a place to revisit old work, to resume incomplete work, to organize your completed work, and to reflect upon your progress as a learner.
es: El Diario de actividad es un diario automatizado de todo lo que haces dentro de Sugar. Las Actividades Sugar utilizan el Diario como un lugar para guardar su trabajo. Puedes utilizar el Diario como un lugar para revisar anteriores trabajos, para reanudar un trabajo incompleto, para organizar tus trabajos terminados, y reflexionar sobre tu progreso como estudiante.

source: The Journal keeps a record of what you do and the things your create such as photos, drawings, and writings. You can search for items in the Journal or sort entries by type or date. You can also click an entry to get a detailed view. You can resume an activity by clicking on the icon for that entry.
es: El Diario mantiene un registro de lo que haces y las cosas que creas como fotos, dibujos y escritos. Puedes buscar elementos en el Diario o ordenar las entradas por tipo o fecha. También puedes hacer clic en una entrada para obtener una vista detallada. Puede reanudar una actividad haciendo clic en el icono de dicha entrada.

source: The Journal also supports external storage media such as a USB device or a SD card. When you plug a USB device into the XO, you can access the contents of the USB device using the Journal. Click the USB icon to see the content on an attached USB storage device. You can also copy information from the Journal onto removable media—such as a USB device—as a means of backing it up. If you are connected to a school server, you can access its backup system.
es: El Diario también es compatible con los soportes de almacenamiento externos, tales como un dispositivo USB o una tarjeta SD. Cuando se conecta un dispositivo USB en la XO, puedes acceder a los contenidos del dispositivo USB a través del Diario. Haz clic en el icono USB para ver el contenido de un dispositivo de almacenamiento USB conectado. Si estás conectado a un servidor de la escuela, puedes acceder a su sistema de copia de seguridad.

source: Accessing the Journal
es: Acceso al Diario

source: To show the Journal, click the Journal icon on the Frame.
es: Para mostrar el Diario, haz clic en el icono de diario en el Marco.

source: On an XO laptop, you can press the magnifying glass key in the top row of the keyboard to immediately open the Journal and search.
es: En un laptop XO, puedes pulsar la tecla de la lupa en la fila superior del teclado para abrir inmediatamente el Diario y buscar.

source: |journal| **Seen in an Activity**, this icon on the Activity toolbar (or Activity tab) allows quick access to the Journal, to add a description, or further notes to yourself about what you are going to do, or have done in that session of the Activity.
es: |journal| **Visto en una Actividad**, este icono en la barra de herramientas de actividad (o pestaña Actividad) permite un rápido acceso a el Diario, añadir una descripción, o más notas para tí mismo acerca de lo que vas a hacer o haz hecho en ese período de sesiones de la Actividad.

source: Journal features
es: Características del Diario

source: The Journal View contains a menu and a list of journal entries:
es: El Diario contiene un menú y una lista de entradas de diario:

source: 1 - Favorite star: You can mark important entries by clicking on the star icon for that entry. When you click the star icon, the star is colored in.
es: 1 - estrella de favoritos: puedes marcar las entradas importantes haciendo clic en el icono de la estrella de esa entrada. Al hacer clic en el icono de la estrella, la estrella se colorea.

source: 2 - Entry icon: Each Journal entry has an icon. The color of the icon shows who created the entry. For example, if you copy a photo from a friend, the photo's icon has your friend's colors. You can launch the Activity for the entry by clicking on the icon. A hover menu may reveal additional options. In particular, "Erase" deletes that entry from your Journal. Caution: "Erase" deletes any data associated with the entry shown. For example, if you delete an entry that shows that you installed an Activity, you delete the Activity as well.
es: 2 - icono de la entrada: Cada entrada del diario tiene un icono. El color del icono muestra quien ha creado la entrada. Por ejemplo, si copias una foto de un amigo, el icono de la foto tiene los colores de tu amigo. Puedes iniciar la actividad para la entrada haciendo clic en el icono. Un menú flotante puede revelar opciones adicionales. En particular, "Borrar" elimina dicha entrada de tu diario. Precaución: "Borrar" borra cualquier dato asociado con la entrada se muestra. Por ejemplo, si eliminas una entrada que muestra que se ha instalado una actividad, se elimina la actividad.

source: 3 - Entry name: Each entry has a name. You can edit the name by clicking it. If the Journal view is showing the contents of a removable storage device, the Linux file name is shown here, with the path and the file name extension stripped off.
es: 3 - Nombre de entrada: Cada entrada tiene un nombre. Puedes editar el nombre haciendo clic en él. Si la vista Diario está mostrando el contenido de un dispositivo de almacenamiento extraíble, el nombre de archivos de Linux se muestra aquí, con la ruta y la extensión del archivo quitados.

source: 4 - Search box: Type words in the box to search for entries that match those words. Entries are displayed when they contain all of the typed words. Comparison will be against all of: the entry name field, the description field (see "Journal detail view"), the comments field and the tag field (see "Journal detail view"). Note: A small x button at the right of the box shows that searching is being applied. To cancel your search, click on that x.
es: 4 - Cuadro de búsqueda: Tipea palabras en el cuadro para búscar entradas que coinciden con esas palabras. Se muestran las entradas cuando contienen todas las palabras escritas. La comparación se hará contra todos: el campo de nombre de la entrada, el campo de descripción (ver "Vista de detalle del Diario"), el campo de comentarios y el campo de etiqueta (consulte "Vista detalle Diario"). Nota: Un pequeño botón x en la parte derecha del cuadro se muestra cuando se está aplicando la búsqueda. Para cancelar la búsqueda, haga clic en la x.

source: 5 - Favorites view: Only shows the entries which have been marked as favorites.
es: 5 - vista de Favoritos: Sólo muestra las entradas que han sido marcadas como favoritos.

source: 6 - Type filter: You can select to have the Journal only show certain types of entries, e.g. only images or only entries associated with a specific Activity.
es: 6 - Filtro por Tipo: Puedes seleccionar que el Diario muestre sólo ciertos tipos de entradas, ej. sólo las imágenes o sólo las entradas asociadas a una actividad específica.

source: 7 - Date filter: Contains option to only show Journal entries modified within the past day, week, or month.
es: 7 - Filtro de fecha: Contiene la opción para mostrar sólo las entradas del Diario modificados en el último día, semana o mes.

source: 8 - Sorting options: You can order Journal entries by their size, creation date and modification date.
es: 8 - Opciones de orden: Puedes ordenar las entradas de diario por su tamaño, la fecha y la modificación de la fecha de creación.

source: 9 - Documents folder: To exchange files between the Journal and the underlying file system the $HOME/DOCUMENTS folder is available in the Journal. For example: If you have created an image in GIMP under GNOME and want to open it in the Paint Activity you can place it in the $HOME/DOCUMENTS folder and then can access it in the Journal.
es: 9 - Carpeta Documentos: Para intercambiar archivos entre el Diario y el sistema de archivos subyacente la carpeta $HOME/DOCUMENTOS está disponible en el Diario. Por ejemplo: Si haz creado una imagen en GIMP en GNOME y deseas abrirla en la actividad de pintura se puede colocar en la carpeta $ HOME/DOCUMENTOS y luego se puede acceder a ella en el Diario.

source: 10 - Buddy icons: If other participants joined you in this Activity, icons in their colors appear here.
es: 10 - iconos de amigos: Si otros participantes se unieron en esta actividad, iconos con sus colores aparecen aquí.

source: 11 - Elapsed time: Displays the time since the most recent change to the entry.
es: 11 - Tiempo transcurrido: Muestra el tiempo transcurrido desde el último cambio en la entrada.

source: 12 - Detail view: Click this button to see detailed information about the entry. See "Journal detail view", below.
es: 12 - Vista detallada: Haz clic en este botón para ver información detallada acerca de la entrada. Ve la sección "vista detalle del Diario", a continuación.

source: Journal Detail view
es: Vista detallada del Diario

source: The Detail view appears when you click the Detail view button for an entry. This view lets you examine and annotate the entry.
es: La Vista detallada aparece al hacer clic en el botón de vista de detalles para una entrada. Esta visión le permite examinar y anotar la entrada.

source: 1 - Back Icon: You can click anywhere in this line to return to the main Journal View.
es: 1 - Ícono volver: Puedes hacer clic en cualquier lugar de esta línea para volver a la vista principal del Diario.

source: 2 - Resume Button: You can click the Resume button to resume an Activity. A hover menu may show additional options. For example, you can resume working with an image using either the Browser or the Paint Activity.
es: 2 - Botón Reanudar: Puedes hacer clic en el botón Continuar para reanudar una actividad. Un menú flotante puede mostrar opciones adicionales. Por ejemplo, se puede reanudar el trabajo con una imagen utilizando el navegador o la actividad de pintura.

source: 3 - Copy button: You can copy a Journal entry to the clipboard (or to a removable storage device shown on the bottom edge of the Journal screen) by clicking on the Copy button.
es: 3 - Boton Copia: Puedes copiar una entrada del diario en el portapapeles (o en un dispositivo de almacenamiento extraíble que aparece en el borde inferior de la pantalla Diario) haciendo clic en el botón Copiar.

source: 4 - Duplicate button: You can duplicate a Journal entry by clicking on the Duplicate button.
es: 4 - Botón Duplicar: Puedes duplicar una entrada de diario, haz clic en el botón Duplicar.

source: 5 - Erase button: You can erase an entry by clicking the Erase button. Caution: Once you erase an entry, it cannot be restored unless you have backed up your Journal.
es: 5 - Botón Borrar: Puedes borrar una entrada haciendo clic en el botón Borrar. Precaución: Una vez que se borra una entrada, no puede recuperarse a menos que haya una copia de seguridad de su Diario.

source: 6 - Entry name: You can change the name of the entry by clicking it and typing in a new name.
es: 6 - Nombre de entrada: Se puede cambiar el nombre de la entrada haciendo clic en él y escribiendo un nuevo nombre.

source: 7 - Elapsed time: Displays the time since the most recent change to the entry.
es: 7 - Tiempo transcurrido: Muestra el tiempo transcurrido desde el último cambio de la entrada.

source: 8 - Favorites Icon: This icon indicates whether an entry has been starred as a favorite which can be done by clicking it.
es: 8 - Ícono Favoritos: Este icono indica si una entrada ha sido seleccionado como uno de los favoritos, lo que se puede hacer haciendo clic en él.

source: 9 - Thumbnail image: Each entry has a thumbnail image that is created automatically. The image show the Activity screen when the last change to the Journal entry was saved.
es: 9 - Imagen en miniatura: Cada entrada tiene una imagen en miniatura que se crea automáticamente. La imagen muestra la pantalla de la actividad cuando se guardó la última modificación de la entrada Diario.

source: 10 - Participants: Displays the XO icons of each person who participated in a shared Activity.
es: 10 - Participantes: Muestra los iconos XO de cada persona que participó en una actividad compartida.

source: 11 - Comments: Comments by the joiners will be displayed here. The comments will be from Portfolio activity and from journal share.
es: 11 - Comentarios: Comentarios de los participantes se mostrarán aquí. Los comentarios serán de las actividades Obras y Compartir Diario.

source: 12 - Tags field: You can enter search tags. Tags are keywords used to describe a journal entry so that you can find it later using the Search box. For example, if your project is for school, maybe science class, and it is a report about local flowers, you could put "science" and "flowers" as the tags. You can write as many tags as you wish. You can also use keywords to help you "group" this entry, for instance by origin or context.
es: 12 - Etiquetas: Puedes introducir etiquetas de búsqueda. Las etiquetas son palabras clave utilizadas para describir una entrada de diario para que se pueda encontrar en otro momento, utilizando el cuadro de búsqueda. Por ejemplo, si tu proyecto es para la escuela, tal vez la clase de ciencias, y se trata de un informe sobre las flores locales, se podría poner "ciencia" y "flores" como etiquetas. Puede escribir tantas etiquetas como desees. También puedes utilizar palabras clave para ayudarle a "agrupar" entradas, por ejemplo, por origen o contexto.

source: 13 - Description field: You can type a description of the entry, which you can find later using the Search box. Use a description to remind you of what you did. For example: "Flowers I saw on the hike to the waterfall". Or you can reflect on your work and process: what I have done; how I have done it; and how successful these efforts have been. "This was not easy, but I learned a lot about different types of flowers in my community by speaking with my family". This is important because these description can be shown in the reflection Activity called "Portfolio".
es: 13 - Campo Descripción: Puedes escribir una descripción de la entrada, que se puede encontrar más adelante usando el botón Buscar. Utilize una descripción para recordar lo que hiciste. Por ejemplo: "Las flores que vi en la caminata a la cascada". O puedes reflexionar sobre tu trabajo y proceso: lo que haz hecho; cómo lo haz hecho; y el éxito obtenido con estos esfuerzos. "Esto no fue fácil, pero he aprendido mucho acerca de los diferentes tipos de flores en mi comunidad hablando con mi familia". Esto es importante porque ésta descripción se puede mostrar en la actividad de reflexión denominado "Obras".

source: When resuming from the Detail View, you can choose among different Activities.
es: Al reiniciar desde la vista de detalles, puedes elegir entre diferentes actividades.

source: Using removable media
es: El uso de medios extraíbles

source: When you insert removable media—such as a USB device or SD card—it appears as an icon on the bottom edge of the main Journal view.
es: Cuando insertas media removible como un dispositivo USB o una tarjeta SD aparece un ícono en la parte inferior de la vista principal del Diario.

source: Journal: Click the Journal icon to shows the Journal View.
es: Diario: Haz clic en el icono de diario para mostrar el Diario.

source: Documents folder: Click the Documents icon to show the contents of
es: Carpeta Documentos: Haz clic en el icono de documentos para mostrar su contenidos

source: USB device: Click the USB icon (or SD icon) to show the removable-media file system.
es: Dispositivo USB: Haz clic en el icono de USB (o icono SD) para mostrar el sistema de archivos de los medios extraíbles.

source: You can drag entries from the Journal onto the Documents folder or removable media (and vice-versa)
es: Puedes arrastrar las entradas del Diario a la carpeta Documentos o medios extraíbles (y viceversa)

source: To remove (unmount) the external file system, choose Remove on the hover menu.
es: Para extraer (desmontar) el sistema de archivos externo, elija Quitar en el menú flotante.

source: Caution: It may take time for the hover menu to appear. It is easy to make a mistake and click the icon itself when you intended to click Unmount.
es: Precaución: Puede tomar tiempo para que aparezca el menú flotante. Es fácil cometer un error y hacer clic en el icono cuando pretendes hacer clic en Desmontar.

source: Caution: If you have a Terminal running you may inadvertently have your removable media locked. The safest way to remove media is after powering off your computer.
es: Precaución: Si tienes un terminal corriendo sin darse cuenta puedes tener sus medios extraíbles bloqueado. La mejor forma de quitar los medios es después de apagar tu ordenador.

source: Sending Journal Entries via a Network
es: Envío de entradas del Diario a través de una red

source: The Journal allows you to send entries to other people who are using Sugar via a network. In order to do this the receiving user has to be registered as a friend in the Neighborhood View and be online. It does not matter whether the laptops are connected via the Mesh-network, an Ad-Hoc network, an access point, or a server.
es: El Diario te permite enviar las entradas a otras personas que están utilizando Sugar a través de una red. Para hacerlo, el usuario beneficiario tiene que estar registrado como un amigo en la Vista Vecindario y estar en línea. No importa si las computadoras portátiles se conectan a través de la red de malla, una red Ad-Hoc, un punto de acceso o un servidor.

source: Note to parents and teachers
es: Nota para los padres y maestros

source: The Journal keeps a record of everything a child does within Sugar: which Activities they use and what content they create. It also keeps a record of group Activities, such as participation in a shared Write or Browse session. The Journal encourages reflection. You can refer to it to assess a child's progress, much in the spirit of "portfolio" assessment. In order to further support this reflection, Sugar offers a Portfolio Activity, an assessment tool that utilizes the journal content. You can reflect on you work: what I have done; how I have done it; and how successful these efforts have been. Then you can create a multimedia presentation to share with your peers, teachers, and parents who can also reflect in return.
es: El Diario mantiene un registro de todo lo que hace un niño dentro de Sugar: Actividades que utilizan y contenido que crean. También mantiene un registro de actividades en grupo, como la participación en una escritura compartida o una sesión de Navegar. El Diario fomenta la reflexión. Puede referirse a el para evaluar el progreso del niño, en el espíritu de la evaluación de un "portafolio de obras". Con el fin de seguir apoyando esta reflexión, Sugar ofrece una Actividad Obras, una herramienta de evaluación que utiliza el contenido del Diario. Puedes reflexionar sobre tu trabajo: lo que haz hecho; cómo lo haz hecho; y el éxito han tenido estos esfuerzos. A continuación, puedes crear una presentación multimedia para compartir con tus compañeros, maestros y padres de familia que también pueden reflexionar contigo.

source: You can also use it as a catalyst for discussion with your child or student. We encourage the use of the description field within the detail view of Journal entries as a place to annotate or comment up entries.
es: También puedes utilizarlo como un catalizador para la discusión con tu hijo o estudiante. Fomentamos el uso del campo de descripción dentro de la vista de detalle de entradas de diario como un lugar para anotar o comentar las entradas.
