Repository: tony37/sledhelp
Catalog: translated_po/*/jukebox.po
Languages: es

source: Jukebox
es: Máquina de discos

source: About
es: Acerca de

source: Jukebox is the media player to play different kinds of audio and video files including online streams. It also supports playlists like .m3u and .pls.
es: Maquina de discos es el reproductor multimedia para reproducir diferentes tipos de archivos de audio y video, incluyendo canales de música en línea. También es compatible con listas de reproducción como .m3u y .pls.

source: Where to get Jukebox
es: Dónde obtener Maquina de discos

source: Jukebox is included in the standard releases of the OLPC software. If for some reason Jukebox is not installed, it can be downloaded from its `Activity page <http://activities.sugarlabs.org/en-US/sugar/addon/4045>`_
es: Maquina de discos está incluido en las versiones estándar del software OLPC. Si por alguna razón Maquina de discos no está instalado, se puede descargar desde la página de la `Actividad <http://activities.sugarlabs.org/en-US/sugar/addon/4045 `_

source: Using
es: Uso

source: Across the lower area, you can see the videos and if being the corresponding option checked will also appreciate the playlist, and at the top, there are options to control the flow, and how to view the current track
es: Al otro lado de la zona inferior, se pueden ver los videos y si la opción correspondiente es comprobada también podrás apreciar la lista de reproducción, y en la parte superior, hay opciones para controlar el flujo, y la forma de ver la pista actual

source: The Toolbars
es: Las barras de herramientas

source: Expand visual options.
es: Ampliar las opciones visuales.

source: Load news tracks.
es: Cargar nuevas pistas.

source: Remove actual track.
es: Retirar pista actual.

source: Previous track.
es: Pista anterior.

source: Play/Pause actual track.
es: Reproducir/Pausar pista actual.

source: Next track.
es: Siguiente pista.

source: Control the track progress
es: Controlar el progreso de la pista

source: The Toolbar Sub Menus
es: La barra de herramientas secundaria del Menú

source: Show/Hide the playlist
es: Mostrar/Ocultar la lista de reproducción

source: Fullscreen mode/Normal mode
es: Modo de pantalla completa/modo normal

source: More about Jukebox
es: Más sobre Máquina de discos

source: If you open more than one media file, Jukebox will save a "play list" with all the files you selected. Then you can create list by topics, and open all the files later just selecting the list saved in your Journal.
es: Si abre más de un archivo multimedia, Máquina de discos va a guardar una "lista de reproducción" con todos los archivos que haz seleccionado. A continuación, puedes crear una lista de temas, y abrir todos los archivos más tarde sólo seleccionando la lista guardada en el Diario.

source: You can open files located in external devices like a usb device, from Jukebox, without copying them in the Journal, that is really useful if the files are too big.
es: Puedes abrir los archivos ubicados en dispositivos externos como un dispositivo USB, de Máquina de discos, sin copiarlos en el Diario, lo cual es realmente útil si los archivos son demasiado grandes.
