Repository: tony37/sledhelp
Catalog: translated_po/*/keyboard.po
Languages: es

source: Keyboard
es: Teclado

source: The Keyboard and Touchpad
es: El teclado y el touchpad

source: TODO: <We should have a picture of 1.5 rather than 1.0>
es: TODO: <Debemos tener una imagen de 1.5 en lugar de 1.0>

source: The keyboard and touchpad—which are dust and water resistant—have special keys for additional functionality. Keyboards are designed for each country, so your keyboard may not look exactly like the one in this figure. Keys outlined in yellow are reserved for future features (such as the "grab" keys and the "slider bar").
es: El teclado y touchpad -que son resistentes a polvo y agua- tienen teclas especiales para funciones adicionales. Los teclados están diseñados para cada país, por lo que tu teclado puede que no se vea exactamente como el está en esta imagen. Las teclas señaladas en amarillo están reservadas para futuras características (tales como las teclas de "agarrar" y la "barra de desplazamiento").

source: Escape key -- The escape key is labeled with an × symbol on a black circle. The escape key is most commonly used in combination with the control key to quit activities (ctrl + esc).
es: Tecla de escape -- La tecla de escape está etiquetada con una x o un círculo negro. La tecla de escape es más comúnmente utilizada en combinación con la tecla de control para salir de actividades (CTRL + ESC).

source: Tab key -- The tab key is labeled with arrows pointing right and left. The tab key—in addition to its standard use—is used in combination with the control, shift and alt keys to cycle through open Activities. For example, alt + tab cycles forward through running Activities.
es: Tecla Tab - La tecla de tabulación está marcado con flechas apuntando hacia la derecha y la izquierda. La tecla de tabulación -además de su uso estándar- es usada en combinación con las teclas de Control, Shift y Alt para moverse a través de las actividades abiertas. Por ejemplo, ALT + TAB te mueven hacia delante a través de las actividades abiertas.

source: Control key -- The control key is used in combination with other keys to issue commands. For example, ctrl + c is used to copy to the clipboard; ctrl + v is used to paste from the clipboard.
es: La tecla de control - La tecla de control se usa en combinación con otras teclas para ejecutar comandos. Por ejemplo, Ctrl + C se utiliza para copiar al portapapeles; ctrl + v se utiliza para pegar desde el portapapeles.

source: Shift key -- The shift key is used in combination with other keys as a modifier, most commonly to shift between lowercase and uppercase in Latin-based alphabets.
es: La tecla Shift - La tecla de mayúsculas se utiliza en combinación con otras teclas como un modificador, más comúnmente para cambiar entre mayúsculas y minúsculas en alfabetos basados en el latín.

source: Fn key -- The function key is used in combination with other keys as a modifier. For example, fn + erase is delete; fn + up arrow is page up.
es: Tecla Fn - La tecla de función se utiliza en combinación con otras teclas como un modificador. Por ejemplo, Fn + borrar es eliminar; fn + flecha hacia arriba es la página arriba.

source: Alt key -- The alt key is used in combination with other keys to issue commands. For example, alt + enter toggles full-screen mode; alt + spacebar toggles the tray visibility. This example works in the Browse Activity but not in the Record Activity.
es: Tecla Alt - La tecla alt se utiliza en combinación con otras teclas para ejecutar comandos. Por ejemplo, alt + ENTER se cambia al modo de pantalla completa; alt + barra espaciadora cambia la visibilidad de la bandeja. Este ejemplo funciona en el Actividad Navegar pero no en el actividad de Registro.

source: Spacebar -- The spacebar key types a space. In the future, when used in conjunction with the function key (fn), it will eventually view the source code for the currently running Activity.
es: Barra espaciadora - La barra espaciadora tipea un espacio. En el futuro, cuando se utiliza en conjunción con la tecla de función (fn), eventualmente mostrará el código fuente de la Actividad actualmente en ejecución.

source: Alt Gr key -- The alt graphics key is used in combination with other keys as a modifier, most commonly to select an alternative letter or generate an accented character. The details of this functionality vary from keyboard layout to keyboard layout: for example, on the US keyboard, alt gr + j generates a € (euro sign); typing the character "a" followed by alt gr + 4 generates á.
es: Tecla Alt Gr - La tecla alt gráficos se utiliza en combinación con otras teclas como un modificador, más comúnmente para seleccionar una letra alternativos o generar un carácter acentuado.

source: Arrow keys -- The arrow keys are used for navigation; combined with the function key (fn), they are used for page up, page down, home, and end.
es: Teclas de flecha - La teclas de flecha se utilizan para la navegación; combinadas con la tecla de función (Fn), que se utilizan para navegar por la página arriba, página abajo, inicio, y el final.

source: Language key -- The language key is found on keyboard layouts that combine Latin and non-Latin scripts. It toggles between scripts, so, for example, one can switch between typing in English and Hindi with a single keystroke. (On Latin-only keyboards, the language key has been replaced by a × and ÷ key.)
es: Tecla de idioma - La tecla de idioma se encuentra en las disposiciones de teclado que combinan caracteres latinos y no latinos. Se cambia entre los modos de ingreso, por lo que, por ejemplo, se puede cambiar entre escribir en Inglés y el hindi con una sola tecla. (En teclados exclusivamente latinos, la tecla de idioma ha sido reemplazada por una tecla × y ÷)

source: Enter key -- The enter key—in addition to its standard use—is used in combination with modifier keys. For example, alt + enter toggles full-screen mode.Tecla Entrar-- La tecla entrar -además de su uso estándar- se utiliza en combinación con teclas modificadoras. Por ejemplo, alt + entrar cambia al modo de pantalla completa.
es: La tecla de borrar -- La tecla de borrar elimina el carácter detrás del cursor (retroceso). fn + borrar elimina la tecla frente a (o sobre) el cursor.

source: Frame key -- The Frame key toggles the presence of the Frame on the screen. The Frame is the black border around the screen that holds the Activity taskbar, clipboard, wireless connections, battery level, and so on.
es: Tecla de marco - La tecla de marco alterna la presencia del marco de la pantalla. El marco es el borde negro alrededor de la pantalla que contiene la Actividad, barra de tareas, el portapapeles, conexiones inalámbricas, nivel de batería, etc..

source: Volume controls -- The volume keys lower and raise the audio level.
es: Los controles de volumen - Las teclas de volumen bajan y elevan el nivel de audio.

source: Brightness controls -- The brightness keys lower and raise the brightness of the screen backlight. To turn the backlight off completely may take 7-8 button presses.
es: Controles de brillo - Las teclas de brillo bajan y aumentan el brillo de la retroiluminación de la pantalla. Para encender la luz por completo puede tardar 7-8 pulsaciones de botón.

source: View keys -- The four view keys, from left to right, take you to the Neighborhood view, the Group view, the Home view, and the Activity view.
es: Las teclas de vistas -- Las cuatro teclas de vista, de izquierda a derecha, te llevan a la vista de vecindario, la vista de grupo, la vista de inicio, y la vista de Actividad.

source: Search key -- The search key takes you directly to the Journal and places the text cursor in the search box.
es: Tecla de búsqueda - La tecla de búsqueda te lleva directamente al Diario y coloca el cursor de texto en el cuadro de búsqueda.
