Repository: tony37/sledhelp
Catalog: translated_po/*/labyrinth.po
Languages: es

source: Labyrinth
es: Mapas mentales

source: About
es: Acerca de

source: |Laby_ico| Labyrinth is a lightweight mind-mapping activity based on an Open Source project called Labyrinth. It allows creating mind maps from a mixture of text, freehand drawings, and images from your Journal. There is an infinite sized canvas for your map that can be panned and zoomed while you work. Maps can be "Kept to PDF" for uploading to web sites, sharing, and printing by others who may not be using Sugar.
es: |Laby_ico| Mapas mentales es una actividad de mapas mentales simples basados en un proyecto de código abierto llamado Labyrinth. Permite la creación de mapas mentales de una mezcla de texto, dibujos a mano alzada, y las imágenes de tu Diario. Hay un lienzo de tamaño infinito para tu mapa que puedes hacer zoom y recorrer mientras trabaja. Los mapas pueden ser "Kept to PDF" para subir a sitios web, compartir, y ser impresos por otras personas que no puedan estar usando Sugar.

source: Gallery
es: Galería

source: Keyboard Shortcuts
es: Atajos de teclado

source: Esc deselects thought, stops editing current text though
es: Esc anula la selección de pensamiento, se detiene la edición de texto actual

source: Ctrl + A select all thoughts
es: Ctrl + A selecciona todos los pensamientos

source: Ctrl + E for Edit mode (bounding box selections, and allows editing of existing thoughts)
es: Ctrl + E para el modo de edición (que limita selecciones del cuadro, y permite la edición de pensamientos existentes)

source: Ctrl + T for text thought mode (click canvas, or click and drag, to add new thoughts)
es: Ctrl + T para el modo de pensamiento de texto (haz clic en el lienzo, o haz clic y arrastra, para agregar nuevos pensamientos)

source: Ctrl + D for drawing mode (click canvas, or click and drag, then draw inside thought boundary)
es: Ctrl + D para el modo de dibujo (haz clic en el lienzo, o haz clic y arrastra, luego dibuja dentro de los límites del pensamiento)

source: Ctrl + I for image add mode (click canvas, or click and drag, use Journal object picker to select image)
es: Ctrl + I para el modo añadir imagen (haz clic en el lienzo, o haz clic y arrastra, utiliza el seleccionador de objetos del Diario para seleccionar la imagen)

source: Ctrl + L to link two or more selected thoughts
es: Ctrl + L para enlazar dos pensamientos o más seleccionados

source: ERASE to erase one or more selected thoughts
es: Borrar para eliminar uno o más pensamientos seleccionados

source: Ctrl + + to zoom in
es: Ctrl + + para hacer zoom

source: Ctrl + - to zoom out
es: Ctrl + - para disminuir el zoom

source: Ctrl + 9 zoom to fit window
es: Ctrl + 9 zoom ajustado a la ventana

source: Ctrl + 0 for original zoom size
es: Ctrl + 0 para el tamaño de zoom original

source: Alt + Enter to toggle full screen
es: Alt + Entrar para activar la pantalla completa

source: Ctrl + Q or Alt + Esc to stop the activity
es: Ctrl + Q o Alt + Esc para detener la actividad

source: Mouse/Trackpad shortcuts
es: Atajos de ratón/trackpad

source: Single click on the canvas with left button in text/drawing/image mode to create a thought
es: Un solo clic en el lienzo con el botón izquierdo en el modo texto/dibujo/imagen para crear un pensamiento

source: Drag with left button in text/drawing/image mode to create a thought of a specific size
es: Arrastra con el botón izquierdo en el modo texto/dibujo/imagen para crear un pensamiento de un tamaño específico

source: Single click left button to select an existing thought (typing will append to the thought text)
es: Un solo clic con el botón izquierdo para seleccionar una idea existente (lo tipeado se anexará al texto del pensamiento)

source: Double click left button to select a thought and begin editing the text content (all thought text starts selected)
es: Doble click de botón izquierdo para seleccionar un pensamiento y comenzar a editar el contenido del texto (todo el texto del pensamiento comienza seleccionado)

source: Hold shift and left click thoughts to make multiple selections
es: Mantén Shift y haz clic izquierdo sobre los pensamientos para hacer selecciones múltiples

source: Hold 'hand' key on XO keyboard and use left button to drag the canvas to pan/scroll
es: Mantén la tecla "mano" en el teclado XO y utiliza el botón izquierdo para arrastrar el lienzo horizontal o verticalmente

source: Hold right button to drag individual thoughts
es: Mantén pulsado el botón derecho para arrastrar pensamientos individuales

source: When in drawing mode, hold Shift and draw to erase
es: En el modo de dibujo, mantén Shift y dibuja para borrar

source: Review
es: Revisión

source: Resources
es: Recursos

source: `Activity Library Page <http://activities.sugarlabs.org/en-US/sugar/addon/4078>`_
es: `Página de descarga de la actividad <http://activities.sugarlabs.org/en-US/sugar/addon/4078> `_

source: `Source <http://git.sugarlabs.org/projects/labyrinth>`_
es: `Fuente <http://git.sugarlabs.org/projects/labyrinth> `_

source: `Source tarball <http://download.sugarlabs.org/sources/honey/Labyrinth/>`_
es: `Archivo de fuentes <http://download.sugarlabs.org/sources/honey/Labyrinth/> `_

source: References
es: Referencias

source: `Wiki page <http://wiki.sugarlabs.org/go/Activities/Labyrinth>`_
es: `Página de Wiki <http://wiki.sugarlabs.org/go/Activities/Labyrinth> `_
