Repository: tony37/sledhelp
Catalog: translated_po/*/launching_activities.po
Languages: es

source: Launching Activities
es: Iniciando actividades

source: You can launch an Activity in four different ways:
es: Puedes iniciar una actividad de cuatro maneras diferentes:

source: Click the Activity icon in the Home View.
es: Haz clic en el icono de la actividad en la vista de inicio.

source: Resume your previous work with an Activity from the Journal.
es: Vuelve a tu trabajo previo con una actividad del Diario.

source: Join a shared Activity from the Neighborhood View.
es: Únete a una actividad compartida desde la Vista de vecindario.

source: Accept an invitation by clicking the invitation icon on the Frame.
es: Acepta una invitación haciendo clic en el icono de la invitación en el marco.

source: When you launch an Activity, its icon flashes in the middle of the screen while it loads.
es: Al iniciar una actividad, su icono parpadea en el centro de la pantalla mientras se carga.

source: Once the Activity is running, you will be placed into its Activity View.
es: Una vez que la actividad se está ejecutando, se te colocará en la vista de actividad.

source: Launching Activities from the Home view
es: Lanzamiento de Actividades en la vista de Inicio

source: To get to the Home View,
es: Para llegar a la vista de Inicio,

source: click the Home icon on the Frame |frame|
es: haz clic en el icono Inicio en el Marco |frame|

source: or press the F3 key. On the XO keyboard this key has a single dot |home_key|, and is one of the view keys |nav_buttons|.
es: o presiona la tecla F3. En el teclado XO esta tecla tiene un círculo con un punto en el centro|home_key|, y es una de las teclas de vista |nav_buttons|.

source: Then click on the icon of the activity you want to start. If you aren't sure you have the right activity, hover your cursor over the icon for a few seconds and a label will appear with the activity name.
es: Luego haz clic en el icono de la actividad que deseas iniciar. Si no estás seguro de que tienes la actividad correcta, sitúa el cursor sobre el icono durante unos segundos y una etiqueta aparecerá con el nombre de la actividad.

source: If you've run the Activity before, clicking the icon will resume with your last Journal entry. If you click the right menu button or hover the cursor over the icon for several seconds, a menu appears with other Journal entries you made with the activity, and an option to "Start new".
es: Si ya has usado la actividad antes, al hacer clic en el icono se reanudará con tu última entrada del Diario. Si haces clic en el botón de menú de la derecha o posas el cursor sobre el icono durante unos segundos, aparece un menú con otras entradas del diario que haz hecho con la actividad, y la opción de "Comenzar una nueva".

source: If you don't see the Activity's icon, click the menu icons (2) (3) to change how the Home view displays activities. Or type part of the Activity's name in the search box (1).
es: Si no ves el icono de la Actividad, haz clic en los iconos del menú (2) (3) para cambiar la forma en que la vista de Inicio muestra las actividades. O escribe parte del nombre de la actividad en el cuadro de búsqueda (1).

source: In list view mode (3) you can click the star (4) next to an Activity's name to add/remove it as a favorite. Favorite Activities appear in color in the favorites view
es: En el modo de vista de Lista (3) puedes hacer clic en la estrella (4) junto al nombre de una Actividad para añadir/quitar de favoritos. Las actividades favoritas aparecen en color en la vista de favoritos

source: If the Activity fails to start, you will be returned to Home View.
es: Si la actividad no se inicia, se te volverá a la vista de Inicio.

source: Resuming from the Journal
es: Reanudación desde el Diario

source: Click the activity's icon or click Resume on its hover menu.
es: Haz clic en el icono de la actividad o haz clic en Reanudar en su menú flotante.

source: You can also launch some journal entries in a different activity using the hover menu. For example, you can resume an image you made in the Paint activity in Etoys or Browse.
es: También puedes lanzar algunas entradas del Diario en una actividad diferente utilizando el menú flotante. Por ejemplo, puedes reanudar una imagen que haz hecho en la actividad de Pintar en Etoys o Navegar.

source: You can click the first drop-down menu in the Journal to only show certain kinds of entries or those made with a particular activity.
es: Puedes hacer clic en el primer menú desplegable en el Diario para mostrar sólo ciertos tipos de entradas o las realizadas con una actividad en particular.

source: Joining a shared Activity
es: Unirse a una actividad compartida

source: Click the icon or click an option on the hover menu.
es: Haz clic en el icono o haz clic en una opción en el menú flotante.

source: Joining an Activity by accepting an invitation
es: Forma parte de una actividad aceptando una invitación

source: Click Join in the hover menu on the Frame.
es: Haz clic en Unirse en el menú flotante en el Marco.

source: For users
es: Para los usuarios

source: Try not to open more than three Activities at one time or your speed may be reduced.
es: Trata de no abrir más de tres actividades al mismo tiempo o su velocidad puede reducirse.
