Repository: tony37/sledhelp
Catalog: translated_po/*/log.po
Languages: es

source: Log
es: Registro

source: About
es: Acerca de

source: The Log Activity allows you to troubleshoot problems with your computer. You can view the log files of Sugar and your Activities. Log files contain errors, warnings and debugging information to help you fix problems.
es: La actividad Registro te permite solucionar problemas con el ordenador. Puedes ver los archivos de registro de Suar y sus Actividades. Los archivos de registro contienen errores, advertencias e información de depuración para ayudar a solucionar problemas.

source: Using Log
es: Utilizando Registro

source: When you open Log, there are 2 panels. On the left is a list of log files. On the right, the contents of the selected file is displayed.
es: Al abrir Registro, hay 2 paneles. A la izquierda se muestra una lista de archivos de registro. A la derecha, se muestra el contenido del archivo seleccionado.

source: The list of log files is divided into sections, each representing a folder. Pressing the arrow icon a to the folder name will hide or show its contents. Items without arrows are log files. Pressing an item that does not have an arrow will display the contents of that file in the right panel.
es: La lista de los archivos de registro se divide en secciones, cada una representando una carpeta. Al pulsar el icono de la flecha a para el nombre de la carpeta se oculta o muestra su contenido. Elementos sin flechas son archivos de registro. Al pulsar un elemento que no tiene una flecha mostrará el contenido de ese archivo en el panel de la derecha.

source: There are 3 main folders in the log file list. The first is the ``.sugar`` or ``dotsugar`` folder. This contains the log files of Sugar and your Activities. The sub-folders contain backups of older logs (log files in ``.sugar`` are deleted on shutdown). The second main folder ``/var/log``. This contains system log files. These are helpful for troubleshooting issues related to your computer hardware. The last main folder is ``Other``, and contains miscellaneous log files.
es: Hay 3 carpetas principales en la lista de archivos de registro. La primera es la carpeta `.sugar`` o ``dotsugar``. Este contiene los archivos de registro de Sugar y sus Actividades. Los sub-carpetas contienen copias de seguridad de los registros más antiguos (los archivos de registro en ``.sugar`` se borran al apagar). La segunda carpeta principal es ``/var/log``. Esta contiene los archivos de registro del sistema. Estos son útiles para solucionar problemas relacionados con el hardware del equipo. La última carpeta principal es `` Other``, y contiene varios archivos de registro.

source: The ``.sugar`` folder is the first folder you should look at when troubleshooting Sugar and your Activities. The ``shell.log`` file contains errors, warnings and debugging information for the Sugar Shell. The Sugar Shell covers the home and neighborhood views, journal, frame, web services and control panel. Each activity has its own log file, named using its bundle ID. You can find an activity's bundle ID by opening view source while using the activity, clicking the ``activity`` folder and opening the ``activity.info`` file. If you open an activity for a 2nd time, a separate log file will be created, with ``-2`` added to the end of the file name. This pattern continues if you run the activity more than 2 times.
es: La carpeta ``.sugar`` es la primera carpeta que debes mirar al solucionar errores en Sugar y sus Actividades. El archivo ``shell.log`` contiene errores, advertencias e información de depuración para el Shell de Azúcar. El Shell de Sugar cubre el panel de vistas de inicio y de vecindario, el diario, el marco, servicios web y de control. Cada actividad tiene su propio archivo de registro, el nombre utilizando es su ID de paquete. Usted puede encontrar de una actividad su ID abriendo vista de fuentes durante el uso de la actividad, haga clic en la carpeta ``activity`` y abrir el archivo ``activity.info``. Si abre una actividad una segunda vez, se creará un archivo de registro separado, con `` -2`` añadido al final del nombre de archivo. Este patrón continúa si ejecuta la actividad más veces.

source: The Toolbars
es: Las barras de herramientas

source: Activity Toolbar
es: Barra de herramientas de Actividad

source: Hide/Show the list of files
es: Ocultar / mostrar la lista de archivos

source: Copy the log file
es: Copiar el archivo de registro

source: Enable/Disable word wrap. When word wrap is disabled, there is a horizontal scroll bar. When word wrap is enabled, the lines of text too long to fit on the screen are broken up.
es: Activar ajuste de línea / Desactivar. Cuando el ajuste de línea está desactivada, hay una barra de desplazamiento horizontal. Cuando el ajuste de línea está activado, las líneas de texto demasiado largo se cortan para caber en la pantalla.

source: Find and highlight text in the log file
es: Buscar y resaltar texto en el archivo de registro

source: Previous matching text
es: Texto coincidente anterior

source: Next matching text
es: Texto coincidente Siguiente

source: Delete current log file
es: Eliminar archivo de registro actual

source: Stop activity
es: Detener la actividad

source: Activity Name
es: Nombre de la actividad

source: Activity Description
es: Descripción de la actividad

source: Save log files to Journal. This packages the log files in a format that you can send over the internet. If you find a bug, you can email this package to the activity's developers so they can fix this bug. If you are filing a support ticket or bug report, you should attach this file, so the problem can be more easily diagnosed and fixed.
es: Guardar archivos de registro en el Diario. Esto empaqueta los archivos de registro en un formato que se puede enviar a través de Internet. Si usted encuentra un error, puede enviar este paquete a los desarrolladores de la actividad para que puedan corregir el error. Si usted está presentando un informe de soporte o bug (ticket), debe adjuntar este archivo, para que el problema se puede diagnosticar con mayor facilidad y arreglarse.
