Repository: tony37/sledhelp
Catalog: translated_po/*/maintaining.po
Languages: es

source: Maintenance
es: Mantenimiento

source: Maintaining your XO
es: El mantenimiento de tu XO

source: Although your XO is tough, try to keep it dry and clean. Here are some tips for taking care of it:
es: Aunque tu XO es resistente, tratar de mantenerlo seco y limpio. Estos son algunos consejos para el cuidado del mismo:

source: Carry it carefully to avoid dropping it.
es: Llévalo con cuidado para evitar que se caiga.

source: Don't step on it or sit on it.
es: No lo pises o te sientes en él.

source: If it gets dirty, wipe it with a damp cloth and dry it.
es: Si se ensucia, límpialo con un paño húmedo y sécalo.

source: Do not dip it into water. If it gets wet, such as from rain, let it dry completely before using it.
es: No lo sumerjas en agua. Si se moja, como la lluvia, deja que se seque completamente antes de utilizarlo.

source: The XO laptop has no hard drive and only two internal cables. With care it can be disassembled for repair. For added robustness, the XO's plastic walls are thicker than other laptops. Its green mesh network antennae give a better wireless connection than typical laptops. Plus, they double as external covers for the USB ports, which are protected internally as well. Internal bumpers protect the screen display by cushioning it.
es: La laptop XO no tiene disco duro y tiene sólo dos cables internos. Con cuidado que se puede desmontar para su reparación. Para mayor robustez, las paredes de plástico de la XO son más gruesos que en otros portátiles. Sus antenas de red de malla verdes dan una mejor conexión inalámbrica que los portátiles típicos. Además, hacen las veces de las cubiertas externas de los puertos USB, los cuales están protegidos internamente. Topes internos protegen la pantalla amortiguandola.

source: Sometimes, It happens that the keys you are pressing appear somewhat dark shade of green or somewhat blackish. Remember, don't keep your hand on a single key for long. And wipe it with clean cloth to clean it.
es: A veces, sucede que las teclas que estás presionando parecen tener una sombra un poco oscura de verde o algo negruzco. Recuerda, no mantengas tu mano en una sola tecla por mucho tiempo. Y limpie con un paño limpio para limpiarlo.

source: Maintenance of the XO hardware involves updating the software and firmware and keeping the case in working order. Please refer to the Support section below for information on reflashing your XO.
es: El mantenimiento del hardware XO implica la actualización del software y firmware y mantener el equipo en condiciones de funcionamiento. Por favor fíjate en la sección de soporte más abajo para obtener información sobre como actualizar tu XO.
