Repository: tony37/sledhelp
Catalog: translated_po/*/measure.po
Languages: es

source: Measure
es: Medir

source: About
es: Acerca de

source: This Activity draws a picture of the sound heard by the internal microphone or of the signal present on the microphone socket. More specifically it draws a graph of this input versus time, the input is on the vertical axis and time is on the horizontal axis. That is, the laptop functions like a machine called an oscilloscope.
es: Esta actividad grafica el sonido escuchado por el micrófono interno o la señal presente en la entrada de micrófono. Más específicamente, se dibuja un gráfico de esta entrada en función del tiempo, la entrada está en el eje vertical y el tiempo está en el eje horizontal. Es decir, el ordenador portátil funciona como una máquina llamada osciloscopio.

source: As well as graphing signal as a function of time, Measure can also graph as a function of frequency.
es: Así como gráfica la señal como una función del tiempo, puede gráficar el sonido como una función de la frecuencia.

source: The XO-1 laptop is only capable of mono input, the XO-1.5 and XO-1.75 are capable of stereo input on their microphone socket and can graph two signals at once.
es: El XO-1 sólo tiene una entrada mono, el XO-1. 5 y XO-1. 75 tienen entradas estéreo en su toma de micrófono y pueden graficar dos señales a la vez.

source: Using
es: Uso

source: Select secondary toolbar - allows the Activity's Journal entry to be renamed
es: Selecciona la barra de herramientas secundaria - permite renombrar la entrada Diario de la actividad

source: Select secondary toolbar - measurement settings
es: Selecciona la barra de herramientas secundaria - ajustes de medición

source: The selected input type - Sound (AC voltage), resistance or DC voltage
es: El tipo seleccionado de entrada - Sonido (tensión alterna), resistencia o tensión continua

source: The time scale
es: La escala de tiempo

source: Freeze the display
es: Congelar la pantalla

source: Capture sample now - saves an image of the wave in the Journal
es: Capture muestra ahora - guarda una imagen de la onda en el Diario

source: Stop - exits the Activity
es: Stop - sale de la Actividad

source: Invert - invert the display
es: Invertir - invertir la pantalla

source: Use these sliders to control the sensitivity
es: Utiliza estos controles deslizantes para controlar la sensibilidad

source: The settings that are selected
es: Los ajustes que se seleccionan

source: The secondary toolbar - measurement settings
es: La barra de herramientas secundaria - ajustes de medición

source: Sound - use this setting with the internal microphone, external microphone and external AC signals
es: Sonido - utilizar este ajuste con el micrófono interno, micrófono externo y señales de CA externos

source: Resistance sensor - use with external resistive type transducers
es: Sensor de Resistencia - utilizar con transductores de tipo resistivo externo

source: Voltage sensor - use with external sensors which generate a voltage
es: Sensor de Voltaje - utilizar con sensores externos que generan una tensión

source: Time base/frequency - graphs the signal vs. time or graphs amplitude vs. frequency
es: Base de tiempo / frecuencia - representa gráficamente la señal vs. tiempo o gráficos de la amplitud vs. frecuencia

source: Sample interval - a text file 'Measure Log' is saved to the journal, it contains one sample per interval
es: Intervalo de muestra - un archivo de texto 'Registro Medir'se guarda en el Diario, contiene una muestra por cada intervalo

source: Starts/stops saving a text file 'Measure Log' with measured values as readable text
es: Inicia / deja de guardar un archivo de texto 'Registro Medir' con los valores medidos en forma de texto legible

source: This feature is not working well in version 36, the intention is to synchronize the sample period to the waveform so that the sample will start on a rising edge or falling edge
es: Esta función no está funcionando bien en la versión 36, la intención es sincronizar el período de la muestra a la forma de onda para que la muestra se inicie en el flanco ascendente o flanco descendente

source: Applying
es: Aplicando

source: Let the children experiment with the internal microphone, try singing, whistling, musical instruments, the Tam Tam musical Activity. The Turtle Blocks Activity can generate an audio tone, see the Python Block.
es: Deja que los niños experimenten con el micrófono interno, intenta cantar, silbar, instrumentos musicales, la actividad musical Tam Tam. La Actividad Tortugarte Bloques puede generar un tono de audio, consulta el bloque Python.

source: The children should learn through guided discovery that:
es: Los niños deben aprender por descubrimiento guiado que:

source: sound is a pressure wave
es: el sonido es una onda de presión

source: the pitch of the sound is determined by the frequency or cycles per second (Hz)
es: el tono del sonido se determina por la frecuencia o ciclos por segundo (Hz)

source: the loudness of a sound is determined by the amplitude
es: la intensidad de un sonido está determinada por la amplitud

source: sounds contain multiple frequency components or harmonics
es: los sonidos contienen múltiples componentes de frecuencia o armónicos

source: the more pure sounds have less harmonics
es: los sonidos más puros tienen menos de armónicos

source: Sharing
es: Compartiendo

source: This Activity does not support sharing.
es: Esta actividad no admite compartir.

source: Extending
es: Extendiendo

source: Measure is able to take input from a wide range of external sensors including switches, photocells, temperature sensors, inductive loops, hall effect sensors, soil probes and many more.
es: Medir es capaz de tomar la entrada de una amplia gama de sensores externos, incluyendo interruptores, fotocélulas, sensores de temperatura, bucles inductivos, sensores de efecto Hall, sondas de suelo y muchos más.

source: Care should be taken not to exceed the allowable input voltage:
es: Se debe tener cuidado para no exceder la tensión de entrada permitida:

source: XO-1 -0.5 V to 5 V
es: XO-1 -0.5 V a 5 V

source: XO-1.5 -6 V to +9 V
es: XO-1.5 -6 V a 9 V

source: XO-1.75 -6 V to +9 V
es: XO-1.75 -6 V a 9 V

source: It is a good idea, particularly on the XO-1, to put a resistor of 680 ohms in the phono plug, this increases the allowable input voltage range.
es: Es una buena idea, sobre todo en la XO-1, poner una resistencia de 680 ohmios en la clavija del microfono, esto aumenta el rango de tensión de entrada permitida.

source: You can find ideas for fun science experiments at http://wiki.sugarlabs.org/go/Activities/TurtleArt/Using_Turtle_Art_Sensors and http://wiki.laptop.org/go/Measure
es: Puede encontrar ideas para experimentos científicos divertidos en http://wiki.sugarlabs.org/go/Activities/TurtleArt/Using_Turtle_Art_Sensors y http://wiki.laptop.org/go/Measure
