Repository: tony37/sledhelp
Catalog: translated_po/*/musickeyboard.po
Languages: es

source: Music Keyboard
es: Teclado musical

source: About
es: Acerca de

source: This activity display a piano keyboard in the screen and can be used to play music selecting sounds from different instruments. In devices with touch screen, can be used touching the screen, in devices without one, the laptop keyboard can be used.
es: Esta actividad muestra un teclado de piano en la pantalla y se puede utilizar para reproducir música seleccionando sonidos de diferentes instrumentos. En los dispositivos con pantalla táctil, se puede utilizar tocando la pantalla, en los dispositivos sin uno, el teclado del ordenador portátil se puede utilizar.

source: The piano widget trigger events for every key pressed/released, and is designed to be easily included in other activities.
es: El piano utiliza eventos para las pulsaciones / liberacion de teclas, y está diseñado para ser fácilmente incluido en otras actividades.

source: How to use Music Keyboard
es: Cómo utilizar teclado de la música

source: By clicking on the small "Q" at the top of the screen, the user can set the on-screen keyboard to show the letters and numbers of the corresponding notes on the QWERTY keyboard. This is very helpful for XOs without a touch screen. It should help eliminate the confusion children who have had piano lessons encounter when, for example, the Qwerty C key plays the musical note of E or the Qwerty B key plays the musical note of G. Users can easily see the Qwerty keyboard relationship with this version running.
es: Al hacer clic en el "Q" pequeña en la parte superior de la pantalla, el usuario puede configurar el teclado en pantalla para mostrar las letras y números de las notas correspondientes en el teclado QWERTY. Esto es muy útil para las XO sin una pantalla táctil. Debe ayudar a eliminar la confusión en niños que han tenido clases de piano encuentran cuando, por ejemplo, la clave Qwerty C reproduce la nota musical de E o la tecla Qwerty B reproduce la nota musical de G. Los usuarios pueden ver fácilmente la relación teclado Qwerty con esta versión en ejecución.

source: Clicking on the next button, "DO," makes the keyboard show the solfége syllables as used in most Latin American countries and some European countries, where the 7th note in the scale is sung as "SI."
es: "Haciendo click en el siguiente boton , "DO," hace que el teclado muestre las sílabas de solfeo usadas en la mayoría de los paises de Latino América y algunos paises europeos, donde la 7ma nota en la escala es cantada como "SI."

source: For countries, such as the USA and and some European countries where the 7th note is sung as "Ti", you simply click on the "TI" button!
es: Para los países, como los EE.UU. y algunos países europeos y en el que la séptima nota se canta como "Ti", simplemente haz clic en el botón "TI"!

source: Of course, some people will want the letter names of the notes, and clicking on the "C" button will magically switch to the letter names of the notes.
es: Por supuesto, algunas personas van a querer los nombres de las letras de las notas, y haciendo clic en el botón "C" por arte de magia se cambiará a los nombres de las letras de las notas.

source: Finally, for purists (best on a touch screen) all note names can be eliminated by clicking on the "X," giving just a plain, standard keyboard.
es: Por último, para los puristas (mejor en una pantalla táctil) todos los nombres de las notas se pueden eliminar haciendo clic en la "X", dando sólo un simple, teclado estándar.

source: Other small, but important details are the inclusion of the enharmonic names of the "black" keys, for example, A# and Bb are both marked on the same key because, on a keyboard, they sound exactly the same.
es: Otros detalles pequeños, pero importantes son la inclusión de los nombres enarmónicos de las teclas "negras", por ejemplo, A# y Bb son ambos marcados en la misma tecla, ya que, en un teclado, suenan exactamente lo mismo.

source: Thirty-three instruments are available for choice, and while they don't sound exactly like the instruments they represent, they are close enough to make it interesting to try different sounds.
es: Treinta y tres instrumentos están disponibles para su elección, y mientras que no suenan exactamente igual que los instrumentos que representan, están lo suficientemente cerca para que sea interesante para probar diferentes sonidos.

source: Download
es: Descargar

source: `Activity page in our activities portal <http://activities.sugarlabs.org/sugar/addon/4654>`_
es: `Página Actividad en nuestro portal de actividades <http://activities.sugarlabs.org/sugar/addon/4654>`_

source: References
es: Referencias

source: `Wiki Page <http://wiki.sugarlabs.org/go/Activities/Music_Keyboard>`_
es: `Página Wiki <http://wiki.sugarlabs.org/go/Activities/Music_Keyboard>`_

source: Repositories
es: Repositorios

source: `The Music Keyboard repository <https://github.com/godiard/music-keyboard-activity>`_
es: `El repositorio de los fuentes del teclado musical es <https://github.com/godiard/music-keyboard-activity>`_

source: `The Tam Tam repository <https://git.sugarlabs.org/tamtam>`_
es: `El repositorio Tam Tam <https://git.sugarlabs.org/tamtam>`_

source: Note the master branch in the Tam Tam repository is where the port to Gtk3 started, but is not finished. If you want generate a usable activity, should use the branch sugar-0.94
es: Tenga en cuenta la rama principal en el repositorio Tam Tam es donde comenzó el port a gtk3, pero no se ha terminado. Si desea generar una actividad útil, debe utilizar la rama de sugar-0.94
