Repository: tony37/sledhelp
Catalog: translated_po/*/neighborhood_view.po
Languages: es

source: Neighborhood View
es: Vista Vecindario

source: Neighborhood View: Connecting to the Internet
es: Vista Vecindario: Conexión a Internet

source: You can use the Neighborhood View to connect to the Internet and to collaborate with others.
es: Puedes utilizar el Vista Vecindario para conectarte a Internet y para colaborar con los demás.

source: To see the Neighborhood View, click the Neighborhood icon on the Frame. You can also use the Neighborhood button for this purpose if your keyboard has one, or press the F1 key.
es: Para ver la Vista Vecindario, haz clic en el icono en el Marco. También puedes utilizar el botón Vecindario para este fin si tu teclado tiene uno, o pulsar la tecla F1.

source: Neighborhood Elements
es: Elementos de la vista Vecindario

source: Search menu: You can find find people, Activities, or access points (what connects you to the Internet) using the search menu.
es: Menú de búsqueda: Puede encontrar personas, actividades o puntos de acceso (que te conectan a Internet) usando el menú de búsqueda.

source: Ad-Hoc network icon: An ad-hoc network lets you connect to other computers on a network.
es: Icono de red Ad-Hoc: Una red ad-hoc te permite conectarte a otros equipos en una red.

source: Access point: WiFi hot spots (Internet access points) appear as circles in the Neighborhood view. If you hover over a circle, the name of the network appears. Each circle has another color inside, the more full the inside color, the better the connection. To connect to a network, click the circle. If the circle shows a lock symbol, expect to enter a key or password. The inside of the circle blinks while your system tries to connect. Once you are connected, an icon for the connection will appear at bottom right of the Frame. To disconnect, hover over the circle, and choose Disconnect on the menu. Or hover over the icon in the Frame, and choose Disconnect there. (OLPC XO-1 Note: The XO-1 laptop has three mesh network channels. By clicking on a mesh icon you join that particular mesh network, and disconnect from an Access point network. The other XO icons are shown will change according to who is on that network.)
es: Punto de acceso: puntos de acceso WiFi (punto de acceso a Internet) aparecen como círculos en el Vecindario. Si pasas el ratón sobre un círculo, aparece el nombre de la red. Cada círculo tiene otro color en el interior, cuanto más completo está el color en el interior, mejor será la conexión. Para conectarte a una red, haz clic en el círculo. Si el círculo muestra un símbolo de candado, espera para ingresar una clave o contraseña. El interior del círculo parpadea mientras el sistema intenta conectarse. Una vez conectado, un icono con la conexión aparecerá en la parte inferior derecha del marco. Para desconectar, coloca el cursor sobre el círculo, y selecciona Desconectar en el menú. O coloca el cursor sobre el icono en el marco, y ​​seleccione Desconectar allí. (OLPC XO-1 Nota: El portátil XO-1 tiene tres canales para la red de malla. Al hacer clic en un icono de la malla se une a esa red de malla especial, y se desconecta de un punto de acceso a la red. Los otros iconos XO que se muestran cambiarán según quién está en esa red.)

source: Shared Activities: Shared Activities appear as icons in the Neighborhood View and you can join them by clicking the corresponding icon.
es: Actividades compartidas: las Actividades compartidas aparecen como iconos en la vista de Vecindario y tu puedes unirte a ellos haciendo clic en el icono correspondiente.

source: XO icon: Other Sugar users appear as XO icons. By hovering over them, you can discover the nickname of that person and can add them as a friend or invite them to join you in a shared Activity.
es: Icono XO: Otros usuarios Sugar aparecen como iconos XO. Al pasar por encima de ellos, se puede descubrir el apodo de esa persona y puedes añadirlos como amigos o invitarlos a unirse a ti en una actividad compartida.

source: Open access point: An access point which isn't protected by a password.
es: Abrir punto de acceso: Un punto de acceso que no está protegido por una contraseña.

source: Connected networks: Once the computer has connected to a network
es: Redes conectadas: Una vez que el equipo se ha conectado a una red
