Repository: tony37/sledhelp
Catalog: translated_po/*/paint.po
Languages: es

source: Paint
es: Pintar

source: About
es: Acerca de

source: This Activity allows users to create paintings or drawings. It can also be used to edit images created by other Activities and the images it creates can be imported into some Activities.
es: Esta actividad permite a los usuarios crear pinturas o dibujos. También se puede utilizar para editar imágenes creadas por otras actividades y las imágenes que crea pueden ser importadas en algunas actividades.

source: Using
es: Uso

source: You can start a new project by selecting *Start new* from the :doc:`/home_view` or open an existing Paint project in the :doc:`/journal`. By default, when you click on Paint in Home View, you will resume your last project.
es: Puedes iniciar un nuevo proyecto seleccionando *Empezar nuevo* desde el :doc:`/home_view` o abriendo un proyecto de Pintar existente en el :doc:`/journal`. Por defecto, cuando haces clic en Paint en la vista de Inicio, reanudarás tu último proyecto.

source: Paint main tool bar
es: Barra de herramientas principal de Pintar

source: The tool bar top row contains buttons to open each of the following tabs.
es: La fila superior de la barra de herramientas contiene botones para abrir cada una de las siguientes fichas.

source: Activity tab. The Activity tab is open, and the project has been given a name.
es: Ficha de Actividad. La pestaña Actividad está abierta, y se le ha dado un nombre al proyecto.

source: Edit tab.
es: Pestaña Editar.

source: Brush properties.
es: Propiedades de pincel.

source: Brush.
es: Pincel.

source: Shapes.
es: Formas.

source: Shapes properties.
es: Propiedades de Formas.

source: Text tab.
es: Barra de Texto.

source: Images Tab.
es: Barra de Imágenes.

source: Stop, or close Activity.
es: Detener o cerrar la Actividad.

source: Explanation of tabs or tool bars in more detail.
es: Explicación de las pestañas o barras de herramientas con más detalle.

source: The Activity tab
es: Barra de Actividad

source: Activity tab. In the first field name the page or project. The Description button, the "pencil and book" icon, allows you to add a description to the :doc:`/journal` entry. Try to get in the habit of re-naming the project before you start work. Move the cursor over the existing title, click the left mouse button, and start typing a name for the project. Your new name will overwrite the original.
es: Ficha de Actividad. En el primer campo el nombre de la página o proyecto. El botón Descripción, el icono "lápiz y el libro", te permite añadir una descripción a la entrada :doc:`/ journal`. Trata de conseguir el hábito de volver a nombrar el proyecto antes de empezar a trabajar. Mueve el cursor sobre el título existente, haz clic en el botón izquierdo del ratón, y comienza a escribir un nombre para el proyecto. Tu nuevo nombre sobrescribirá el original.

source: The collaboration button is grayed out, see :ref:`Share`.
es: El botón de colaboración está en gris, ve :ref:`Share`.

source: Edit tab
es: Editar barra

source: Undo button.
es: Botón Deshacer.

source: Redo button.
es: Botón Rehacer.

source: Copy button. This will copy the area selected with the *Select Area* tool to the clipboard. The *Select Area* tool is the bottom item of the Brush tool bar.
es: Botón Copiar. Este copia el área seleccionada con la herramienta *Seleccionar Area* en el portapapeles. La herramienta *Seleccionar Area* es el punto inferior de la barra de herramienta Pincel.

source: Use the *Select Area* tool to crop images, select the area you want, and use the *Copy button* to copy the clipping to the Clipboard. The Clipboard feature is within the Frame in the lower left corner of the screen.
es: Utiliza la herramienta *Seleccione Area* para recortar imágenes, selecciona el área que quieres, y utiliza el botón *copiar* para copiar el recorte en el Portapapeles. La función del Portapapeles está dentro del cuadro en la esquina inferior izquierda de la pantalla.

source: To save from the Clipboard, click on the clipping on the Frame, and then select 'Keep' on the menu, which appears. The original image is unchanged and a new *Image clipping* item is saved in the Journal.
es: Para guardar desde el Portapapeles, haz clic en el icono del recorte en el Marco y, a continuación, selecciona 'Guardar' en el menú que aparece. La imagen original permanece sin cambios y un nuevo elemento *recorte de imagen* se guarda en el Diario.

source: To retieve from the Clipboard use the Paste button:
es: Para obtener desde el Portapapeles, utiliza el botón Pegar:

source: Paste button. The copied image, which you pick up as an *Image clipping* from the Frame, is pasted in the top left of the work space, and it is already selected, that is under the control of the *Select Area* tool, with which you drag the clipping to the desired place.
es: Botón Pegar. La imagen copiada, que recojas como un *Recorte de Imagen* del Marco, se pega en la parte superior izquierda de la zona de trabajo, y ya está seleccionada, bajo el control de la herramienta *Seleccione Area*, con la que arrastras el recorte hasta el lugar deseado.

source: Clear the work space, or clear the selected area if there is an area selected.
es: Despeja el espacio de trabajo, o borra el área seleccionada si hay un área seleccionada.

source: Brush properties
es: Propiedades de Pincel

source: Changes the color, and other properties of the Brush tools, Brush, Bucket, and Stamp.
es: Cambia el color y otras propiedades de las herramientas de dibujo, pincel, balde, y sello.

source: When the stamp tool is selected, Brush properties changes to Stamp properties and it controls the size of the stamp.
es: Cuando se selecciona la herramienta Sello, las propiedades de dibujo cambian a propiedades de sello y se controla el tamaño de la estampa.

source: Brush
es: Cepillo

source: Brush. Spreads color as you move the cursor over the work space.
es: Cepillo. Esparce color al mover el cursor sobre el espacio de trabajo.

source: Eraser. Removes color.
es: Goma de borrar. Elimina el color.

source: Bucket. This will flood, or fill, an enclosed area with color.
es: Balde. Este inundará, o rellenará, un área cerrada con el color.

source: Picker. Use this tool to pick up a certain color from the image on the work space. This colour is then used by Brush, Bucket, or Stamp.
es: Seleccionar color. Utiliza esta herramienta para recoger un determinado color de la imagen en el espacio de trabajo. Este color se utiliza luego para el cepillo, balde, o sello.

source: Stamp. Stamp will repeat a part of the image selected in Select Area.
es: Sello. El Sello repetirá una parte de la imagen seleccionada en Seleccionar área.

source: Select Area. A rectangular area is selected by placing the curson at top left of desired area, click left mouse button, draw cursor to bottom right, and release the mouse button.
es: Seleccionar Area. Un área rectangular se selecciona colocando el curson en la parte superior izquierda del área deseada, haz clic en el botón izquierdo del ratón, arrastra el cursor hacia abajo a la derecha, y suelta el botón del ratón.

source: Shapes
es: Formas

source: Elipse (hold down shift for circle).
es: Elipse (mantén presionada la tecla shift para hacer un círculo).

source: Rectangle (hold down shift for squares).
es: Rectángulo (mantén presionada la tecla shift para hacer un cuadrado).

source: Line.
es: Línea.

source: Free form.
es: Forma libre.

source: Polygon (number of sides set in Shapes properties).
es: Polígono (número de lados establecidos en propiedades de formas).

source: Heart.
es: Corazón.

source: Parallelogram.
es: Paralelogramo.

source: Arrow.
es: Flecha.

source: Star (number of points is set in Shapes properties).
es: Estrella (número de puntos que se encuentran en propiedades de formas).

source: Trapezoid.
es: Trapecio.

source: Triangle.
es: Triángulo.

source: Shapes Properties
es: Propiedades de Formas

source: The color of Shapes *Fill* is set here, while the color of the *border* is set in Brush properties. If the *Fill* box is unchecked, only an outline, or border, is displayed.
es: El color de las formas *de relleno* se establece aquí, mientras que el color del *borde* se encuentra en las propiedades de pincel. Si el cuadro *de relleno* no está marcado, sólo se muestra el borde.

source: Under the *Fill* checkbox, set aspect ratio, and the number of sides of stars and polygons.
es: Bajo el cuadro *de relleno*, mantener relación de aspecto, y el número de lados de estrellas y polígonos.

source: TextTab
es: Barra de texto

source: Type. To insert text, press *Type*, move the cursor to the point you want to start typing, click, and insert text with the keyboard. The colour used is set in Brush properties.
es: Texto. Para insertar texto, pulsa el botón *Teclear*, mueve el cursor hasta el punto que desees empezar a escribir, haz clic, e inserta texto con el teclado. El color utilizado se encuentra en las propiedades de pincel.

source: Bold switch.
es: Botón de cambio a Negrita.

source: Italic switch.
es: Botón de cambio a Itálica.

source: Increase or decrease font size.
es: Aumentar o disminuir el tamaño de la fuente.

source: Select font.
es: Selección de fuente.

source: Images Tab
es: Barra de Imágenes

source: Insert picture, opens Journal or attached media in Image search.
es: Insertar imagen, abre el Diario o medios de comunicación unidos en busca de imagen.

source: Rotate selected area left.
es: Girar el área seleccionada a la izquierda.

source: Rotate selected area right.
es: Girar a la derecha el área seleccionada.

source: Horizontal mirror, or flip, selected area.
es: Espejo horizontal, o girar, el área seleccionada.

source: Vertical mirror, or flip, selected area.
es: Espejo vertical, o girar, el área seleccionada.

source: Convert selected area from color to gray.
es: Convertir el área seleccionada de color a gris.

source: Rainbow.
es: Arco iris.

source: Invert colors in the selected area. For example black is inverted to white, and similarly, all colors are inverted.
es: Invertir colores en el área seleccionada. Por ejemplo negro se invierte a blanco, y del mismo modo, todos los colores están invertidos.

source: Applying
es: Aplique

source: Paint is a versatile Activity with many uses such as:
es: El Pintar es una actividad versátil con muchas aplicaciones, tales como:

source: creating drawings or paintings.
es: la creación de dibujos o pinturas.

source: creating images for inserting into Write documents.
es: la creación de imágenes para insertar en documentos de escritura.

source: creating slides for a Portfolio Activity slide show.
es: la creación de diapositivas de una presentación de diapositivas para la Actividad de Portapapeles.

source: creating images for using in other Activities including Turtle Blocks and many more.
es: crear imágenes para usar en otras actividades como Turtle Blocks y muchas más.

source: editing and cropping images made by other Activities including Turtle Blocks and many more..
es: Editar y cortar imágenes realizadas por otras actividades como Turtle Blocks y muchas más. .

source: editing and cropping screen shots (take screen shots from the keyboard by pressing the *Alt* key with *1*).
es: Editar y recortar capturas de pantalla (toma capturas de pantalla desde el teclado pulsando la tecla *Alt* con *1*).

source: editing and cropping photos taken with the Record Activity.
es: Editar y cortar fotos tomadas con la Actividad Grabar.

source: Sharing
es: Compartir

source: Paint does not support sharing. You can use Turtle Blocks for collaborative drawing.
es: Pintar no es compatible para compartir. Puedes utilizar Turtle Blocks para el dibujo en colaboración.

source: You can share the work you have done in Image Viewer.
es: Tú puedes compartir el trabajo que haz hecho en el Visor de imágenes.

source: |more| For further information, please see the page :doc:`/collaborating`
es: |more| Para más información, consulta la página :doc:`/collaborating`

source: Extending
es: Extensión

source: take a photo of an animal with Record, crop the image with Paint, use as a custom turtle in Turtle Blocks.
es: Toma una foto de un animal con Grabar, recorta la imagen con Pintar, úsala como una tortuga personalizada en Turtle Blocks.

source: start a school newspaper, take photos with Record, crop with Paint, import them into Write.
es: Iniciar un periódico de la escuela, toma fotos con Grabar, recorta con Paint, impórtalas a Escribir.

source: do a portfolio of your schoolwork, get screenshots (Alt-1) crop with Paint and add explanatory labels then make a slideshow in Portfolio Activity.
es: Haz un portapapeles de tu tarea, obtiene capturas de pantalla (Alt-1) de los recortes con Pintar y añade etiquetas explicativas a continuación, haz una presentación de diapositivas en la Actividad Portapapeles.

source: create a custom Memorize Activity game, create the images in Paint.
es: Crea un juego personalizado en la actividad Memorizar, crea las imágenes en Pintar.

source: create custom cards for the Dimensions (Visual Match) Activity.
es: Crea tarjetas personalizadas para la actividad Dimensiones (Partido Visual).

source: create custom foods for the Nutrition Activity.
es: Crea alimentos personalizados para la Actividad Nutrición.

source: create custom images for the Labyrinth Activity. Labyrinth is a mind mapping tool.
es: Crea imágenes personalizadas para la Actividad Mapas Mentales. Mapas mentales es una herramienta de mapas mentales.

source: create a web page with images from Paint.
es: Crea una página web con imágenes de Pintar.

source: take photos of plants or animals, crop the photos, and label them.
es: Toma fotos de plantas o animales, recorta las fotos, y etiquétalas.

source: take the output of SimpleGraph and use the *Bucket* (flood-fill tool) to make a multicolored graph.
es: Toma la salida de SimpleGraph y utiliza el *Balde* (herramienta de inundaciones de relleno) para hacer un gráfico multicolor.

source: Developers' information
es: Información para desarrolladores

source: **History**
es: **Historia**

source: Oficina (the Paint Activity) was developed and adapted to the XO using Python for the team NATE-LSI (Integrated Systems Laboratory), in the Polytechnical School at University of São Paulo, Brazil.
es: Oficina (el nombre original de la actividad Pintar) fue desarrollada y adaptada para XO usando Python por el equipo NATE-LSI (Laboratorio de Integración de Sistemas), en la Escuela Politécnica de la Universidad de San Pablo, Brasil.

source: **Resources**
es: **Recursos**

source: `Sources <https://git.sugarlabs.org/projects/paint>`_
es: `Fuentes <https://git.sugarlabs.org/projects/paint> `_

source: Where to report problems
es: Dónde reportar problemas

source: In http://bugs.sugarlabs.org, component Paint.
es: En http://bugs.sugarlabs.org, componente de Pintar.
