Repository: tony37/sledhelp
Catalog: translated_po/*/physics.po
Languages: es

source: Physics
es: Física

source: About
es: Acerca de

source: Physics is a physical world simulator and playground. You can add squares, circles, triangles, or draw your own shapes, and see them come to life with forces (think gravity, Newton!), friction (scrrrrape), and inertia (ahh, slow down!).
es: Física es un simulador de mundo físico y lugar de juego. Puedes agregar cuadrados, círculos, triángulos, o dibujar tus propias formas, y verlas tomar vida con las fuerzas (piensa en la gravedad, Newton!), fricción (rrrrrraspar), e inercia (ahh, disminuya la velocidad!).

source: Getting to know the tools
es: Conoce las herramientas

source: This image shows all the tools used for creating objects. Reference the number shown below the tool to learn what it does.
es: Esta imagen muestra todas las herramientas utilizadas para crear objetos. Fíjate al número que aparece debajo de la herramienta para aprender lo que hace.

source: Magic Pen Tool:
es: Herramienta Lapiz Mágico:

source: Draw anything and it will appear in the canvas. You can use it to create custom shapes, or a surface. Like a slope.
es: Dibuja cualquier cosa y aparecerá en el lienzo. Se puede utilizar para crear formas personalizadas, o una superficie. Como una pendiente.

source: Circle Tool:
es: Herramienta Círculo:

source: You can make circles with it, just drag. Try rolling a circle down a slope.
es: Puedes hacer círculos con ella, sólo tienes que arrastrar. Prueba rodar un círculo por una pendiente.

source: Triangle Tool:
es: Herramienta Triángulo:

source: You can make equilateral triangles (all sides equal) with this tool. Try making a seesaw by combining a triangle and a rectangle (described below).
es: Puede hacer triángulos equiláteros (todos los lados iguales) con esta herramienta. pRUEAB hacer un balancín mediante la combinación de un triángulo y un rectángulo (descripto a continuación).

source: Rectangle Tool:
es: Herramienta Rectángulo:

source: For making rectangles.
es: Para hacer rectángulos.

source: Polygon Tool:
es: Herramienta Polígono:

source: You can make multi-sided shapes with this tool. Drag the mouse, then click on place where the vertices of the polygon should be. after you are finished, click in the circle surrounding the first dot you drew and the shape will be drawn.
es: Puedes hacer formas con múltiples caras con esta herramienta. Arrastra el ratón, a continuación, haz clic en el lugar donde los vértices del polígono deben estar. Después que hayas terminado, haz clic en el círculo que rodea el primer punto que dibujaste y la forma se dibujará.

source: Grab Tool:
es: Herramienta Arrastrar:

source: You can move objects around with this tool. You can use it even when the game is running: Try grabbing an object and moving it around. It can be really fun.
es: Puedes mover objetos con esta herramienta. Se puede utilizar incluso cuando el juego está en marcha: Trata de agarrar un objeto y cambiarlo de sitio. Puede ser muy divertido.

source: When the game is paused, you can use dragging to move objects with more precision. You can also drag pins and motors. When you select the grab tool, the pins and motors will become bigger so that you can easily hold and drag.
es: Cuando se detuvo el juego, puedes utilizar arrastrar para mover objetos con más precisión. También puedes arrastrar alfileres y motores. Al seleccionar la herramienta de agarre, los pasadores y los motores serán más grandes para que los puedas sostener y arrastrar fácilmente.

source: **ProTip**: You can move motors and pins from one object to another. Also, moving them out of the body and dropping them in empty space deletes them.
es: **Truco**: Puedes mover los motores y los pasadores de un objeto a otro. También, moverlos fuera del cuerpo y soltándolos en el espacio vacío para eliminarlos.

source: Motor Tool:
es: Herramienta Motor:

source: With this tool, you can place a motor on an object. The object will then start rotating around that point. You can also change the speed with which it rotates, as will be explained in the Palette section.
es: Con esta herramienta, se puede colocar un motor en un objeto. El objeto entonces comenzará a girar alrededor de ese punto. También puede cambiar la velocidad con la que gira, como se explicará en la sección Paleta.

source: Pin Tool:
es: Herramienta Alfiler:

source: This tool allows you to make objects stick to the background and not move around, very much like pinning a paper to a clipboard. Just click where you want to place a pin.
es: Esta herramienta te permite hacer que los objetos se adhieren al fondo y no se muevan, muy parecido a fijar un papel a un portapapeles. Simplemente haz clic donde deseas colocar un alfiler.

source: Joint Tool:
es: Herramienta Unión:

source: With this tool you can attach objects to other objects. Click on the point at which you want to attach the joint in the first object and drag the mouse over to the point at which you want the joint to end on the second object. Done!
es: Con esta herramienta se puede unir objetos a otros objetos. Haz clic en el punto en el que deseas fijar la articulación en el primer objeto y arrastra el ratón sobre el punto en el que desea que la articulación termine en el segundo objeto. Hecho!

source: Rope Tool:
es: Herramienta Cuerda:

source: Joints are like iron bars, they cannot bend. If you need rope, this tool does it for you. Just click and drag to make the rope. Be careful though, removing ropes once they have been made can be difficult.
es: Las articulaciones son como barras de hierro, que no pueden doblar. Si necesita una cuerda, esta herramienta es para ti. Basta con hacer clic y arrastrar para crear la cuerda. Ten cuidado sin embargo, la eliminación de cuerdas, una vez que se han creado puede ser difícil.

source: Trace Tool:
es: Herramienta Trazar:

source: Want to see how and where an object is moving? Put a tracer on it! Select this tool and click on the point on the object you want to trace. You can delete a tracer by left clicking with the destroy tool (below)
es: ¿Quieres ver cómo y dónde se mueve un objeto? Pon un trazador en él! Seleccione esta herramienta y haz clic en el punto del objeto que deseas rastrear. Puedes eliminar un marcador haciendo clic izquierdo con la herramienta Destruir (abajo)

source: Destroy Tool:
es: Herramienta Destruir:

source: Select this tool and drag to leave a trail of destruction behind! You not only use this tool to destroy objects, but also pins, motors and tracers. A single left click deletes one pin/motor/tracer on the object. Since ropes are just small balls joined with small joints, you can try deleting them too, but it takes time and is mildly annoying. Therefore try to make rope only when you are sure you want it.
es: Selecciona esta herramienta y arrastra para dejar un rastro de destrucción detrás! Utiliza esta herramienta para destruir no solo objetos, sino también alfileres, motores y trazadores. Un solo clic izquierdo borra un alfiler / motor / trazador en el objeto. Como las cuerdas son sólo pequeñas bolas unidas con articulaciones pequeñas, puede intentar borrarlas también, pero toma tiempo y es algo molesto. Por lo tanto, tratar de usar las cuerdas solo cuando esté seguro de que es lo que deseas.

source: **ProTip**: If you've drawn with a tool before and want multiple copies of the same shape, just do a left-click and the same object with be drawn again. Try it with the Rectangle tool! Draw a square and then left click again, you'll get another copy of the square.
es: **Truco**: Si has dibujado con una herramienta antes y deseas hacer varias copias de la misma forma, haz un clic izquierdo y el mismo objeto se creará de nuevo. Prueba con la herramienta Rectángulo! Dibuja un cuadrado y luego haga clic en la izquierda otra vez, obtendrá otra copia del cuadrado.

source: Other cool features
es: Otras características interesantes

source: Using this button, you can erase everything from the canvas. Careful, you cannot undo this!
es: Con este botón, puedes borrar todo. Cuidado, no se puede deshacer esto!

source: This button allows you to delete all trace marks on the canvas.
es: Este botón te permite borrar todas las marcas de traza en el fondo.

source: These two buttons allow you to pause or start the game. The first button makes the game start again after a pause and the second stops it. These are ultra useful while building complicated machines, which you cannot build while the machine is running.
es: Estos dos botones te permiten pausar o iniciar el juego. El primer botón hace que el juego comience de nuevo después de una pausa, y el segundo lo detiene. Estos son ultra útil mientras construyes máquinas complicadas, que no se pueden construir mientras la máquina está en funcionamiento.

source: All of the objects have palette menus to adjust object properties:
es: Todos los objetos tienen menús de paleta para ajustar las propiedades del objeto:

source: Mass
es: Masa

source: feather, wood, and anvil represent light to dense
es: pluma, madera y yunque representan liviano a denso

source: Bounciness
es: Rebote

source: basketball, baseball, and bowling ball represent very bouncy to inelastic
es: baloncesto, béisbol y bola de bowling representan muy elástico a rígido

source: Friction
es: Fricción

source: ice skate, shoe, and sneaker represent low to high coefficient of friction
es: patin de hielo, zapato y zapatilla de deporte, representan menor a mayor coeficiente de fricción

source: The motor has a palette to set speed (fast and slow) and direction (counter-clockwise and clockwise)
es: El motor tiene una paleta para ajustar la velocidad (rápido y lento) y dirección (hacia la izquierda y hacia la derecha)

source: The chain has a palette to set the coarseness and weight of the chain elements
es: La cadena tiene una paleta para establecer la tosquedad y el peso de los elementos de la cadena

source: Ideas to try
es: Ideas para probar

source: Here are some ideas you could try:
es: Aquí están algunas ideas que tu podrías intentar:

source: Build a catapult to simulate Angry Birds
es: Construir una catapulta para simular Angry Birds

source: Build a machine that sorts different sized balls in to two buckets, large and small, with no ball jams.
es: Construir una máquina que clasifica diferentes bolas por tamaño en dos cubos, grandes y pequeños, sin que se atasquen las bolas.

source: A cyclic mechanism for lifting balls from the bottom of the screen to the top, again and again.
es: Un mecanismo cíclico para la elevación de las bolas desde la parte inferior de la pantalla a la parte superior, una y otra vez.

source: Try dropping 2 different mass objects at the same time.
es: Trata hacer caer 2 objetos de masas diferentes al mismo tiempo.

source: Experiment with pendulums of different lengths and masses.
es: Experimenta con péndulos de diferentes longitudes y masas.

source: Ping pong, can you make a device that hits a ball back and forth across the screen?
es: Ping pong, puedes hacer un dispositivo que golpee una pelota de un lado a otro de la pantalla?

source: Try building a mechanical binary clock.
es: Intenta construir un reloj binario mecánico.

source: Convert rotation into parallel motion using pistons.
es: Convierte la rotación en movimiento lineal usando pistones.

source: Experiment with touching one motorised circle against one pinned circle of various sizes.
es: Experimente con hacer tocar un círculo motorizado contra círculos fijos de varios tamaños.

source: Try building a rag-doll puppet and make it dance in a convincing way.
es: Trata de construir una marioneta y hacerla bailar de una manera convincente.

source: Use just links and circles to make a structurally sound Eiffel Tower.
es: Utiliza sólo enlaces y círculos para hacer una estructuralmente sólida similar a la Torre Eiffel.

source: Try building a ratchet mechanism.
es: Intenta construir un mecanismo de trinquete.

source: Try building an analogue clock face where the min hand goes around 60 times for each hour.
es: Intenta construir un reloj analógico donde la aguja de los segundos gira 60 veces por cada hora.

source: Modify the program itself: `Modifying Physics <http://wiki.sugarlabs.org/go/Activity_Team/Modifing_an_Activity#Modifying_Physics>`_
es: Modificar el programa en sí: `Modificación Física <http://wiki.sugarlabs.org/go/Activity_Team/Modifing_an_Activity#Modifying_Physics>`_
