Repository: tony37/sledhelp
Catalog: translated_po/*/pippy.po
Languages: es

source: About
es: Acerca de

source: Pippy allows the student to examine, execute, and modify simple Python programs. In addition it is possible to write Python statements to play sounds, calculate expressions, or make simple text based interactive games.
es: Pippy permite al estudiante examinar, ejecutar y modificar programas Python simples. Además, es posible escribir sentencias de Python para reproducir sonidos, calcular expresiones, o hacer simple juegos interactivos basados en texto.

source: Where to get Pippy
es: Dónde obtener Pippy

source: Pippy is included in the standard releases of the OLPC software. It is available for download `here <http://activities.sugarlabs.org/en-US/sugar/addon/4041>`_
es: Pippy se incluye en las versiones estándar del software OLPC. Está disponible para su descarga aquí `<http://activities.sugarlabs.org/en-US/sugar/addon/4041>`_

source: Using
es: Uso

source: The left column is a list of python programs, which can be viewed, and modified in the upper right window, and where the results of execution are displayed in the lower right window.
es: La columna de la izquierda muestra una lista de los programas Python, que se pueden ver y modificar en la ventana superior derecha, y donde los resultados de la ejecución se muestran en la ventana inferior derecha.

source: Learning with Pippy
es: Aprender con Pippy

source: Etoys and Turtle art provide easy introduction to programming. Pippy introduces a more traditional view of programming a computer, wherein the instructions are first written to a text file, and then executed with a "run" command.
es: Etoys y Turtle arte proporcionan una fácil introducción a la programación. Pippy introduce una visión más tradicional de la programación de un ordenador, en el que las instrucciones se escriben primero en un archivo de texto, y luego son ejecutadas con un comando "Correr".

source: In particular, it is instructive to play with the sounds:
es: En particular, es instructivo jugar con los sonidos:

source: Get the list of sounds by executing the Getsoundlist program
es: Obtiene la lista de sonidos mediante la ejecución del programa Getsoundlist

source: Copy the name of one of the sounds and replace the "digeridu" sound name in Playwave program.
es: Copia el nombre de uno de los sonidos y sustituye el nombre del sonido "digeridu" en el programa PlayWave.

source: Extending Pippy
es: Extendiendo Pippy

source: If Pippy is used in parallel with the Write Activity, it is possible to develop larger programs. Copy the program that you develop in the Write Activity by selecting all (<ctrl>a) and copying it to the clipboard (<ctrl>c), then switch to the Pippy Activity, and paste (<ctrl>v) it into the code window. If there are errors that you want to correct, you can make the changes in the code window, and immediately see the results of your changes. Then by copying the changed program back to the clipboard, you can paste it back into the Word Activity, and save the changes to the Journal.
es: Si Pippy se utiliza en paralelo con la actividad Escribir, es posible desarrollar programas más grandes. Copia el programa que se desarrolla en la actividad Escribir mediante la selección de todo (<Ctrl> a) y copiandolo en el portapapeles (<ctrl> c), a continuación, cambia a la actividad Pippy, y pega (<ctrl> v) en el ventana de código. Si hay errores que deseas corregir, usted puede hacer los cambios en la ventana de código, y ver de inmediato los resultados de los cambios. Entonces copia el programa modificado nuevamente en el portapapeles, puedes volver a pegarla en la actividad Escribir y guardar los cambios en el Diario.

source: Modifying Pippy
es: Modificando Pippy

source: The student can add small programs, and have them show up in the left column of Pippy by adding files to /home/olpc/Activities/Pippy.activity/data. There is a large number of suggested examples of programs for Pippy at http://wiki.laptop.org/go/Pippy#Examples.
es: El estudiante puede añadir pequeños programas, y hacer que se muestran en la columna izquierda de Pippy añadiendo archivos en /home/olpc/Activities/Pippy.activity/data. Hay un gran número de ejemplos sugeridos de programas para Pippy en http://wiki.laptop.org/go/Pippy#Examples.

source: Where to report problems
es: Dónde reportar problemas

source: There's a range of ways to report problems. The easiest is to email to the sugarlabs email list at sugar-devel@lists.sugarlabs.org. Someone on the list will respond to you, and perhaps also put a formal bug report at http://bugs.sugarlabs.org/.
es: Hay una variedad de maneras de reportar problemas. Lo más fácil es enviar por correo electrónico a la lista de correo electrónico sugarlabs en sugar-devel@lists.sugarlabs.org. Alguien en la lista le responderá, y quizás también poner un reporte formal bug en http://bugs.sugarlabs.org/.

source: Or you can register at http://bugs.sugarlabs.org/ and enter a bug report yourself.
es: O puedes registrarse en http://bugs.sugarlabs.org/ e introducir un bug informar por ti mismo.
