Repository: tony37/sledhelp
Catalog: translated_po/*/poll.po
Languages: es

source: Poll
es: Encuesta

source: Overview
es: Introducción

source: A poll is a research tool that helps explain what a group of people think about a subject. First you present the group with a question and a set of answer choices. Then each person in the group gets to vote for the answer which best describes their personal feelings or opinion. After collecting votes from the whole group, you look for a pattern in their answers. You can also ask the same question of different groups (i.e. boys and girls or children and adults) and see how each group answers.
es: Una encuesta es una herramienta de investigación que ayuda a explicar lo que un grupo de gente piensa acerca de un tema. En primer lugar presentas el grupo una pregunta y un conjunto de opciones de respuesta. Luego, cada persona en el grupo llega a votar por la respuesta que mejor describe sus sentimientos personales o su opinión. Después de recoger los votos de todo el grupo, buscas un patrón en sus respuestas. También puedes hacer la misma pregunta a diferentes grupos (ej. niños y niñas o niños y adultos) y ver cómo cada grupo responde.

source: A poll can be used to help a community make a decision and take action. It can also be used to understand the similarities and differences among individuals and groups of people.
es: Una encuesta puede ser utilizado para ayudar a una comunidad a tomar una decisión y tomar medidas. También se puede utilizar para comprender las similitudes y diferencias entre las personas y grupos de personas.

source: Polls are a helpful tool for any research project. Use this Poll tool and lesson plans with whatever subject you are studying. It can also be used to make collaborative decisions in the classroom about academic activities and among friends about social issues.
es: Las encuestas son una herramienta útil para cualquier proyecto de investigación. Utiliza esta herramienta y planes de lecciones con cualquier tema que se esté estudiando. También se puede utilizar para tomar decisiones en forma colaborativa en el aula acerca de las actividades académicas y entre amigos sobre temas sociales.

source: Skills:
es: Habilidades:

source: Learn what a poll is and how it works.
es: Aprenda lo que una encuesta es y cómo funciona.

source: Learn how to use polls to gather information and make decisions.
es: Aprende a utilizar las encuestas para recopilar información y tomar decisiones.

source: Practice choosing poll subjects.
es: Practica la elección de temas de encuestas.

source: Learn how to formulate good poll questions and answer choices.
es: Aprende cómo formular buenas preguntas para la encuesta y opciones de respuesta.

source: Practice basic survey skills of data collection, analysis and presentation.
es: Practica las habilidades básicas de la recopilación de datos, análisis y presentación.

source: Learn how to use a bar graph to represent votes and opinions.
es: Aprende a utilizar un gráfico de barras para representar votos y opiniones.

source: Learn how to represent poll results using ratios and percentages.
es: Aprende cómo representar resultados de la encuesta utilizando proporciones y porcentajes.

source: Learn how to help peers understand an idea or an opinion.
es: Aprende cómo ayudar a tus compañeros a entender una idea o una opinión.

source: Learn from classmates.
es: Aprende de los compañeros de clase.

source: Learn how to present poll results and make collaborative decisions based on those results.
es: Aprende cómo presentar resultados de la encuesta y tomar decisiones colaborativas basadas en estos resultados.

source: Practice using new functions and features of the XO Laptop.
es: Practicar el uso de las nuevas funciones y características de la Laptop XO.

source: Participate in a Poll
es: Participa en una encuesta

source: Open the Poll activity from the Sugar Home view.
es: Abre la actividad Encuesta desde la vista Hogar de Sugar.

source: Choose a Poll topic from the list, and click the “VOTE” button next to it.
es: Elige un tema de Encuesta de la lista, y haz click en el boton “VOTAR”.

source: A Poll question and answer choices will appear. Read them carefully, then click on your favorite answer. Click the “VOTE” button to submit your answer.
es: Aparecerá una pregunta de la encuesta y las opciones de respuesta. Lee con cuidado, luego haz clic en tu respuesta favorita.

source: After you vote, current Poll results will appear. You will see the exact number of votes cast (so far) for each answer. You will also see a bar graph that shows which answer is currently the most popular among the whole group.
es: Después de votar, aparecerán los resultados de la Encuesta Actual. Verás el número exacto de votos emitidos (hasta ahora) para cada respuesta. También podrás ver un gráfico de barras que muestra que respuesta es actualmente la más popular entre todo el grupo.

source: Look at the number of votes next to each answer. Which one has the most votes so far? How many people chose the same answer as you? Which answer do you think will win? Why?
es: Mira el número de votos junto a cada respuesta. ¿Cuál tiene más votos hasta el momento? ¿Cuántas personas eligieron la misma respuesta que tu? ¿Qué respuesta crees que ganará? ¿Por qué?

source: Look at the bar graph. Which answer has the longest bar? What does that mean? Which answer has the shortest bar? What does that mean?
es: Mira el gráfico de barras. ¿Qué respuesta tiene la barra más larga? Qué significa eso? ¿Qué respuesta tiene la barra más corta? Qué significa eso?

source: Let each person in your group vote in this poll. How did the votes and bar graphs change?
es: Haz que cada persona en tu grupo vote en esta encuesta. ¿Cómo cambiaron los votos y gráficos de barras?

source: After everyone votes, discuss the final results. What did you learn from the poll? Were you surprised by the results? How could you use this information?
es: Después de que todos los votos, discute los resultados finales. ¿Qué aprendiste de la encuesta? ¿Te sorprendió por los resultados? ¿Cómo podrías usar esta información?

source: Generate a list of ideas for polls. Record your ideas on a blackboard, on paper or in the “Write” program on the XO Laptop. What would you like to learn from each poll you thought of? What would you do with the results?
es: Generar una lista de ideas para encuestas. Escribe tus ideas en el pizarron en un papel o en la actividad Escribir en tu laptop. ¿Qué te gustaría aprender con cada encuesta que pensaste? ¿Qué haría usted con los resultados?

source: Build a Poll
es: Crea una encuesta

source: Make a poll of your own! The goal is to build a poll that is interesting to you, and learn to collect votes from people and reach conclusions or make decisions based on your poll.
es: ¡Haz tu propia encuesta! El objetivo es crear una encuesta que sea interesante para ti, y aprender a recoger los votos de la gente y llegar a conclusiones o tomar decisiones sobre la base de tu encuesta.

source: Example poll idea: “What is your favorite activity on the XO?” You can use this poll in your classroom or your family, to find out what activity is the most favorite or popular.
es: Ejemplo de una idea para encuesta: "¿Cual es tu actividad favorita en tu XO?" Puedes usar esta encuesta en tu clase, o en tu familia, para encontrar cual es la actividad favorita o más popular

source: Open the Poll Builder activity and click on the “Build a Poll” button at the bottom of the screen.
es: Abre la actividad Encuesta y haz click en el boton "Construir encuesta"

source: Fill in your poll details on the blank form that appears. Type in your poll title, question and answers, and the number of votes you want to collect.
es: Rellena los datos de la encuesta en el formulario en blanco que aparece. Escriba su título, pregunta y respuestas, y el número de votos que deseas recopilar.

source: Think about your “Poll Title” and “Question.” The title is the name of your poll, and the question is what you want to know. In our example poll, the title is “Favorite Food” and the question is “What is your favorite food?”
es: Piensa acerca del Título de la encuesta y la Pregunta. El título es el nombre de tu encuesta, y la pregunta es lo que quieres saber. En nuestra encuesta de ejemplo, el título es "Comida favorita" y la pregunta es "¿Cual es tu comida favorita?"

source: Next type in the number of votes you want to collect in your poll. This number is called a “sample size” by researchers. To do this correctly, think about how many people you want to poll. Is it all of the students in your class? Just the 12-year-olds? All of the people in your family? All of the women in your town?
es: Luego ingresa el número de votos que deseas recopilar en tu encuesta. Para hacer esto correctamente, piensa en la cantidad de personas que deseas sondear. ¿Todos los estudiantes en tu clase? ¿Sólo los niños de 12 años? ¿Todas las personas en tu familia? ¿Todas las mujeres en tu ciudad?

source: Now type in the “Answer choices,” you want people to choose from. You can offer 2, 3, 4 or 5 answer choices in this poll. In our Favorite Food example, the answer choices could be: 1. Bread, 2. Rice, 3. Beans, 4. Candy, 5. Bananas.
es: Puedes ofrecer 2, 3, 4 o 5 opciones de respuesta en esta encuesta. En nuestro ejemplo Alimentos Favoritos, las opciones de respuesta pueden ser: 1. Pan, 2. Arroz, 3. Frijoles, 4. Carmelos, 5. Plátanos.

source: Once you have filled in all of the “Build a Poll” fields, click “Step 1: Preview” to see how your poll will look.
es: Cuado has llenado todos los campos, haz click en "Previsualizar" para ver como se ve la encuesta.

source: If you like how it looks, click “Save Poll.”
es: Si estas conforme, presiona "Grabar encuesta".

source: If you want to change something, click “Edit Poll.” You can change the information in any field.
es: Si quieres cambiar algo, haz click en "Editar Encuesta". Puedes cambiar la información en cualquier campo.

source: When you are happy, click “Step 2: Save Poll” -- your poll will be built.
es: Si estas conforme, presiona “Grabar encuesta“ -- tu encuesta será creada.

source: Collect Poll Data
es: Recoger datos para la Encuesta

source: Now that your poll is built, invite people to take your poll on the XO. Walk around with your laptop, and ask people to answer your research question.
es: Ahora que tu encuesta está lista, invita a la gente a tomar parte en tu encuesta en la XO. Camina alrededor con tu ordenador portátil, y pídele a la gente responder a tu pregunta de investigación.

source: Decide how you are going to get the information you need. You could read your question and the answer choices to each person and click their answer on your XO. Or, you can show each person how to select your poll from the list, read the poll by themselves and click on their answer choice by themselves.
es: Decide cómo vas a obtener la información que necesitas. Puedes leer tu pregunta y las opciones de respuesta a cada persona y hacer clic en su respuesta en tu XO. O bien, puede mostrar a cada persona cómo seleccionar su encuesta de la lista, leer la encuesta realizada por ellos mismos y hacer clic en su opción de respuesta por sí mismos.

source: For best results, each person should vote only once. The Poll will close when you reach the number of your “sample size.”
es: Para obtener los mejores resultados, cada persona debe votar una sola vezLa encuesta se cierra cuando se alcanza el número de respuestas que tu haz seleccionado (tamaño de la muestra).

source: Try to collect votes from the people you originally thought about when you chose the “number of votes to collect.” If it was girls, ask only girls. Otherwise your results will not reflect the group you had in mind.
es: Trata de colectar votos de la gente en la que pensaste originalmente cuando seleccionaste el "número de votos a recolectar". Si pensaste en niñas, pregúntale solo a niñas, De lo contrario los resultados no reflejarán el grupo que tenías en mente.

source: Remember, you can create the same poll again, and ask different kinds of people to answer each time. It will be very interesting to compare the results of the same question asked to different groups, such as boys and girls or adults and children.
es: Recuerda, puedes crear la misma encuesta de nuevo, y pedir a diferente tipos de personas responder en cada momento. Va a ser muy interesante comparar los resultados de la misma pregunta hecha a los diferentes grupos, como los niños y niñas o adultos y niños.

source: Use Data to make Observations and Decisions
es: Usar datos para hacer observaciones y tomar decisiones

source: After you have collected the poll data you needed from one or more groups, look at the results and think about what they mean.
es: Después de haber recogido los datos de encuesta que necesitabas a partir de uno o más grupos, mira los resultados y piensa en lo que significan.

source: Open the Poll activity on your XO and find your poll title on the list. Click the “See Results” button to see how people voted.
es: Abra la actividad Encuesta en tu XO y encuentra el título de encuesta en la lista.

source: Look at the Bar Graphs that represent the votes (results) of your poll. Which answer has the longest bar? What does that mean? Which answer has the shortest bar? What does that mean?
es: Mira los gráficos de barras que representan los votos (resultados) de tu encuesta. ¿Qué respuesta tiene la barra más larga? Qué significa eso? ¿Qué respuesta tiene la barra más corta? Qué significa eso?

source: If you tried your poll with different groups (girls, boys, teachers, students, adults, children, etc.) Open each poll and see if there are any differences.
es: Si haz hecho tu encuesta a diferentes grupos (niñas, niños, profesores, estudiantes, adultos, niños, etc.. ) Abre cada encuesta y ve si hay alguna diferencia.

source: Write down notes about what you see; put your findings on paper or record them with the “Write” activity on your XO. How does this kind of information help you draw conclusions about the people you surveyed? Does the data accurately represent an entire group? Does it matter if you questioned 25 people or 100 people? Why?
es: Escribe notas acerca de lo que ves; pon lo que has descubierto en papel o con la actividad Escribir eb tu XO. ¿De qué manera este tipo de información te ayudará a sacar conclusiones acerca de las personas que encuestaste? ¿Los datos representan con precisión todo un grupo? ¿Importa si has interrogado a 25 personas o a 100 personas? ¿Por qué?

source: Present you findings to your class, or to the people who took the poll. Tell them what you learned for the poll and discuss the results together. Brainstorm about what could be done with this information.
es: Ppresenta los resultados a tu clase, o a las personas que tomaron la encuesta. Diles lo que has aprendido de la encuesta y discuti los resultados junto a ellos. Haz una lluvia de ideas sobre lo que podría hacerse con esta información.
