Repository: tony37/sledhelp
Catalog: translated_po/*/ports.po
Languages: es

source: Physical Features
es: Características físicas

source: Features and Ports
es: Características y Puertos

source: The XO laptop has many built-in features. These include a camera, microphone, speakers and wireless antenna. In addition, the laptop allows for the attachment of other external devices. This is often done by plugging the devices into connectors (some are more commonly referred to as ports, jacks or slots).
es: La laptop XO tiene muchas características integradas. Estas incluyen una cámara, micrófono, altavoces y antena inalámbrica. Además, el ordenador portátil permite la fijación de otros dispositivos externos. Esto se suele hacer mediante la conexión de los dispositivos en los conectores (algunos son más comúnmente conocida como los puertos, conectores o ranuras).

source: Backlit screen
es: Pantalla retroiluminada

source: The display functions in a full-color mode similar to other laptop displays and in an ultra-low-power, ultra-high-resolution, black-and-white mode that is readable in direct sunlight.
es: Las funciones de la pantalla en el modo color es similar a otras pantallas de ordenador portátil con un bajo consumo de energía de ultra-alta resolución, y un modo blanco y negro que se puede leer a la luz solar directa.

source: 1, 2 - Built-in microphone
es: 1, 2 - Micrófono incorporado

source: There is both a built-in microphone (and an external microphone jack, which supports both AC and DC sources.) As a privacy measure, an LED above the microphone (1) lights up whenever the microphone is in use.
es: Tiene ambos, un micrófono incorporado (y un conector para micrófono externo, que soporta tanto fuentes de CA y CC) Como medida de privacidad, un LED por encima del micrófono (1) se ilumina cuando el micrófono está en uso.

source: 3, 8 - Built-in speakers
es: 3, 8 - Altavoces incorporados

source: Internal stereo speakers and an amplifier provide a way to play music, videos, and anything you have recorded yourself. There’s also a jack for external headphones or speakers.
es: Los altavoces estéreo internos y un amplificador proveen una manera de reproducir música, videos y todo lo que haz grabado tu mismo. Tambien hay un conector para conectar auriculares o parlantes externos.

source: 4 - Game pad
es: 4 - Teclas de cursores

source: Two sets of four-direction cursor-control keys can be game controllers. Since they still function when the screen is folded down into e-book mode, the XO creates a self-contained game playing pad including a controller.
es: Dos juegos de teclas de control del cursor en cuatro direcciones pueden ser controladores de juego. Puesto que aún funcionan cuando la pantalla se pliega hacia abajo en el modo e-book, el XO crea una plataforma de juego autónomo que incluye un controlador.

source: 5 - Screen rotate button
es: 5 - Boton de rotación de pantalla

source: A button on the XO laptop’s display frame changes the orientation of the screen, so it can be viewed right-side-up from any direction.
es: Un boton en el marco de la patalla de la laptop XO cambia la orientación de la pantalla, para que pueda ser vista en cualquier dirección.

source: 6, 7 - Built-in camera
es: 6, 7 - Cámara

source: The XO laptop has a built-in color camera, enabling still photography and video recording. As a privacy measure, an LED above the camera (6) lights up whenever the camera is on.
es: La laptop XO tiene una cámara color integrada, lo que permite, sacar fotos fijas o grabar vídeo. Como medida de privacidad, un LED por encima de la cámara (6) se enciende cada vez que la cámara está encendida.

source: 9 - Game buttons
es: 9 - Botones de juego

source: The game buttons can be used when the screen is folded down into e-book mode, creating a self-contained game player. The buttons are labeled with a circle, a square, a check, and an ×. These buttons are often used by Activities. For example, the circle button can be used as the shutter for the camera in the Record Activity.
es: Los botones del juego se pueden usar cuando la pantalla se dobla hacia abajo en el modo e-book. Estos botones se utilizan a menudo por actividades. Por ejemplo, el botón círculo puede ser utilizado como el disparador de la cámara en la Actividad Grabar.

source: 10 - Power button, indicator
es: 10 - Botón de encendido, indicador

source: From left to right: the battery-level indicator; the power indicator; and the power button.
es: De izquierda a derecha: el indicador de nivel de batería; el indicador de alimentación; y el botón de encendido.

source: Along with offering unique connectivity options, the XO laptop can work with a wide range of external devices.
es: Además de ofrecer opciones de conectividad únicas, la laptop XO puede trabajar con una amplia gama de dispositivos externos.

source: 11 - Antennae ears
es: 11 - Antenas

source: When the wireless antennae "ears" are rotated up, they provide the XO with a connection range vastly superior to those of conventional laptops. When down, they keep dirt out of the connectors and act as a latch.
es: Cuando el antenas inalámbricas "orejas" se giran hacia arriba, proporcionan a la XO un rango de conexión muy superior a los de los ordenadores portátiles convencionales. Cuando se cierran, mantienen la suciedad lejos de los conectores y actuan como un pestillo.

source: 12, 13 - External headphones and microphone jacks
es: 12, 13 - Conectores de auriculares externos y micrófono

source: Along with built-in speakers and microphone, the XO laptop features jacks for external headphones and an external microphone.
es: Junto con los altavoces y micrófono incorporados, la laptop XO cuenta con tomas para auriculares y un micrófonos externos.

source: 14 - USB/memory ports
es: 14 - Puertos USB / memoria

source: The XO laptop features three external USB ports to support a variety of plug-in peripherals (one seen in the photo above, and two others under the other "ear"). Right side ports + battery
es: La laptop XO cuenta con tres puertos USB externos para apoyar una variedad de periféricos conectables (uno se ve en la foto de arriba, y otros dos en el otro "oreja"). Puertos del lado derecho y de la batería.

source: 15 - Power jack
es: 15 - Conector de alimentación

source: The XO comes with a power cord that can be plugged into any 110-to-240-volt AC outlet for charging. The power jack also accepts DC power from a solar panel for charging the XO laptop’s battery.
es: La XO viene con un cable de alimentación que se pueden conectar a cualquier toma de corriente alterna de 110 a-240-voltios para cargarla. También acepta DC (corrinte contínua) desde un panel solar para cargar su batería.

source: SD memory card slot
es: Ranura para tarjeta de memoria SD

source: There is a slot underneath the display that accepts SD memory cards for photos, video, and other content. Rotate the display so that the left-hand edge is over the keyboard—the slot is then accessible from below.
es: Hay una ranura debajo de la pantalla que admite tarjetas de memoria SD para fotos, vídeo y otros contenidos. Gira la pantalla para que la parte izquierda quede sobre el teclado, entonces la ranura quedará accesible por debajo.

source: Rechargeable battery
es: Batería recargable

source: Since many children, maybe even you, live "off the grid" (in places with poor or non-existent power infrastructure), the XO laptop is designed to be extremely power efficient.
es: Como muchos niños, tal vez incluso tu, viven "fuera de la red" (en lugares con infraestructura de energía pobre o inexistente), la computadora portátil XO está diseñado para ser extremadamente eficiente con la energía.
