Repository: tony37/sledhelp
Catalog: translated_po/*/portfolio.po
Languages: es

source: Portfolio
es: Obras

source: About
es: Acerca de

source: The Portfolio Activity creates a slide show from Sugar Journal entries that have been 'starred'.
es: La Actividad Obras crea una presentación de diapositivas de las entradas del Diario en Sugar que han sido marcadas como 'favoritas'.

source: Where to get Portfolio
es: Dónde obtener Obras

source: The Portfolio activity is included in OLPC images and available for download from the `Sugar Activity Library <http://activities.sugarlabs.org/en-US/sugar/addon/4437>`_
es: La actividad Obras está incluido en las imágenes de OLPC y disponible para su descarga desde los `Biblioteca de Actividades Sugar <http://activities.sugarlabs.org/en-US/sugar/addon/4437>`_

source: The source code is available on the `Sugar Labs Gitorious server <http://git.sugarlabs.org/portfolio>`_.
es: El código fuente está disponible en el servidor de `Gitorious Sugar Labs <http://git.sugarlabs.org/portfolio>`_.

source: Using
es: Uso

source: Before you launch the activity, use the ☆ on the left of each Journal entry to mark that entry for inclusion in the portfolio. The Portfolio Activity will use the entry title as well as the preview image and description.
es: Antes de iniciar la actividad, usa la ☆ a la izquierda de cada entrada en el Diario para marcar las que qieras incuir en Obras.La Actividad Obras usará el título de la entrada, así como la imagen de vista previa y la descripción.

source: The title text, the preview image, and the description text from Journal entries is used in the portfolio presentations.
es: El texto del título, la imagen de vista previa, y el texto de descripción de las entradas del Diario se utiliza en las presentaciones de Obras.

source: In the Thumbnail View, you can reorder the slides in your presentation by dragging.
es: En la vista en miniatura, puedes reordenar las diapositivas de la presentación arrastrando.

source: With the Edit-description Button, you can directly edit a Journal entry's description field.
es: Con el boton de edición descripción, puede editar directamente el campo de descripción de una entrada de Diario.

source: When running the activity, use the ◀ and ▶ buttons to step one-by-one through the slide show. Use the auto-play button to start/pause a slide show. The delay between slides can be controlled by the interval chosen in the combo box. (The default is 10 seconds.)
es: Utiliza el botón de reproducción automática para iniciar / pausar una presentación de diapositivas. El retraso entre diapositivas puede ser controlado por el intervalo elegido en el cuadro de opciones. (El valor predeterminado es de 10 segundos. )

source: **Did you know that:**
es: **¿Sabías que:**

source: you can record audio notes for each slide; the notes are played back whenever the slide is viewed;
es: Puedes grabar notas de audio para cada diapositiva; las notas se reproducen cada vez que la diapositiva se muestra;

source: the colors used in the background are taken from the XO colors of the user;
es: los colores utilizados en el fondo se toman de los colores XO del usuario;

source: a warning is displayed if there are no starred entries in your Journal;
es: se muestra una advertencia si no hay entradas con estrellas en tu Diario;

source: the slide show can be saved as an PDF document that can be shared;
es: la presentación de diapositivas se puede guardar como un documento PDF que se puede compartir;

source: in the thumbnail view, you can reorder your slides (by dragging them); and
es: en la vista en miniatura, puedes reordenar las diapositivas (arrastrándolos); y

source: you can edit the descriptions for each slide (and save your edits to the Journal).
es: puedes editar las descripciones de cada diapositiva (y guardar las ediciones en el Diario).

source: for group projects, try using the Bulletin-board Activity.
es: para proyectos de grupo, trata de usar la Actividad Bulletin-board.

source: The Toolbars
es: Las barras de herramientas

source: Main toolbar
es: Barra de herramientas principal

source: from left to right
es: de izquierda a derecha

source: **Activity-toolbar Button**
es: **Botón Actividad**

source: (toolbar described below)
es: (la barra de herramientas se describe a continuación)

source: **Previous-slide Button**
es: **Botón Diapositiva anterior**

source: returns to the previous slide shown (also activated by typing <Ctrl-p>)
es: vuelve a la diapositiva anterior(también activado tecleando <Ctrl-p>)

source: **Next-slide Button**
es: **Botón Diapositiva próxima**

source: goes to the next slide in the sequence (also activated by typing <Ctrl-n>)
es: va a la diapositiva siguiente de la secuencia (también activado tecleando <Ctrl-n>)

source: **Auto-play Button**
es: **Botón Cambiar automaticamente**

source: starts a slide show with a user-settable pause between each slide
es: inicia una presentación de diapositivas con una pausa configurable por el usuario entre cada diapositiva

source: **Customize-toolbar Button**
es: **Botón Personalizar**

source: **Record-toolbar Button**
es: **Botón de Grabacion**

source: **Portfolio-view Radio Button**
es: **Button Visualizar**

source: used to switch to portfolio view (default)
es: utilizado para cambiar a la vista de presentacion (por defecto)

source: **Thumbnail-view Radio Button**
es: **Boton Miniaturas**

source: used to switch to thumbnail view, where you can reorder the sequence of the slides by dragging them
es: utilizado para cambiar a vista en miniatura, donde se puede cambiar el orden de la secuencia de las diapositivas arrastrándolas

source: **Full-screen-view Button**
es: **Boton Pantalla completa**

source: hides the toolbars (Return from full-screen by hitting the Esc key.)
es: oculta las barras de herramientas (Retorno de pantalla completa pulsando la tecla Esc.)

source: **Update-description Button**
es: **Boton actualizar descripción**

source: Used to edit the description of the entry currently being viewed (Note: use the Save-annotations Button to make these edits permanent).
es: Se utiliza para editar la descripción de la entrada que se está viendo (Nota: utiliza el botón Grabar-anotaciones para hacer estos cambios permanentes).

source: **Stop Button**
es: **Botón Salir**

source: used to exit the activity
es: utilizado para salir de la actividad

source: Activity Toolbar
es: Barra de herramientas Actividad

source: **Activity name field**
es: **Nombre de la Actividad**

source: used to change the name of the activity (The name is used by the save-to-PDF Button.)
es: utilizado para cambiar el nombre de la actividad (El nombre es utilizado por el botón de guardar en PDF. )

source: **Share Button**
es: **Boton Compartir**

source: as shown, disabled (Portfolio Activity version since v27 support sharing: joiners can add comments)
es: como se muestra, deshabilitado (la Actividad Obras soporta desde la version 27 agregar comentarios por de quienes comparten la actividad)

source: **Reflection Button**
es: **Botón Descripción**

source: used to write descriptions for the Journal entry of this instance of Portfolio
es: utilizado para escribir las descripciones para la entrada Diario de esta instancia de Obras

source: **Save-to-PDF Button**
es: **Botón Grabar como PDF**

source: used to save a copy of your presentation to the Sugar Journal as an PDF document
es: se utiliza para guardar una copia de tu presentación en el Diario de Sugar como un documento PDF

source: **Save-annotations Button**
es: **Botón Grabar anotaciones**

source: used to save updates to the Journal entry descriptions
es: se utiliza para guardar cambios a las descripciones de las entradas del diario

source: Options Toolbar
es: Barra Opciones

source: **Timer Combo-box**
es: **Selección de Tiempo**

source: lets you select a delay time between slides when using auto play (Choose two-seconds, ten-seconds, thirty-seconds, or one-minute delay).
es: te permite seleccionar un tiempo de retardo entre las diapositivas cuando se utiliza la reproducción automática (Elije entre dos segundos, diez segundos, treinta segundos, o un minuto).

source: **Refresh Button**
es: **Botón Actualizar**

source: scans the Journal to pull in any changes made since the Portfolio activity was launched.
es: escanea el Diario para obtener los cambios realizados desde que se puso en marcha la actividad Obras.

source: Recording Toolbar
es: Barra de herramientas de grabación

source: **Record Button**
es: ** Botón de grabación **

source: used to record an audio note associated with the current slide
es: se utiliza para grabar una nota de audio asociado con la diapositiva actual

source: **Playback Button**
es: **Botón de reproducción**

source: active when there is audio associated with the current slide
es: activo cuando hay audio asociado con la diapositiva actual

source: **Save Button**
es: **Botón Guardar**

source: active when there is a new recording to save
es: activo cuando hay una nueva grabación para guardar

source: Saving to PDF
es: Guardando en PDF

source: Each time your launch the Portfolio activity, it will update to reflect the current contents of your Journal. If you want to save a portfolio that represents a particular moment in time (or you want to share your portfolio with someone else), you need to save it as a PDF document. Click on the "Save as PDF" Button from the Activity toolbar menu and the content of the portfolio will be saved as a document in the Journal.
es: Cada vez que inicias la actividad Obras, se actualizará para reflejar el contenido actual de tu Diario. Si deseas guardar Obras que representan un momento particular en el tiempo (o deseas compartir tu cartera con otra persona), es necesario guardarlo como un documento PDF. Haz clic en el botón "Guardar como PDF" en el menú de la barra de herramientas de actividad y el contenido de la cartera se guardará como un documento en el Diario.

source: **Tip:** Open your Journal to make sure the portfolio has been saved.
es: **Consejo:** Abra tu Diario para asegurarte de que las Obras se han guardado.

source: **Tip:** You may want to copy the PDF file to a USB to open it in a different XO, or any other computer, using the Browse or Read activity.
es: **Consejo:** Es posible que desees copiar el archivo PDF a un USB para abrirlo en una XO diferente, o cualquier otro ordenador, utilizando la actividad Navegar o Leer.

source: Learning with Portfolio
es: Aprendiendo con Obras

source: Most education experts agree that the best approach to learning involves doing and then stepping back to reflect on the doing: What did I learn? How can I use that? What questions do I have?1 By helping children to ask good questions about the things they’ve done, as opposed to remembering the right answers, we are helping them to build the critical thinking skills that enable them to be independent problem solvers. Without reflection, learning is an open loop, and an open-loop system can neither identify and correct errors nor adapt to change.
es: La mayoría de los expertos estan de acuerdo en que la mejor aproximación al aprendizaje involucra hacer y luego hacer un paso atrás para reflexionar acerca de lo hecho ¿Que aprendí? ¿Como ppuedo usarlo? ¿Que preguntas tengo? Ayudando a los estudiantes a hacerse buenas preguntas acerca de las cosas que han hecho, en oposición a recordar las respuestas correctas, los estamos ayudando a construir sus herramientas de pensamienento crítico que los habilitará a ser personas que resuelven problemas independientemente.Sin reflexión, el aprendizaje es un bucle abierto, y un sistema de bucle abierto no puede identificar ni corregir errores, ni adaptarse al cambio.

source: Sugar facilitates reflective learning by ensuring that everything a child does is recorded in an electronic journal which includes screen capture of a child’s work. After every activity, children are encouraged to share their observations, which are recorded in an electronic portfolio. From this record of activities, children can expand their portfolio into a multimedia narrative that shows what they have done, how they have done it and what their thoughts are on what they have created—children essentially become curators of their own work. The child’s process of telling about what they have learned as a “story” is a simple way to help reflection become a norm in their education.
es: Sugar facilita el aprendizaje reflexivo, asegurando que todo lo que cada niño hace es guardado en un Diario electrónico, que incluye una captura de pantalla del trabajo del niño. Después de cada actividad, se anima a los niños a compartir sus observaciones, que se registran en un portafolio electrónico.Desde estas grabaciones, los niños pueden expandir ese Portafolio en una narrativa multimedia que muestra lo que han hecho, como lo han hecho y lo que piensan acerca de lo que han creado, convirtiendose en curadores de su propio trabajo. El proceso por el cual el niño cuenta acerca de lo que ha aprendido como una "historia" es una forma simple en la que la reflexión se puede transformar en una norma en su educación.

source: By building upon the automatic accumulation of work in the Sugar journal, the portfolio process can readily be integrated into the classroom routine. It can be used as an assessment tool to help teachers, parents, and school administrators understand better the depth and breadth of what a child has learned.2 At a “portfolio social”, parents could be invited to view presentations and ask children about their learning. The classroom teacher can add addition assessment slides to the portfolio addressing themes such as work habits and personal growth. This can become part of an archive that travels with a child across grade levels. Through juxtaposition, the child and teacher can see what has changed over the course of the years, trends, and areas for improvement.
es: Construyendo desde la acumulación automática de trabajo en el Diario de Sugar, el proceso de Obras puede ser fácilmente integrado en la rutina de la clase. Puede ser utilizado como una herramienta de evaluación para ayudar a los maestros, padres y administradores escolares a comprender mejor la profundidad y amplitud de lo que el niño ha aprendido. En una "muestra de Obras", los padres pueden ser invitados a ver las presentaciones de sus hijos y a hacerles preguntas acerca de su aprendizaje. El maestro puede añadir diapositivas de evaluación de adición a las Obras de abordando temas como hábitos de trabajo y crecimiento personal. Esto puede convertirse en parte de un archivo que viaja con un niño en los diferentes grados. A través de la yuxtaposición, el niño y el maestro pueden ver lo que ha cambiado en el transcurso de los años, las tendencias y las áreas de mejora.

source: It is recommended that periodically (once per week, month, semester) that the children are asked to select and edit items for a portfolio presentation. For example, a weekly presentation could be made to classmates; a monthly one to parents; and perhaps once per semester, a school-wide presentation that makes all of the learning visible to administrators and community members during a social event.
es: Se recomienda que periódicamente (una vez por semana, mes, semestre) que a los niños se les pida que seleccionen y editen elementos de una presentación de Obras. Por ejemplo, una presentación semanal podría hacerse a compañeros de clase; una mensual a los padres; y tal vez una vez por semestre, una presentación de toda la escuela que hace que todo el aprendizaje visible para los administradores y miembros de la comunidad durante un evento social.

source: Periodic PDF snapshots are also a great way to preserve a record of each child's work, and as a vehicle for assessing progress.
es: Archivos PDF son "instantáneas" periódicas y son también una gran manera de preservar un registro del trabajo de cada niño, y como vehículo para evaluar el progreso.

source: Extending Portfolio
es: Extendiendo Obras

source: In addition to using Portfolio as a tool for reflection, it can be used as a more general-purpose presentation tool. For example, a collection of photographs can be annotated (by using the title and description fields in the Journal detail view for each photo) and then made into a slide show. The order of the slides can be modified from the Thumbnail view. Modifying Portfolio
es: Además de utilizar Obras como una herramienta para la reflexión, puede ser utilizado como una herramienta de presentación más de propósito general. Por ejemplo, una colección de fotografías se puede anotar (mediante el uso de los campos de título y descripción en la vista de detalle Diario de cada foto) y luego se convierten en una presentación de diapositivas. El orden de las diapositivas se puede modificar en la vista en miniatura. Modificación de la cartera

source: Manuq made some mock-ups of other layouts. It would be fun to add alternative layout options (or even add support for style sheets).
es: Manuq hizo algunas maquetas de otros diseños. Sería divertido agregar opciones de distribución alternativas (o incluso añadir soporte para hojas de estilo).

source: See http://wiki.sugarlabs.org/go/Activities/Portfolio
es: Ver http://wiki.sugarlabs.org/go/Activities/Portfolio

source: Another idea would be to add the ability to export video from Portfolio.
es: Otra idea sería añadir la capacidad de exportar vídeo desde Portafolio.

source: Your suggestions for enhancements and/or use cases...
es: Sus propuestas de mejoras y / o casos de uso. . .

source: A word to developers
es: Una palabra para desarrolladores

source: Reflection is an important part of learning and a good habit to establish in general. An analog to writing descriptions in the Journal -- the text that is shown in the Portfolio presentations -- is writing commit messages in git. It forces you to stop, reflect, and then articulate to others what you have done and why.
es: La reflexión es una parte importante del aprendizaje y un buen hábito a establecer, en general. Un análogo a las descripciones de escritura en el Diario - el texto que se muestra en las presentaciones de la cartera - es el mensaje mensajes de commit en git. Te obliga a parar, reflexionar, y luego comunicar a los demás lo que has hecho y por qué.

source: Where to report problems
es: Dónde reportar problemas

source: You can report bugs and make feature requests on our bug-tracking system (You need to create an account first). To list all open tickets of Portfolio you can use query component=Portfolio. You are also welcome to leave comments/suggestions on the Talk:Activities/Portfolio page.
es: Puede reportar errores y hacer las peticiones de características en nuestro sistema de seguimiento de errores (Es necesario crear una cuenta en primer lugar). Para una lista de todos los tickets abiertos de Obras puede utilizar componente de consulta = Portafolio. También te invitamos a dejar comentarios y / o sugerencias en http://wiki.sugarlabs.org/index.php?title=Talk:Activities/Portfolio.

source: Credits
es: Créditos

source: Portfolio was written and is maintained by User:Walter. He was inspired in part by the work of BU Prof. Stefanakis.
es: Cartera fué escrita y está mantenida por Walter Bender. Se inspiró en parte por el trabajo de BU Prof. Stefanakis.
