Repository: tony37/sledhelp
Catalog: translated_po/*/read.po
Languages: es

source: Read
es: Leer

source: About
es: Acerca de

source: The Read activity allows the laptop to act as a book reader. It has a simple interface, and will view many kinds of text and image-based book-like materials. It will have particular strengths in handheld mode, with extremely low power consumption and simple navigation controls.
es: La actividad de Lectura permite al ordenador portátil actuar como un lector de libros. Cuenta con una interfaz sencilla, y muestra muchos tipos de texto y materiales como libros basados ​​en imágenes. Contará con fortalezas particulares en el modo e-book, con muy bajo consumo de energía y controles de navegación sencillas.

source: Read can read PDF files, EPUB files, text files and single-page TIFF files.
es: Leer puede leer archivos PDF, archivos EPUB, archivos de texto y archivos TIFF de una sola página.

source: Using
es: Uso

source: The Read activity is launched by opening the Journal and choosing a PDF document. PDFs downloaded from Browse can be opened in this way, as can PDFs on an external storage device. The user may also start Read from the Home page Favorites circle and select a file to read. The book opens in a portrait orientation.
es: La actividad de Lectura se puso en marcha con la apertura del Diario y la elección de un documento PDF. Archivos PDF descargados con Browse se pueden abrir de esta manera, al igual que los archivos PDF en un dispositivo de almacenamiento externo. El usuario también puede iniciar Leer desde la Vista de Inicio y seleccionar un archivo para leer. El libro se abre en una orientación vertical.

source: Navigation
es: Navegación

source: When the screen is in the upright position, the keyboard is available for navigation as well as the directional pad and games keys. When the screen is in tablet mode, the keyboard is not available. Make sure the document canvas is selected (and not the tool-bar menu) by clicking either in the page area, or pressing the TAB key until focus moves out of the toolbar.
es: Cuando la pantalla está en la posición vertical, el teclado está disponible para la navegación, así como la almohadilla direccional y teclas de juegos. Cuando la pantalla está en modo tablet, el teclado no está disponible. Asegúrese de que el lienzo del documento está seleccionada (y no el menú de la herramienta-bar) haciendo clic ya sea en el área de la página, o pulsando la tecla TAB hasta que el foco se mueve fuera de la barra de herramientas.

source: **Keyboard Navigation:**
es: **Navegación con Teclado:**

source: The arrow keys will scroll the page a few lines in any direction
es: Las teclas de flecha desplazarán la página unas pocas líneas en cualquier dirección

source: ALT + arrow keys, or screen direction pad, will scroll the page a small amount in any direction
es: ALT + teclas de flecha, o el de pad de dirección en la pantalla, desplazarán la página una pequeña cantidad en cualquier dirección

source: FN + arrow keys up/down will move one page up or down (with a small overlap to keep context)
es: Teclas Fn + flecha arriba / abajo moverá una página hacia arriba o hacia abajo (con un pequeño solapamiento para mantener el contexto)

source: FN + arrow keys right/left will jump to the start or end of the document
es: Teclas Fn + flecha derecha / izquierda saltará al inicio o al final del documento

source: The keys h, j, k, l also act as left, down, up, right
es: Las teclas h, j, k, l también actúan como izquierda, abajo, arriba, derecha

source: **Screen GamePad and Directional Button Navigation**
es: **GamePad de pantalla y Botones direccionales de navegación**

source: The screen rotation key (the bottom key on the left side of the screen) will turn the screen image to accommodate tablet use.
es: La tecla de rotación de pantalla (la tecla inferior en el lado izquierdo de la pantalla) gira la imagen de la pantalla para dar cabida a la utilización de la tableta.

source: The directional pad on the left hand side of the screen will also scroll a few lines
es: El pad direccional en el lado izquierdo de la pantalla también se desplazará a unas pocas líneas

source: On the right hand side of the screen the gamepad buttons 'circle' and 'cross' also act as page up and page down (with a small overlap to keep context).
es: En el lado derecho de la pantalla los botones del gamepad 'círculo' y 'cruz' también actúan como página arriba y página abajo (con un pequeño solapamiento de mantener contexto).

source: The gamepad buttons 'square' and 'tick' act as a zoom in and zoom out
es: Los botones del gamepad "Cuadrado" y "tick" actuan acercando y alejando el zoom

source: **Brightness Control**
es: **Control de brillo**

source: The brightness can be increased or decreased with the keys
es: El brillo puede ser aumentado o disminuido con las teclas

source: Clarity is improved in tablet mode (turning the screen and laying it flat) by using monochrome mode. Select CTRL + Brightness keys to turn it on or off.
es: La claridad se mejora en modo tablet (girando la pantalla y colocándola horizontalmente) con el modo monocromo. Seleccione las teclas CTRL + Brillo para encenderla o apagado.

source: Monochrome outside is easier to view books (CTRL Brightness Down)
es: Es más fácil de ver los libros en el exterior en modo Monocromo (CTRL Brillo Bajar)

source: Be aware that large books may open and scroll slowly.
es: Ten en cuenta que los libros grandes pueden abrir y desplazarse lentamente.

source: Applying
es: Aplicando

source: The GetBooks Activity provides a way to expand access to many of the free books available worldwide. The 'My Documents' folder appears at the bottom of the screen when you are using Journal. Books can be stored in the My Documents folder for easier cataloging.
es: La Actividad GetBooks ofrece una manera de ampliar el acceso a muchos de los libros gratuitos disponibles en todo el mundo. La carpeta 'Mis documentos' aparece en la parte inferior de la pantalla cuando está el usando Diario. Los libros pueden ser almacenados en la carpeta Mis documentos para la catalogación fácil.
