Repository: tony37/sledhelp
Catalog: translated_po/*/record.po
Languages: es

source: Record
es: Grabar

source: About
es: Acerca de

source: The Record Activity is used for recording audio and video and for taking pictures. You will need to have a built in, or an attached, microphone and/or camera to use Record.
es: La actividad Grabar se utiliza para la grabación de audio y vídeo y para la toma de fotografías. Necesitas tener un micrófono interno, o externo y / o una cámara para usar Grabar.

source: If your computer has no built in camera, or an unsuitable camera attached, then Record, will open in *Record audio* mode only.
es: Si tu equipo no tiene cámara incorporada, o una cámara conectada, entonces Grabar, se abrirá en modo de *grabación de audio* unicamente.

source: Quick start
es: Inicio rápido

source: There are three record or capture modes. Select **one** of these buttons to chose your Record mode.
es: Hay tres modos de grabación o captura. Seleccione **uno** de estos botones para elegir el modo de grabación.

source: The image above shows the buttons of the three *Record* modes, they are:
es: La imagen de arriba muestra los botones de los tres modos de *Grabar*, que son:

source: Picture camera mode
es: El modo de cámara de fotos

source: Video camera mode
es: El modo de cámara de vídeo

source: Audio, or sound mode
es: Audio, o el modo de sonido

source: This is the *Record* or capture button |Capture| in the centre of the screen, below *main image*.
es: Este es el botón de captura |Capture| en el centro de la pantalla, bajo la *Imagen principal*.

source: The main image shows what will be captured. Record will capture whatever is in front of the camera in *Picture camera* mode, or *Video camera* mode, and will capture whatever the microphone can detect, when in *Audio* mode.
es: La imagen principal muestra lo que se va a capturar. Grabar captura lo que está en frente de la cámara en el modo de *Cámara de fotos* o *Cámara de vídeo*, y capturará cualquiera lo que el micrófono puede detectar, cuando en esté en *Modo de Audio*.

source: **Tip** As always in Sugar, if you are not sure what a button will do, hover the cursor over it, to reveal its function.
es: ** Tip ** Como siempre en Sugar, si no estás seguro de lo que va a hacer un botón, sitúa el cursor sobre él, para revelar su función.

source: Record features in detail
es: Características de Grabar en detalle

source: **Toolbar and capture buttons explained**
es: **Barra de herramientas de captura y botones explicados**

source: Activity tab. In the first field name the page or project. The Description button allows you to add a description to the :doc:`/journal` entry. Thirdly select Private, or My Neighbourhood, see :ref:`Sharing Media`.
es: Barra de Actividad. En el primer campo el nombre de la página o proyecto. El botón Descripción te permite añadir una descripción para la entrada en el :doc:`/journal`. En tercer lugar selecciona Privado o Mi Vecindario, ver: :ref:`Sharing Media`.

source: Picture camera mode is selected.
es: Se selecciona el modo de cámara de imagen.

source: Video camera mode button. Press to switch to Video camera mode.
es: Boton de modo cámara de video. Pulsa para cambiar al modo de cámara de vídeo.

source: Audio recording mode button. Press to switch to Audio recording mode.
es: Botón de modo de grabación de audio. Pulse para cambiar al modo de grabación de audio.

source: Select timer button. Press this button to engage a delay before taking a picture. Available delay options are, *Immediate*, *5 seconds*, or 10 secomds.
es: Botón de seleccion del temporizador. Presiona este botón para activar un retraso antes de tomar una fotografía. Las opciones disponibles de retardo son, *inmediato*, *5 segundos*, o *10 segundos*.

source: Timer duration button. Duration is grayed out in *Picture camera* mode. In *Video* mode and in *Audio* mode press to *Select duration*. Available duration options are 2, 4, 6 minutes.
es: Botón de selección de duración. La duración aparece en gris en el modo de *cámara de fotos*. En el modo de *Vídeo* y en el modo de *Audio* presiona para *Seleccionar la duración*. Las opciones de duración disponibles son 2, 4, 6 minutos.

source: Select quality button. The button is grayed out in *Picture camera* mode, and *Audio* mode. In Video camera mode, press this button to select low or high quality. Experiment and choose whichever gives the best results in your conditions.
es: Botón de seleccion de calidad. El botón está en gris en el modo *cámara de fotos* y en el modo *Audio*. En el modo de cámara de vídeo, pulsa este botón para seleccionar alta o baja calidad. Experimenta y elige el que de los mejores resultados en tus condiciones.

source: This image represents an picture already taken. It is in the area of the screen called the *tray*, which contains thumbnail images.
es: Esta imagen representa una imagen ya tomada. Está en el área de la pantalla llamada la *bandeja*, que contiene imágenes en miniatura.

source: The record or capture button. Once a picture, video, or Audio recording has been captured, it is automaticly saved in the Journal, and the saved image or clip is represented as a thumbnail in the tray.
es: El botón de grabación o captura. Una vez que una imagen, video o grabación de audio ha sido capturado, se guarda automaticamente en el Diario, y la imagen guardada o clip se representa como una miniatura en la bandeja.

source: When the tray is full of images, this button scrolls through the images.
es: Cuando la bandeja está llena de imágenes, este botón permite desplazarse por las imágenes.

source: Stop, or close the application.
es: Detener o cerrar la aplicación.

source: The next section covers Video camera mode, and then Audio recording in more specific detail. However you might now prefer to follow on to :ref:`Viewing, saving and managing your work`.
es: La siguiente sección cubre el modo de vídeo de la cámara, y luego la grabación de audio en detalle más específico. Sin embargo ahora si lo prefieres, puede seguir a :ref:`Viewing, saving and managing your work`.

source: Video camera
es: Cámara de video

source: Activity tab. Here you can enter a name for the project, access the Journal, to provide a description, and select Private, or My Neighbourhood, see :ref:`Sharing Media`.
es: Barra de Actividad. Aquí puedes introducir un nombre para el proyecto, acceder a el Diario, para proporcionar una descripción y seleccione Privada o Mi Vecindario, ver :ref:`Sharing Media`.

source: Picture camera mode button. Press to switch to Picture camera mode.
es: Botón modo de cámara de fotos. Pulsa para cambiar al modo de cámara de fotos.

source: Video camera mode button is selected, and capture or record has been started.
es: Esta seleccionado el botón de modo de cámara de video, y se ha iniciado la captura o registro.

source: Select timer button. Press this button to set a delay before capture, available delay options are, Immediate, 5 seconds, or 10 secomds.
es: Botón de selección de temporizador. Pulsa este botón para establecer un retraso antes de la captura, las opciones de retardo disponibles son, Inmediato, 5 segundos o 10 segundos.

source: Timer duration button. In *Video* mode and in *Audio* mode, press to *Select duration*. Available duration options are 2, 4, 6 minutes.
es: Botón de selección de duración. En el modo de *Vídeo* y en el modo de *Audio* , presione para *Seleccionar la duración*. Las opciones de duración disponibles son 2, 4 y 6 minutos.

source: Select quality button. In Video camera mode, press this button to select low or high quality. Experiment and choose whichever gives the best reults in your conditions.
es: Botón Seleccionar calidad. En el modo de cámara de vídeo, pulse este botón para seleccionar alta o baja calidad. Experimenta y elige el que da los mejores resultados en tus condiciones.

source: Record is in *Sharing* mode, and we have been joined by a collaborator.
es: Grabar esta en modo *Compartir*, y hemos estado unidos con un colaborador.

source: The image, which the other party shared is in the tray, identified by their characteristic colours. See also :ref:`Sharing Media`.
es: La imagen, que la otra parte ha compartido está en la bandeja, identificada por sus colores característicos. Ver también :ref:`Sharing Media`.

source: Time remaining bar. This is the time remaining, from the *Timer duration*, set with **6**.
es: Barra de Tiempo restante. Este es el tiempo que queda, con el * Temporizador de duración *, configurado en **6**.

source: The button to stop capture and to save the video file. Once a recording has been captured, it is automaticly saved in the Journal.
es: El botón para detener la captura y para guardar el archivo de vídeo. Una vez que una grabación ha sido capturada, se guarda automaticamente en el Diario.

source: When you finish recording, the saved video clip will be represented by a thumbnail.
es: Cuando termine de grabar, el videoclip guardado estará representado por una miniatura.

source: The next section is Audio recording. However you might now prefer to follow on to :ref:`Viewing, saving and managing your work`.
es: La siguiente sección es la grabación de audio. Sin embargo ahora si lo prefieres, puedes seguir a :ref:`Viewing, saving and managing your work`.

source: The tool bar items are just as described above.
es: Los elementos de la barra de herramientas son los que se describieron anteriormente.

source: It is always a good idea to enter a name for your file **1** in the Activity tab, so that it is easier to find your work later.
es: Siempre es una buena idea para introducir un nombre para el archivo **1** en la barra de Actividad, de modo que sea más fácil encontrar tu obra posteriormente.

source: If you have a camera, an image **2** appears in the picture window and looks like live video. As the audio file is saved, the image is saved as a snapshot to help identify your audio recording.
es: Si tienes una cámara, una imagen **2** aparecerá en la ventana de la imagen y se verá como vídeo en directo. Cuando se guarda el archivo de audio, la imagen se guarda como una instantánea para ayudar a identificar tu grabación de audio.

source: The Select timer and Timer duration buttons **3** are available, to set a delay before start of recording, and set the duration. You can either leave the audio recording to run for the set duration, or press the stop capture button **4** at any time.
es: Los botones Seleccionar temporizador y duración del temporizador **3** están disponibles, para establecer un retraso antes de inicio de la grabación, y ajustar la duración. Puedes dejar bien la grabación de audio en marcha durante el período de tiempo establecido, o pulsar el botón de parar captura **4** en cualquier momento.

source: As with the photo and video modes, you see an icon for your recording **5** show up in the tray once you are done.
es: Al igual que con los modos de fotografía y vídeo, verás un icono de la grabación **5** aparecer en la bandeja una vez que hayas terminado.

source: Viewing, saving and managing your work
es: Visualización, grabación y organización de tu trabajo

source: Working clock wise from the top left, shows the sequence, to save, name, and inspect an image once it has been taken. This sequence is taken in *Picture camera* mode, but the features are similar in all modes.
es: Mirando en el sentido de las agujas del reloj desde la parte superior izquierda, se muestra la secuencia, para grabar, nombrar, e inspeccionar una imagen una vez que se ha tomado. Esta secuencia se toma en modo *cámara de fotos*, pero las características son similares en todos los modos.

source: The first screen shot, top left, shows the main image in Picture camera mode, while a picture, just taken, has been automatically saved and named in the Journal. It shows up as a thumbnail on the tray. The cursor is hovering on the thumbnail. The automaticly given, temporary name, is “Photo by Sugar Learner” **1**.
es: La primera captura de pantalla, arriba a la izquierda, muestra la imagen principal en el modo de cámara de imagen, mientras que una imagen, que se acaba de tomar, se ha guardado y nombrado de forma automática en el Diario. Se muestra como una miniatura en la bandeja. El cursor está posado sobre la miniatura.

source: When we click the thumbnail, the main image changes to *viewer* mode. Images are viewed and information can be updated.
es: Cuando hacemos clic en la miniatura, laimagen principal cambia a modo de *visualización*. Las imágenes se visualizan y la información puede ser actualizada.

source: A field, in which to enter a title for the photo appears **2**. The title “Cornish village” is entered. Also at this point **2** is the full screen mode button. This will switch the main image to full screen.
es: Un campo en el que se introduce un título para la foto aparece en **2**. También bajo el punto **2** está el botón de modo de pantalla completa. Esto cambiará la imagen principal a pantalla completa.

source: At the bottom right of the main image is a little tab, **3**, which allows you to find out more about the photo that was taken. Now pressing that tab **4** reveals the image information, author, date, and a space to add tags. A tag is a single word that helps categorize an item.
es: En la parte inferior derecha de la imagen principal hay una pequeña pestaña, **3**, que te permite saber más acerca de la foto que se tomó. Al presionar esa pestaña **4** se revela la información de la imagen, el autor, la fecha, y un espacio para agregar etiquetas. Una etiqueta es una palabra que ayuda a categorizar un artículo.

source: The tray displays a history of your previously taken photos. When you have more photos in the tray the *scroll button* **5** scrolls through the images.
es: La bandeja muestra un historial de tus fotos tomadas anteriormente. Cuando tienes más fotos en la bandeja en el botón de desplazamiento *5* se desplaza por las imágenes.

source: To replay a video or audio recording, click the thumbnail of the recording in the tray. When viewing or listening to a clip, if you move your cursor in the main image area, you see small window **6**, representing the output of your camera or microphone. Click on that window to return from *viewer* mode to *capture* mode.
es: Para reproducir un video o grabación de audio, haz clic en la miniatura de la grabación en la bandeja. Al ver o escuchar un clip, si mueves el cursor en la zona principal de la imagen, se ve pequeña ventana **6**, que representa la salida de la cámara o micrófono. Haz clic en la ventana para volver del modo *visualización* al modo de *captura*.

source: The final image is displayed full screen, and can be reduced to normal with the button **7**.
es: La imagen final se mostrará en pantalla completa, y se puede reducir a la normalidad con el botón **7**.

source: Record stores images and audio in the Journal, from which they can be used by other activities, such as Paint, Write, Etoys, and Browse, as well as Memorize and some other games. Images can be copied to a USB storage device from the Journal.
es: Grabar almacena imágenes y audio en el Diario, que pueden ser utilizados por otras actividades, como Pintar, Escribir, Etoys y Navegar, así como Memorizar y algunos otros juegos. Las imágenes se pueden copiar en un dispositivo de almacenamiento USB desde el Diario.

source: Sharing Media
es: Compartiendo multimedia

source: You can share photos, video and audio recordings (these can just be referred to as 'media') with your friends.
es: Puedes compartir fotos, videos y grabaciones de audio (estos pueden ser referidos como "medios de comunicación") con tus amigos.

source: To share media you must first have some media in the tray. We have the image of a Bison in the tray.
es: Para compartir los medios de comunicación, primero debes tener algunos medios de comunicación en la bandeja. Tenemos la imagen de un bisonte en la bandeja.

source: The Activity tab has been opened, the collaboraton button is pressed and "My Neighborhood" selected.
es: La ficha Actividad se ha abierto, se pulsa el botón collaboración y se ha seleccionado "Mi Vecindario".

source: Share, and join Record
es: Compartir y unirse a Grabar

source: Once you have made your Activity available to share, others, looking at their Neighborhood View, see your icon with the Record icon, an eye, close to it. They can now join your Activity by clicking on the Record icon next to your icon.
es: Una vez que haz hecho tu actividad disponible para compartir, los demás, mirando a su Vista de Vecindario, verán tu icono con el icono de Grabar, un ojo, cerca de el. Ahora pueden unirse a tu actividad haciendo clic en el icono de Grabar junto a tu icono.

source: They must then select "Join" and their Record Activity opens with your images in their tray.
es: A continuación, debe seleccionar "Unir" y su actividad Grabar se abre con tus imágenes en su bandeja.

source: Now in Record, thumbnails of both parties are shared. The frame of the thumbnail is in the same colors as the XO icon of the person who took the photo.
es: Ahora en Grabar, las miniaturas de las dos partes se comparten. El marco de la miniatura se muestra con los mismos colores que el icono de XO de la persona que tomó la foto.

source: Images shared
es: Imágenes compartidas

source: On your Frame, you can see the icons of all of the people with whom you are collaborating. You can also see their shared media.
es: En tu marco, se pueden ver los iconos de todas las personas con las que estás colaborando. También puedes ver sus medios compartidos.

source: You can exit a shared Activity at any time.
es: Puedes salir de una actividad compartida en cualquier momento.

source: |more| :doc:`/collaborating` has more information on sharing work in Sugar.
es: |more| :doc:`/collaborating` tiene más información sobre cómo compartir el trabajo en Sugar.

source: Getting creative with Record
es: Siendo creativo con Grabar

source: Record can be used for :
es: Grabar se puede utilizar para:

source: Taking pictures.
es: Tomar fotos.

source: Recording video.
es: Grabación de vídeo.

source: Recording audio.
es: Grabación de audio.

source: Stop-motion photography.
es: Fotografía Stop-motion.

source: Time-lapse photography.
es: Fotografía con períodos de tiempo.

source: Creating 360° panoramas.
es: Creación de panorámicas de 360°

source: Viewing slide shows.
es: Visualización de presentaciones de diapositivas.

source: Storing extra information about audio, video, and pictures.
es: Almacenamiento de información adicional sobre audio, vídeo e imágenes.

source: Things to Try with Record
es: Pruebas a realizar con Grabar

source: You can easily take pictures and make videos by using a built-in, or connected, camera for still photography and video recording. You can also use the camera for video conferencing, which involves talking to others on a video screen knowing that the others can also view your video.
es: Puede tomar fotos y hacer videos con la cámara incluida, o una conectada. También puede utilizar la cámara para videoconferencias, que consiste en hablar con otras personas en una pantalla de vídeo a sabiendas de que los demás también pueden ver el vídeo.

source: You can express yourself with sound, images, and video using the cameras and microphones. You are learning about light, observations, angle, and perspective. By recording the sights and sounds around you, others can learn about you, your culture, and environment. You can communicate with your voice and pictures. You can tell factual or emotional stories with film or pictures to help change perceptions or take action.
es: Puedes expresarte con sonido, imágenes y vídeo utilizando las cámaras y micrófonos. Estarás aprendiendo acerca de la luz, las observaciones, el ángulo y perspectiva. Mediante el registro de las vistas y los sonidos a tu alrededor, otros pueden aprender acerca de ti, ttu cultura, y medio ambiente. Puede comunicarse con tu voz y fotos. Puede contar historias reales o historias emocionantes con película o fotos para ayudar a cambiar las percepciones o tomar medidas.

source: You could also try some of the following :
es: También puedes probar algunos de los siguientes:

source: Use the Record Activity to record your voice with a built-in microphone.
es: Utilize la Actividad Grabar para grabar tu voz con un micrófono incorporado.

source: Take a photo of where you live by aiming the camera lens at your home, and then clicking the circle icon.
es: Toma una foto del lugar donde vives apuntando la lente de la cámara a su casa, y luego haciendo clic en el icono del círculo.

source: Record sounds of your city or town.
es: Grabar sonidos de tu ciudad o pueblo.

source: Record and leave messages for your family.
es: Graba y deja mensajes para tu familia.

source: Teachers - record a message for parents.
es: Profesores - graba un mensaje para los padres.

source: Interview your friends and record it to audio or video.
es: Entrevista a tus amigos y grabalo en audio o vídeo.

source: Make a video diary.
es: Haz un video-diario.

source: Open your photos in the Paint Activity and draw on them.
es: Abre tus fotos en la actividad Pintar y dibuja sobre ellas.

source: Add your pictures to a story using Write.
es: Añade tus fotos a una historia usando Escribir.

source: Upload a picture to Flickr or Wikimedia Commons.
es: Sube una foto a Flickr o a Wikimedia Commons.

source: Attach a picture to an e-mail you send to a friend or family member.
es: Adjunta una imagen a un correo electrónico que envíes a un amigo o miembro de la familia.

source: Take a picture of a flower or plant from the same place every day to show how it changes.
es: Tome una fotografía de una flor o de una planta del mismo lugar todos los días para mostrar cómo cambia.

source: Take a picture of a baby animal every week to show how it grows.
es: Toma una fotografía de un animal bebé cada semana para mostrar cómo crece.
