Repository: tony37/sledhelp
Catalog: translated_po/*/repair.po
Languages: es

source: Repairs
es: Reparaciones

source: Your XO is built and designed for repair work to be completed with only your hands and a screwdriver, and the case includes extra screws in case you need them. Please refer to http://wiki.laptop.org/go/Disassembly for important details on how to start on repairs.
es: Tu XO está construida y diseñada para trabajos de reparación a ser completados con sólo tus manos y un destornillador, y la carcasa incluye tornillos adicionales en caso de que se los necesite. Por favor, consulta http://wiki.laptop.org/go/Disassembly para detalles importantes sobre cómo iniciarte en las reparaciones.

source: For photos and step-by-step instructions on repairing your XO or putting replacement parts in, go to http://wiki.laptop.org/go/Repair.
es: Para fotos e instrucciones paso a paso sobre la reparación de tu XO o como poner piezas de recambio, ve a http://wiki.laptop.org/go/Repair.

source: Refer to http://wiki.laptop.org/go/Repair_center_locations to get to the most recent directory of repair centers, if you do not want to repair your XO yourself.
es: Consulta http://wiki.laptop.org/go/Repair_center_locations para llegar al directorio más reciente de centros de reparación, si no deseas reparar tu XO por ti mismo.

source: Recalibrating the touchpad on the XO 1.0
es: Recalibración del panel táctil en la XO 1. 0

source: If the pointer is not following your finger on the touchpad of a XO 1.0, or if it jumps to the corners when you touch the touchpad, please try this recalibration procedure:
es: Si el puntero no está siguiendo el dedo en el panel táctil de un XO 1.0, o si se salta a las esquinas cuando se toca el panel táctil, por favor intente este procedimiento de recalibración:

source: Hold down the three keys at one time: the upper left, upper right, and lower right of the keyboard and the fourth key, fn, the lower leftmost key, as the last one pressed, and then release them all.
es: Manten pulsadas las tres teclas a la vez: la parte superior izquierda, superior derecha, y abajo a la derecha del teclado y la cuarta tecla, Función, la tecla inferior izquierda , presionada por último, y luego liberaralas a todas.

source: If this doesn't help, try shutting down the laptop and removing the battery for ten seconds before restarting.
es: Si esto no ayuda, trata de apagar el ordenador portátil y de retirar la batería durante diez segundos antes de reiniciar.

source: Finally, plug a standard USB mouse into your laptop to bypass the problem.
es: Por último, conecta un ratón USB estándar en su computadora portátil para evitar el problema.

source: How to do a Keyboard Test
es: Cómo realizar una prueba de teclado

source: Checking for keys that stay down or appear stuck
es: Comprobación de las teclas que se quedan abajo o aparecen pegados

source: Your XO must have a developer's key to do this keyboard test. Refer to http://wiki.laptop.org/go/Developer_key for more information about developer's keys.
es: Tu XO debe tener la clave de un desarrollador para realizar esta prueba teclado. Consulta http://wiki.laptop.org/go/Developer_key para obtener más información acerca de las claves de los desarrolladores.

source: With the XO off, hold down the "check mark" game button (above the power button) while pushing the power button. After start up, the screen displays "Release the game keys to continue" and shows a text diagram of which key is pressed.
es: Con la XO, manten pulsado el botón de juego "check" o tilde (por encima del botón de encendido) mientras presiona el botón de encendido. Después de la puesta en marcha, la pantalla mostrará "Suelta las teclas de juego para continuar" y muestra un diagrama de texto con la tecla presionada.

source: Release the "check mark" game button.
es: Suelta el botón del juego "check".

source: Next, after you see "Type the Esc key to interrupt automatic startup," press the escape key in the upper left hand corner of the keyboard layout (a circle with an x). The XO displays an ok prompt.
es: A continuación, después de ver "Presione la tecla Esc para interrumpir el inicio automático", pulsa la tecla de escape en la esquina superior izquierda del teclado (un círculo con una x). La XO muestra un indicador ok.

source: At the ok prompt, type:
es: En el indicador ok, escribe:

source: and press enter.
es: y pulsa Enter.

source: A blue keyboard map displays on the screen.
es: Un mapa azul teclado aparece en la pantalla.

source: Press keys one at a time to see the keyboard map turn the key light blue.
es: Pulsa las teclas de una en una para ver el mapa del teclado tornar la tecla presionada en azul.

source: If the display on screen shows a light blue key constantly, the keyboard has a problem with that particular key sticking. Refer to a repair center for full diagnosis and repair at http://wiki.laptop.org/go/Repair_center_locations.
es: Si la visualización de la pantalla muestra una tecla azul constantemente, el teclado tiene un problema con esa tecla pegada en particular. Recomendamos ir a un centro de reparación para el diagnóstico y la reparación completa en http://wiki.laptop.org/go/Repair_center_locations.

source: Press the the escape key (circle with an x) again to exit the keyboard test.
es: Pulsa la tecla Escape (círculo con una x) de nuevo para salir de la prueba del teclado.

source: At the ok prompt, type reboot to restart.
es: En el indicador ok, escribe reboot para reiniciar.

source: Repairing damage to the keyboard
es: Reparación de daños en el teclado

source: If your keyboard becomes damaged, normally it has to be replaced. Replacements are available through the repair centers. Information on spare parts and repair centers can be found at http://wiki.laptop.org/go/Repair_center_locations.
es: Si el teclado está dañado, normalmente tiene que ser reemplazado. Los repuestos se encuentran disponibles a través de los centros de reparación. Información sobre piezas de repuesto y centros de reparación se puede encontrar en http://wiki.laptop.org/go/Repair_center_locations.

source: Troubleshooting the internal XO hardware
es: Solución de problemas del hardware interno de la XO

source: The XO can give you information about possible repairs that are needed.
es: La XO le puede dar información acerca de las posibles reparaciones que sean necesarias.

source: Start by pressing the power button for a second, and then answer the following questions. Does the Power LED half-circle light up?
es: Comienza presionando el botón de encendido durante un segundo, y luego responde a las siguientes preguntas. ¿El LED semicircular de alimentación se enciende?

source: When the power button is pressed once, and the power LED doesn't turn on, first try resetting it.
es: Cuando se pulsa el botón de encendido una vez, y el LED de encendido no se enciende, primero trata de restablecerlo.

source: To reset the XO, remove all power sources from the laptop:
es: Para restablecer la XO, retira todas las fuentes de alimentación del ordenador portátil:

source: Take the battery out and remove the power adapter.
es: Saca la batería y retira el adaptador de corriente.

source: Wait two minutes. This allows embedded hardware to lose all power and reset itself.
es: Espere dos minutos. Esto permite al hardware incrustado perder todo el poder y restablecerse.

source: Replace at least one source of power, either the battery or power adapter, and watch the power/battery LED while you do so.
es: Reemplaza al menos una fuente de alimentación, el adaptador de batería o alimentación, y ver el LED de alimentación / batería mientras lo hace.

source: The battery LED should flash orange momentarily (about a quarter of a second) when power is first reapplied. If you do not see this flash, you either have a motherboard hardware problem or faulty EC firmware installed. Contact a repair center for assistance.
es: El LED de batería debe parpadear momentáneamente naranja (alrededor de un cuarto de segundo) cuando la energía se vuelve a aplicar primero. Si no ves este flash, o bien tienes un problema de hardware de la placa base o un firmware EC defectuoso instalado. Pónte en contacto con un centro de reparación de asistencia.

source: If the power LED doesn't turn on or flash, but the laptop proceeds to illuminate the backlight and even start, the problem may be either the LEDs themselves or the power LED driver. The LEDs are in series, so if one fails they may both fail to light.
es: Si el LED de alimentación no se enciende ni parpadea, pero el portatil ilumina la luz de fondo de l pantalla e incluso arranca, el problema puede ser los propios LED o el driver de energía del LED. Los LEDs están en serie, por lo que si uno falla pueden fallar ambos.

source: On rare occasions, the power button becomes stuck mechanically. In this case, the laptop does not detect the depression of the power button, and does not turn on. Ensure that the power button is moving freely by pressing it a few times.
es: En raras ocasiones, el botón de encendido se queda atrapado mecánicamente. En este caso, el ordenador portátil no detecta la depresión del botón de encendido, y no se enciende. Asegúrate de que el botón de encendido se mueve libremente pulsandolo un par de veces.

source: If the battery LED flashed on restoration of power and the power button isn't stuck, and no other signs of life are detected, then you can't determine the reason for failure. Contact a repair center for assistance. Does the display light up?
es: Si el LED de la batería se encendió cuando se restaura la energía y el botón de encendido no se ha quedado atascado, y no se detectan otros signos de vida, entonces no se puede determinar el motivo del error. Pónte en contacto con un centro de reparación de asistencia. ¿Se enciende la pantalla?

source: After starting the XO and viewing the power LED, the next visible feedback from the XO is that the display lights up. The LCD display should be initialized with white, then begin to show text or graphics. The backlight for the screen should be turned on, even if the backlight was previously turned off.
es: Después de iniciar el XO y ver el LED de alimentación, la siguiente retroalimentación visible desde la XO es que se ilumine la pantalla. La pantalla LCD debe ser inicializado en blanco y luego comienza a mostrar texto o gráficos. La retroiluminación de la pantalla debe estar encendida, incluso si la luz de fondo se apagó previamente.

source: If this does not happen then the boot sequence may not be operating correctly. Next, look at the Microphone activity LED to see if it is lit. If the power LED and the microphone LED are both lit then a serious boot error has occurred and you should contact a repair center for assistance. Can you hear the startup sound when the XO starts?
es: Si esto no sucede, entonces la secuencia de arranque no esté funcionando correctamente. A continuación, consulte si se enciende el LED de actividad del Micrófono. Si el LED de encendido y el LED del micrófono están ambos encendidos entonces se ha producido un error en el arranque serio y te debes ponerse en contacto con un centro de reparación de asistencia. ¿Puedes oír el sonido de inicio cuando el XO comienza?

source: If the startup sound does not play, this usually indicates a problem that a repair center needs to fix. Yes, the startup sound plays
es: Si el sonido de inicio no se reproduce, esto suele indicar un problema que un centro de reparación necesita arreglar. Sí, sonido de inicio se escucha

source: If the display doesn't initialize, but the boot sound plays, then this is probably a problem with the display. No, the XO boots normally, but no boot sound plays
es: Si la pantalla no inicia, pero el sonido de arranque se escucha, entonces este es probablemente un problema con la pantalla. No, el XO inicia normalmente, pero no reproduce el sonido de arranque

source: If no boot sound is played, but the machine boots normally and has audio, it is possible that the default boot volume to has been changed to 0. While the boot sound is playing, you can adjust the volume using the volume adjust keys. This modified volume setting is saved and used for future boots. Try increasing the volume right after starting the laptop a few times, and see if the boot sound returns.
es: Si no se reproduce ningún sonido de arranque, pero la máquina arranca normalmente y tiene audio, es posible que el volumen de arranque por defecto se haya cambiado a 0. Mientras que el sonido de arranque está sonando, puedes ajustar el volumen mediante las teclas de ajuste de volumen. Este ajuste de volumen modificado se guardará y utilizará para los inicios futuros. Intenta aumentar el volumen justo después de arrancar el ordenador portátil un par de veces, y ver si el sonido de arranque retorna.

source: If no boot sound is played, and the machine boots normally but has no audio see http://wiki.laptop.org/go/XO_Troubleshooting_AV. Does the display remains blank after starting up?
es: Si no se reproduce ningún sonido de arranque, y la máquina arranca normalmente, pero no tiene audio ve http://wiki.laptop.org/go/XO_Troubleshooting_AV . ¿La pantalla permanece en blanco después de la puesta en marcha?

source: Sometimes the display is active (including backlight), but no text or graphics appear. This problem can be caused by removing the power to an XO while it is upgrading the firmware. You should contact a repair center for assistance. Does the display say "Connect power to proceed"? Sometimes a firmware update requires two sources of power, both a battery and a power adapter. If this is the problem, provide both sources of power and reboot. The XO should proceed with a firmware update and boot normally. Is the display is showing an XO icon only?
es: A veces la pantalla se activa (incluida la retroiluminación), pero no hay texto ni gráficos. Este problema puede ser causado por la eliminación de la alimentación a una XO mientras se está actualizando el firmware. Debes contactar a un centro de reparación de asistencia. ¿La pantalla dice "Connect power to proceed"? A veces, una actualización de firmware requiere de dos fuentes de alimentación, tanto una batería y un adaptador de corriente. Si este es el problema, proporcionar ambas fuentes de poder y reinicia. La XO debe proceder con una actualización de firmware y arrancar normalmente. ¿La pantalla muestra un icono XO solo?

source: This means that the XO has started the startup process.
es: Esto significa que la XO ha comenzado el proceso de inicio.

source: You can see much more information about your Open Firmware by holding the "check mark" game button (above the power button) after powering on. That makes Open Firmware display more detailed messages about what it is doing during the secure boot process (including early boot messages from the Linux kernel). The messages are in English only. Is it showing an XO icon with a serial number and three icons below it?
es: Se puede ver mucha más información acerca de tu Open Firmware manteniendo pulsado el botón del juego "check" (por encima del botón de encendido) después de encender. Eso hace que el Open Firmware muestre mensajes más detallados acerca de lo que está haciendo durante el proceso de arranque seguro (incluyendo mensajes de arranque iniciales del núcleo de Linux). Los mensajes están en Inglés solamente. ¿Se muestra un icono XO con un número de serie y tres iconos debajo de ella?

source: If the laptop powers up, but stops when displaying the XO icon in the middle of the screen, followed by a serial number (e.g. CSN74902B22) and three icons (SD disk, USB disk, Network signal strength), it is looking for its activation lease. This should eventually print "Activation lease not found" at the top of the screen and power-off soon thereafter.
es: Si l portatil se inicia, pero se detiene cuando se muestra el icono de XO en el centro de la pantalla, seguido por un número de serie (e. g. CSN74902B22) y tres iconos (disco SD, disco USB, intensidad de la señal de red), es que está en busca su clave de activación. Esto a la larga debe imprimir "Activation lease not found" en la parte superior de la pantalla y el apagado poco después.

source: The solution is to re-activate the laptop. Obtain a copy of the lease (or a new lease) from your country activation manager, place it (named "lease.sig") in the top-level directory of a USB key and boot the laptop. See the "what to do with activation keys" section within: http://wiki.laptop.org/go/Activation_and_Developer_Keys. Is it showing an XO icon with a "sad face" above it?
es: La solución es volver a activar el ordenador portátil. Obten una copia de la clave de activación (o una nueva clave de activación) del gerente de activación de tu país, (un archivo llamado "lease.sig ") colócalo en el directorio de nivel superior de una llave USB y arrancar el ordenador portátil. Ve la sección "¿qué hacer con las llaves de activación" en: http://wiki.laptop.org/go/Activation_and_Developer_Keys. ¿Se muestra un icono XO con una "cara triste" por encima de ella?

source: This means that Open Firmware couldn't find a signed operating system on the internal flash memory. Firmware bootup also looks on USB memory sticks and SD cards for signed operating system software.
es: Esto significa que Open Firmware no pudo encontrar un sistema operativo firmado en la memoria flash interna. El arranque de firmware también ve en memorias USB y tarjetas SD para obtener software de sistema operativo firmado.

source: Try upgrading or re-installing the software: http://wiki.laptop.org/go/Secure_Upgrade. XO icon with a single dot below it?
es: Intenta actualizar o volver a instalar el software: http://wiki.laptop.org/go/Secure_Upgrade. ¿Hay un Icono de XO con un solo punto por debajo de ella?

source: If the XO powers up, but stops when just displaying the XO icon in the middle, with a single dot below it, it means that something was wrong when the Linux operating system started. When this happens, try upgrading or reinstalling the XO. If this has happened to the same XO more than one time, consider a repair center for full diagnosis and repair at http://wiki.laptop.org/go/Repair_center_locations.
es: Si la XO se enciende, pero se detiene cuando acaba de mostrar el icono de XO en el medio, con un solo punto por debajo de ella, significa que algo andaba mal cuando el sistema operativo Linux empezó. Cuando esto sucede, trate de actualizar o reinstalar el XO. Si esto ha ocurrido a la misma XO más de una vez, considera un centro de reparación para el diagnóstico y la reparación completa http://wiki.laptop.org/go/Repair_center_locations.
