Repository: tony37/sledhelp
Catalog: translated_po/*/restructuredtext.po
Languages: es

source: Writing in reStructuredText
es: Escribiendo en reStructuredText

source: This page is a short primer and cheat sheet for the markup language we are using in :doc:`/how_to_help`. The rst format is easy to create and we are using a part of it only.
es: Esta página es una breve introducción y hoja de trucos para el lenguaje de marcado que estamos utilizando en :doc:`/ how_to_help`. El formato rst es fácil de crear y estamos utilizando una parte del mismo solamente.

source: Titles
es: Títulos

source: Links
es: Enlaces

source: To create links where the text displayed in the page is different to the link you should do:
es: Para crear enlaces en los que el texto que aparece en la página es diferente a el link hay que hacer:

source: You will find `ASLO <http://activities.sugarlabs.org>`_ here.
es: Tu encontrarás `ASLO <http://activities.sugarlabs.org>`_ aquí.

source: Links within Help
es: Los enlaces dentro de Ayuda

source: This link, :ref:`my-reference-label` links to the top paragraph of this document.
es: Este enlace, :ref:`my-reference-label` enlaza al párrafo superior de este documento.

source: To see how this works, ``.. _my-reference-label:`` appears on line 7 of restructuredtext.rst.
es: Para ver cómo funciona esto, ``.. _my-reference-label:`` aparece en la línea 7 de restructuredtext.rst.

source: Secondly, this page contains more about terms and words used in sugar. :doc:`/glossary`
es: En segundo lugar, esta página contiene información sobre los términos y palabras que se usan en Sugar :doc:`/ glossary`

source: Lists
es: Listas

source: Lists are simple
es: Las listas son simples

source: First item
es: Primer elemento

source: Second item
es: Segundo punto

source: Last item
es: Último artículo

source: or numbered:
es: o numeradas:

source: One item
es: Uno de los puntos

source: Another item
es: Otro elemento

source: The last one
es: El último de ellos

source: Simple table
es: Tabla simple

source: Inputs
es: Entradas

source: Output
es: Salida

source: A or B
es: A o B

source: Images
es: Imágenes

source: An image can be included like this:
es: Una imagen puede ser incluido como esto:

source: Icons and small images
es: Los iconos y las imágenes pequeñas

source: |Neighborhood_key| This is the sharing option.
es: |Neighborhood_key| Esta es la opción para compartir.

source: |Home_key_f3_small| This is the Private option.
es: |Home_key_f3_small| Esta es la opción privada.

source: Adding a note
es: Adición de una nota

source: When you are required to place the first readable character at point 3 or 4 in the line, it is recommended to check if you are required to insert spaces or Tab.
es: Cuando usted está obligado a colocar el primer carácter legible en el punto 3 o las 4 de la línea, se recomienda comprobar si se le requiere insertar espacios o Tab.

source: And also
es: Y también

source: Notice that first readable character of this note is under the "s", three spaces preceed it.
es: Observe que el primer carácter legible de esta nota está bajo la "s", tres espacios lo precedió.

source: |more| There are links to :ref:`Further reading` at the foot of the page :doc:`/how_to_help`
es: |more| Hay enlaces a :ref:`Further reading` al pie de la página :doc:`/how_to_help`
