Repository: tony37/sledhelp
Catalog: translated_po/*/schoolserver.po
Languages: es

source: XS school server
es: Servidor de la escuela XS

source: Overview
es: Introducción

source: The XO school Server, or XS, is one of the products of the OLPC project, designed to complement the XO laptop. The XS is installed on x86 (Intel-compatible) computers. These could be conventional servers such as rack-mounted computers, purpose-built low-power machines, or even netbooks.
es: El servidor de la escuela XO, o XS, es uno de los productos del proyecto OLPC, diseñado para complementar la laptop XO. El XS es instalado en ordenador x86 (Intel-compatible). Estos podrían ser los servidores convencionales, tales como ordenadores montados en bastidor, máquinas de baja potencia especialmente diseñados, o incluso netbooks.

source: The OLPC XS provides additional infrastructure extending the capabilities of the laptops. While the laptops are self-sufficient for many learning activities, other activities and services depend on the XS providing connectivity, shared resources and services. The XS provides XO machines with network connectivity for backups, anti-theft leases, web browsing, system, content updates, and asynchronous collaboration tools such as Moodle.
es: La OLPC XS proporciona infraestructura adicional ampliando las capacidades de los ordenadores portátiles. Mientras que las computadoras portátiles son autosuficientes para muchas actividades de aprendizaje, otras actividades y servicios dependen de la conectividad provista por el XS, recursos y servicios compartidos. El XS ofrece a las máquinas XO conectividad de red para copias de seguridad, sistema antirrobo, navegación web, actualizaciones de contenido y herramientas de colaboración asincrónica como Moodle.

source: Installation
es: Instalación

source: Two installation options are available:
es: Dos opciones de instalación están disponibles:

source: XS installation CD (recommended): download and burn a CD image, and use the resultant CD to install the system. See details at http://wiki.laptop.org/go/XS_Installing_Software_0.7#Installing_from_CD
es: CD de instalación XS (recomendado): descargar y grabar una imagen de CD, y utilizar el CD resultante para instalar el sistema. Ver detalles en http://wiki.laptop.org/go/XS_Installing_Software_0.7#Installing_from_CD

source: On top of another system (advanced): install the XS software packages on top of an existing operating system installation. See details at http://wiki.laptop.org/go/XS_Installing_Software_0.7#Installing_on_top_of_existing_OS_installation
es: Instalar sobre otro sistema (avanzado): instalar los paquetes de software XS sobre una instalación de sistema operativo existente. Ver detalles en http://wiki.laptop.org/go/XS_Installing_Software_0.7#Installing_on_top_of_existing_OS_installation

source: The installation is fairly straight forward and requires minimal configuration after the initial installation to the XS hard drive.
es: La instalación es bastante sencillo y requiere un mínimo de configuración después de la instalación inicial en el disco duro XS.

source: Configuration
es: Configuración

source: Configuring the XS involves choosing a server domain name. The hostname is always 'schoolserver'. So, using a domain name like example.org will give you schoolserver.example.org.
es: La configuración de la XS implica la elección de un nombre de dominio del servidor. El nombre de host es siempre 'schoolserver'. Por lo tanto, el uso de un nombre de dominio como ejemplo.org le dará schoolserver.ejemplo.org.

source: The XS has a fairly standard server-style networking setup. The XS provides DHCP and DNS services to all the XOs connected to it via a wireless access point. However, if the school already has its own network running its own DHCP services, the XS networking can be modified to work with the existing infrastructure. The XS can work with two Ethernet cards, where one works as a WAN interface, while the other works as the LAN interface. The XS can also work with a single Ethernet card where it works as a LAN interface for schools without WAN (Internet) connectivity. Optionally, such a server can provide WAN connectivity using a USB-to-Ethernet adapter.
es: El XS tiene una configuración bastante estándar de red de estilo servidor. El XS ofrece servicios DHCP y DNS a todas las XO conectados a él a través de un punto de acceso inalámbrico. Sin embargo, si la escuela ya cuenta con su propia red que ejecute sus propios servicios DHCP, la red XS puede ser modificada para que funcione con la infraestructura existente. El XS puede trabajar con dos tarjetas de red, donde se trabaja como una interfaz WAN, mientras que la otra obra como la interfaz LAN. El XS también puede trabajar con una sola tarjeta de red Ethernet, donde funciona como una interfaz LAN para las escuelas sin conectividad WAN (Internet).Opcionalmente, un servidor de este tipo puede proporcionar conectividad WAN utilizando un adaptador de USB a Ethernet.

source: Services
es: Servicios

source: Collaboration
es: Colaboración

source: The XS provides collaboration services across a variety of activities. When XOs are connected to the School Server, the collaboration is managed through the server and can be segmented by a classroom or a group. While the user will not see anything different, the capacity of collaboration will scale up considerably with a XS in the mix.
es: El XS proporciona servicios de colaboración a través de una variedad de actividades. Cuando los XO están conectados al servidor de la Escuela, la colaboración se gestiona a través del servidor y se puede segmentar por una clase o un grupo. Mientras que el usuario no verá nada diferente, la capacidad de colaboración ampliará considerablemente con una XS en el entorno.

source: The XS uses Squid to cache content locally. At sites where Internet access is limited, slow or expensive, content caching helps in speeding up access to content by making copies on the XS and serving these up locally.
es: El XS utiliza Squid para hacer "caché" al contenido localmente. En los lugares donde el acceso a Internet es limitado, lento o caro, caché de contenido ayuda a acelerar el acceso al contenido al hacer copias en el XS y sirviendo éstos de forma local.

source: Backup and Restore
es: Copia de seguridad y restauración

source: The XS provides seamless backup services for each registered XO. The XS checks to see the backup status of the Journal on each XO and backs it up incrementally. Once the backups are made, these can be used to restore a child's work back on her XO.
es: El XS ofrece servicios de respaldo sin fisuras para cada XO registrado. El XS comprueba el estado de la copia de seguridad del Diario en cada XO y lo respalda de forma incremental. Una vez que se realizan las copias de seguridad, estos pueden ser utilizados para restaurar la obra de un niño de nuevo en su XO.

source: Antitheft Controls
es: Controles antirrobo

source: Antitheft controls lists all registered XOs in one location. additionally, this feature offers rescue leases to laptops to re-activate laptops in case of problems. If a laptop gets stolen, the antitheft control feature shuts it down.
es: Antirrobo controla una listas de todas las XO registrados en un solo lugar. Además, esta característica ofrece arrendamientos de rescate para los ordenadores portátiles para volver a activar las computadoras portátiles en caso de problemas. Si un ordenador portátil es robado, la función de control antirrobo lo apaga.

source: Learning Management System
es: Sistema de Gestión de Aprendizaje

source: Moodle is a Learning Management System that provides the teacher with a way to create a course, manage assignments and administer assessment using a web-based interface. On the XO, the Moodle LMS is accessible via the Browse activity. Moodle features include assignment submission, discussion forums, file downloads, grade books, instant messages, calendars, news, announcements, quizzes and wiki.
es: Moodle es un sistema de gestión de aprendizaje que proporciona al profesor una manera de crear un curso, gestionar y administrar tareas de evaluación mediante una interfaz basada en la web. En la XO, el LMS Moodle es accesible a través de la actividad Navegar. Las características de Moodle incluyen envío de una tarea, foros de discusión, las descargas de archivos, libros de calificaciones, mensajes instantáneos, calendarios, noticias, anuncios, concursos y wiki.
