Repository: tony37/sledhelp
Catalog: translated_po/*/speak.po
Languages: es

source: Speak
es: Hablar

source: **The toolbar buttons explained**
es: **Los botones de la barra explicados**

source: Activity tab. In the first field name the session. The book and pencil icon, the Description button allows you to add a description to the :doc:`/journal` entry. Thirdly select Private, or My Neighbourhood mode.
es: Actividad. En el primer campo está el nombre de la sesión. El icono de un libro y un lápiz, el botón Descripción te permite añadir una descripción a la entrada del :doc:`/journal`. En tercer lugar puedes seleccionar Privada, o el modo Mi Vecindario.

source: Type something to hear robot Alice read it aloud.
es: Escribe algo para escuchar al robot Sara leerlo en voz alta.

source: Ask robot Alice any question.
es: Pregunta al robot Sara cualquier pregunta.

source: Voice chat.
es: Chat de voz.

source: Set language.
es: Establecer idioma.

source: Set pitch of voice and rate of delivery.
es: Ajusta el tono de la voz y el ritmo.

source: Alter shape of eyes and mouth
es: Altera la forma de los ojos y la boca

source: Click the arrow button, and use the up/down arrow keys to scroll back through a history of things you have typed.
es: Haz clic en el botón de la flecha, y utiliza las teclas de flecha arriba / abajo para desplazarte hacia atrás a través de una historia de las cosas que haz escrito.

source: Stop, or close the Activity
es: Detener o cerrar la Actividad

source: Using
es: Uso

source: Speak is a talking face for the XO laptop. Anything you type will be spoken aloud using the XO's speech synthesizer, espeak. Use the toolbars at the top to change the voice's accent, rate and pitch or the shape of the eyes and mouth.
es: Hablar es una cara que habla en el portátil XO. Todo lo que escribas será dicho en voz alta utilizando el sintetizador de voz de la XO, espeak. Utilize las barras de herramientas en la parte superior para cambiar el acento, ritmo de la voz y el tono o la forma de los ojos y la boca.

source: You can ask Alice a question too.
es: Tu puedes hacerle una pregunta a Sara también.

source: This is a great way to experiment with the speech synthesizer, learn to type or just have fun making a funny face for your XO.
es: Esta es una gran manera de experimentar con el sintetizador de voz, aprender a escribir o simplemente divertirse haciendo una cara divertida para tu XO.

source: After you've adjusted the settings it looks nicer in full-screen mode (Press Alt-Enter to switch).
es: Después de haber ajustado la configuración, se ve mejor en el modo de pantalla completa (Pulse Alt-Enter para cambiar).

source: Use the Journal to resume your Speak activity including all voice, face and history settings.
es: Utilize el Diario para reanudar tu actividad Hablar incluyendo todo, voz, cara e historia.

source: Page suggested improvements
es: Página para sugerir mejoras

source: ... add the ideas.
es: . . . añadir las ideas.

source: Expand voice chat.
es: Ampliar el chat de voz.

source: Where Speak is good
es: Donde Speak es buena

source: Early reading - early writing - with FotoToon
es: Comienzos de lectura - escritura - con FotoToon

source: Reading aloud Help pages
es: La lectura en voz alta de páginas de Ayuda

source: Learn a language
es: Aprender un idioma

source: This is an experimental new page. You can improve it yourself by following :doc:`/how_to_help`, and perhaps borrowing content from http://wiki.laptop.org/go/Speak
es: Esta es una página nueva experimental. Puedes mejorarla tu mismo siguiendo :doc:`/how_to_help` y tomando contenido prestado de http://wiki.laptop.org/go/Speak
