Repository: tony37/sledhelp
Catalog: translated_po/*/starchart.po
Languages: es

source: About
es: Acerca de StarChart

source: |Star_ico| This activity will display a map of the sky showing the position of the visible stars, some of the larger and brighter deep-sky objects (DSOs), the "classical" planets, the sun and the moon.
es: |Star_ico| Esta actividad mostrará un mapa del cielo con la posición de las estrellas visibles, algunos de los objetos más grandes y más brillantes del cielo profundo (DSO), los "clásicos" planetas , el sol y la luna.

source: You may specify a location (longitude and latitude) and the time (including time zone offset from GMT) that you wish to have a plot for. Alternatively, you can get a plot which is updated once a minute showing the current sky.
es: Puedes especificar una ubicación (longitud y latitud) y la hora (incluyendo desplazamiento desde la zona horaria GMT) en que deseas tener el dibujo. Alternativamente, puedes conseguir una imagen que se actualiza una vez por minuto que muestra el cielo actual.

source: You can also learn your way around the sky by using the "Locate" feature to find an object whose name you know or by using the "Identify" feature to get the name of something you see on the chart.
es: También puedes aprender por tu cuenta en el cielo utilizando la función "Buscar" para encontrar un objeto cuyo nombre tu sabes o utilizando la función "Identificar" para obtener el nombre de algo que se ve en la pantalla.

source: If you have access to a small telescope or a pair of binoculars, StarChart can provide a magnified view encompassing 7 degrees of the sky centered on a point you specify.
es: Si tienes acceso a un pequeño telescopio o unos prismáticos, StarChart puede proporcionar una vista ampliada que abarca 7 grados del cielo centrado en un punto que se especifique.

source: The latest version (StarChart 16) can be downloaded from `here <http://activities.sugarlabs.org/en-US/sugar/addon/4300>`_.
es: La última versión (StarChart 16) se puede descargar desde aquí `<http://activities.sugarlabs.org/en-US/sugar/addon/4300>`_.

source: Introduction
es: Introducción

source: StarChart was created by a professional programmer and amateur astronomer who likes to vacation in places far removed from his home town and appreciates the opportunity to view the sky from these places. The XO is a wonderful travel accessory for supporting this sort of thing since it is light, compact and frugal of battery power while providing a reasonably large, reasonably high resolution color display.
es: StarChart fue creado por un programador y astrónomo aficionado profesional al que le gusta ir de vacaciones a lugares muy alejados de su ciudad natal y agradece la oportunidad de ver el cielo desde estos lugares. La XO es un accesorio de viaje maravilloso por apoyar este tipo de planes ya que es ligero, compacto y frugal con la energía de la batería al tiempo que proporciona una pantalla a color razonablemente grande, y con razonablemente alta resolución.

source: This Activity is intended to support the star-gazer who has no instrument better than his own eyes. It can be used as a guide to the sky overhead, as a tool for planning future observations (including observations from a different location) or as a way to reprise the look of the sky as it was at some time in the past.
es: Esta actividad tiene como objetivo apoyar al observador del cielo que no tiene ningún instrumento mejor que sus propios ojos. Se puede utilizar como una guía para el cielo actual, como una herramienta para la planificación de las observaciones futuras (incluyendo observaciones desde una ubicación diferente) o como una forma para repetir el aspecto del cielo como lo fue en algún momento en el pasado.

source: Using Star Chart
es: El uso de StarChart

source: Before you begin
es: Antes de comenzar

source: Be sure your XO has been set to the correct time-zone offset and the correct local time! The astronomical algorithms need to compute GMT (UT) and can't do that if "now" isn't the right time. (This is only an issue if you don't plan to always use "specify time". But it's still an untidy way to operate your computer.)
es: Asegúrate de que tu XO tiene establecido el desplazamiento de zona horaria correcta y la hora local correcta! Los algoritmos astronómicos necesitan para calcular GMT (UT) y no pueden hacer eso si "ahora" no es el momento adecuado. (Esto sólo es un problema si tu no planeas usar siempre "especificar el tiempo". Pero sigue siendo una forma desordenada para operar el equipo. )

source: Installation and set-up
es: Instalación y puesta en marcha

source: For best results, remove any previous version of StarChart you may have installed. Re-start X (hit Ctrl-Alt-Backspace). Then, simply follow the usual procedure for downloading and installing an Extra Activity.
es: Para obtener los mejores resultados, quite cualquier versión anterior de StarChart puede que tengas instalado. Reinicia X (pulsa Ctrl-Alt-Retroceso). Luego, basta con seguir el procedimiento habitual para la descarga e instalación de una actividad extra.

source: Once you have installed StarChart, start it and select the clock button.
es: Una vez que hayas instalado StarChart, inicialo y seleccione el botón del reloj.

source: Is the time (YYYY/MM/DD,HH:MM) the correct year, month, day, hour and minute for your location (it's 24-hour time -- 1:00 PM is 13:00 in that system)? Is the zone offset showing the correct hours and minutes that your locale is offset from GMT? (Hint: Eastern Standard Time in the USA is "-5:00" with respect to GMT.) If not, stop the activity and correct your time and time-zone using the Sugar control panel before proceeding.
es: ¿Es correcto el tiempo (AAAA/MM/DD HH:MM) y el año, mes, día, hora y minuto de tu ubicación (se usa tiempo de 24 horas - 1:00 PM es 13:00)? ¿Está compensada la zona que muestra las horas correctas y minutos con el entorno local está desplazado del GMT? (Sugerencia: Hora estándar en los EE.UU. es "-5: 00" con respecto a GMT. ) Si no es así, detener la actividad y corregir su tiempo y la zona horaria utilizando el panel de control de Sugar antes de continuar.

source: If the time and date are correct, the chart will be displaying the sky for a location in Massachusetts, USA as of right now. If you don't happen to be in that location, you will need to enter your longitude and latitude. Click on "where" to display the controls for doing this. You should be able to get your coordinates from any good map, Google Earth or simply use the published coordinates for any relatively nearby city or town. Another possibility is from a site on the internet such as http://www.mapquest.com/atlas which provides a map with latitude and longitude information from which you can interpolate your specific coordinates.
es: Si la hora y la fecha son correctas, el gráfico mostrará el cielo en un lugar en Massachusetts, EE.UU. a partir de ahora. Si tu no estas en ese lugar, tendrás que entrar la longitud y latitud. Haz clic en "dónde" para ver los controles para hacer esto. Debes ser capaz de obtener tus coordenadas de cualquier buen mapa, Google Earth o simplemente utilizar las coordenadas publicadas por cualquier ciudad relativamente cercana a tu ciudad. Otra posibilidad es la de un sitio en Internet como http://www.mapquest.com/atlas que ofrece un mapa con información de latitud y longitud desde donde se puedes interpolar tus coordenadas específicas.

source: Don't be obsessive about the precision for this: the star chart will not look noticibly different if you are wrong by one or two degrees either way in latitude or longitude. Being off 100 km won't make enough of a difference to show. But be sure you select East or West longitude and North or South latitude! Then click "Ok" so the program knows you really want to change these settings.
es: No seas obsesivo acerca de la precisión para esto: la carta de la estrella no se verá noticibly diferente si te equivocas en uno o dos grados en cualquier dirección en latitud o longitud. Estar fuera de 100 kilometros no hará una diferencia suficientemente visible. Pero asegúrate de seleccionar la longitud este u oeste y la latitud norte o sur l! Luego haz clic en "Ok" para que el programa sepa que realmente quieres cambiar esta configuración.

source: Now I'd recommend clicking the "Make Home" button. StarChart will save this location as your "home" position. From now on, whenever you start the activity the location will default to these coordinates.
es: Ahora me gustaría recomendar hacer clic en el botón "Definir Casa". StarChart salvará esta ubicación como tu posición "inicial". A partir de ahora, cada vez que inicie la actividad usará la ubicación por defecto para estas coordenadas.

source: How to read the plot
es: Cómo leer la pantalla

source: Stars are drawn (with default settings of the "What" menu tab controls) as white dots of different sizes. The brightest stars are drawn as the biggest dots; the dimmest stars are drawn as the smallest dots.
es: Las estrellas se dibujan (según la configuración predeterminada en e menú "Qué" ) como puntos blancos de diferentes tamaños. Las estrellas más brillantes se dibujan como los mayores puntos; las estrellas más débiles se dibujan como los puntos más pequeños.

source: The constellations are drawn as white lines forming the stick-figures defined by the International Astronomical Union.
es: Las constelaciones se dibujan como líneas blancas que forman los palo cifras definidas por la Unión Astronómica Internacional.

source: The sun, moon and "classical" planets are drawn as their astrological symbols and plotted much larger than they actually appear.
es: El sol, la luna y los planetas "clásicos" se dibuja como sus símbolos astrológicos y se representa mucho más grande de lo que realmente parecen.

source: Deep sky objects are plotted as areas of gray, with different "decorations", depending on the type of the object.
es: Los objetos del cielo profundo se representan como áreas de color gris, con diferentes "decoraciones", dependiendo del tipo de objeto.

source: A diffuse nebula (such as the one in Orion) is plotted as a gray rectangle.
es: Una nebulosa difusa (tal como el de Orion) se representa como un rectángulo gris.

source: A galaxy is plotted as a gray ellipse or circle with a white border.
es: Una galaxia se representa como una elipse o un círculo de color gris con un borde blanco.

source: A planetary nebula is plotted as a gray circle with a central white dot.
es: Una nebulosa planetaria se representa como un círculo gris con un punto central blanco.

source: An open cluster is plotted as a gray circle with no border.
es: Un cúmulo abierto se representa como un círculo gris sin frontera.

source: A globular cluster is plotted as a gray circle with a white border and a central dot.
es: Un cúmulo globular se representa como un círculo gris con un borde blanco y un punto central.

source: Although the ellipse representing a galaxy is roughly the correct eccentricity, the orientation of the ellipse on the chart is arbitrary and does not reflect the galaxy's actual position angle.
es: Aunque la elipse que representa una galaxia es más o menos la excentricidad correcta, la orientación de la elipse en la tabla es arbitraria y no refleja el ángulo de la posición real de la galaxia.

source: To identify symbols, you can correlate them to the `Astronomical Symbols on Wikipedia <http://en.wikipedia.org/wiki/Astronomical_symbols>`_
es: Para identificar los símbolos, se puede leer acerca a los `símbolos astronómicos en Wikipedia <https://es.wikipedia.org/wiki/S%C3%ADmbolos_astron%C3%B3micos>`_

source: Operating Instructions
es: Instrucciones de uso

source: The initial display for StarChart will show the sky for your locale and the current time. (This assumes you have done the steps described above in "Installation and set-up".)
es: La pantalla inicial para StarChart mostrará el cielo para tu ubicación y la hora actual. (Esto supone que tu haz hecho los pasos descritos anteriormente en "Instalación y configuración". )

source: Menu
es: Menú

source: (We will go from left to right)
es: (Vamos a ir de izquierda a derecha)

source: |eye_ico| is for changing the appearance. For exapmle, it lets you change the color combinations of the map and decide how many stars you want to see and if you want the constellation figures. These settings get saved, too. So if you prefer black stars on white sky you can get that combination. Let's walk through each option and see what it does to the appearance of the map.
es: |eye_ico| es para cambiar la apariencia. Por ejemplo, te permite cambiar la combinación de colores del mapa y decidir cuántas estrellas quieres ver y si quieres las figuras de las constelaciones. Estos ajustes se guardan también. Así que si prefieres estrellas negras en el cielo blanco puedes conseguir esa combinación. Vamos a caminar a través de cada opción y ver lo que hace con la apariencia del mapa.

source: Things you can do
es: Cosas que puedes hacer

source: Toggle Full-Screen
es: Alternar pantalla completa

source: Toggle Night Vision
es: Alternar visión nocturna

source: The "Night Vision" option makes the activity's display mostly red on black. Red light doesn't affect your night vision so using this mode lets your eyes read the map and still remain sensitive enough to see the dim stars. Hint: it also helps to set the brightness of the back-light as low as you can and still read the chart to minimize the effect on your night vision.
es: La opción de "visión nocturna" muestra la pantalla de la actividad en su mayoría en color rojo sobre negro. La luz roja no afecta tu visión nocturna por lo que el uso de este modo permite que tus ojos leen el mapa y siguen siendo lo suficientemente sensibles como para ver las estrellas débiles. Sugerencia: también ayuda ajustar el brillo de la luz de fondo a un valor tan bajo como sea posible leer el gráfico, para minimizar el efecto en tu visión nocturna.

source: Invert Display
es: Invertir pantalla

source: But sometimes you will find it easier to work with a chart that's black on white like a page in a book. This mode is not good for use at night but it's fine in a classroom or in daylight. To get a black chart on a white background, set "Invert Display".
es: Pero a veces te resultará más fácil trabajar con un gráfico que es negro sobre blanco, como una página de un libro. Este modo no es bueno para su uso por la noche pero está bien en un aula o en la luz del día. Para obtener un gráfico negro sobre un fondo blanco, ajuste "Invertir Pantalla".

source: Flip L/R
es: Voltear L / R

source: Normally, StarChart shows its map with east on the left. This may seem odd to you because a terrestrial map would show east on the right. But if you face east and hold the map so that east is near the ground, you'll discover that with a terrestrial map, north on the map is now to your south! With StarChart's mirrored map, north is north and south is south when east is down. That means what you see on your XO's screen will match what you see in the sky.
es: Normalmente, StarChart muestra su mapa con el Este a la izquierda. Esto te puede parecer extraño porque un mapa terrestre mostraría al Este a la derecha. Pero si miras al Este y mantienes el mapa de modo que el Este se encuentre cerca de la tierra, descubrirás que con un mapa terrestre, el Norte en el mapa está ahora en al Sur! Con el mapa espejado de StarChart, el Norte está hacia el Norte y hacia el Sur se encuentra el Sur cuando el Este está hacia abajo. Eso significa que lo que se ve en la pantalla de tu XO coincidirá con lo que se ve en el cielo.

source: But if you find it confusing to have east on the left and west on the right, you can set "Flip L/R" and get the map to be like a terrestrial map.
es: Pero si te resulta confuso tener al Este a la izquierda y el Oeste a la derecha, se puede establecer "Cambiar D / I" y obtener el mapa como en un mapa terrestre.

source: Draw Constellations
es: Dibujar Constelaciones

source: Stars are grouped in imaginary figures called constellations. These represented scientific and navigational instruments, gods and goddesses, mythical and real animals and other patterns that people saw in the sky. Since drawing detailed pictures would make the chart too confusing, astronomers usually draw simple stick-figures. StarChart normally plots these standard figures. But you can turn that off and just see the stars themselves if you want -- after all, there are no lines drawn in the sky!
es: Las estrellas se agrupan en figuras imaginarias llamadas constelaciones. Estas representan instrumentos científicos y de navegación, dioses y diosas, animales míticos y reales y otros patrones que las personas vieron en el cielo. Ya que dibujos detallados haría la imagen demasiado confusa, los astrónomos suelen dibujar simples lineas. StarChart normalmente traza estas lineas estándar. Pero tu puedes apagar eso y sólo ver las estrellas mismas si quieres - después de todo, no hay líneas dibujadas en el cielo!

source: Change magnitude level (Choose between 1 to 6)
es: Cambiar el nivel de magnitud (Elige entre 1 a 6)

source: Stars come in different brightnesses. Astronomers call these levels of brightness "magnitudes". The brightest stars are magnitude zero (well, in a couple of cases, brighter than that); the dimmest stars that you can see without a telescope or binoculars on a really dark night will be about magnitude 6.
es: Estrellas vienen en diferentes brillos. Los astrónomos llaman a estos niveles de brillo "magnitudes". Las estrellas más brillantes son de magnitud cero (bueno, en un par de casos, más brillante que eso); las estrellas más débiles que se pueden ver sin telescopio o binoculares en una noche muy oscura serán de unos 6 grados.

source: There are a lot more dim stars than bright ones. So if StarChart always plotted all the stars you could see, there would be so many (over 1,000!) that it would be hard for you to read the map. So there's a control (actually six of them) that lets you select how dim the stars the activity should bother to plot. StarChart defaults to plotting stars of magnitude 4 or brighter. This is a good compromise between having not enough stars to appreciate what the sky looks like and having so many that it's confusing. This brightness is about what you would see on an average night in suburban locations.
es: Hay mucho más estrellas tenues que brillantes. Así que si StarChart siempre trazara todas las estrellas que se pueden ver, habría demasiadas (más de 1000!) y sería difícil para ti leer el mapa. Así que hay un control (de hecho seis de ellos) que te permiten seleccionar como mostrar las estrellas menos brillantes. Por defecto StarChart mostrará las estrellas de magnitud 4 o más brillantes. Este es un buen compromiso entre tener suficientes estrellas para apreciar lo que se ve el cielo como y tener tantas que sea confuso. Este brillo es lo que se vería en una noche normal en zonas suburbanas.

source: Here is what the plot looks like when you have asked for only the brightest of the stars. This is what the sky might look like from the middle of a large city. (magnitude level 1)
es: Aquí es lo que parece la trama como cuando usted ha pedido sólo la más brillante de las estrellas. Esto es lo que el cielo podría ser similar desde el centro de una gran ciudad. (Nivel de magnitud 1)

source: And this is what the sky might look like from a mountain a long way from cities or towns on a moonless night. (magnitude level 6)
es: Y esto es lo que el cielo puede parecer desde una montaña muy lejos de las ciudades o pueblos en una noche sin luna. (Nivel de magnitud 6)

source: (magnitude level 4)
es: (Nivel de magnitud 4)

source: Where |pos_ico| (Specify Location)
es: Dónde |pos_ico| (Especificar ubicación)

source: This is the menu tab that lets you tell StarChart from what place on earth you would like to see the sky plotted. Usually, this would be where you are, but sometimes you might want to see what the sky looks like to someone living elsewhere.
es: Esta es el menú que te permite decirle a StarChart desde qué lugar en la tierra quieres ver el cielo traza. Por lo general, esto sería donde está, pero a veces es posible que desee ver lo que el cielo se parece a alguien que vive en otro lugar.

source: A location on earth is specified by longitude and latitude. Longitudes go from zero to 180 degrees east or from zero to 180 degrees west. Latitudes go from zero to 90 degrees north or zero to 90 degrees south.
es: Una ubicación en la tierra es especificado por la longitud y latitud. Longitudes van de cero a 180 grados al Este o de cero a 180 grados Oeste. Latitudes van de cero a 90 grados al Norte o cero a 90 grados al Sur.

source: The StarChart activity will accept an angle as a number of degrees, including fractional degrees (like "123.45") or an angle as degrees, minutes and seconds. In this second type of angle, you must use a form like "123d27m33s". Enter longitude (be sure to select east or west) and latitude (be sure to select north or south) and click on the "Ok" button. If the new location is substantially distant from the old, the star map will look very different.
es: La actividad StarChart aceptará un ángulo como un número de grados, incluyendo fracciones de grados (como "123.45 ") o un ángulo como grados, minutos y segundos. En este segundo tipo de ángulo, debes utilizar un formato como "123d27m33s". Introduce la longitud (asegúrate de seleccionar Este u Oeste) y la latitud (asegúrate de seleccionar Norte o Sur) y haz clic en el botón "Ok". Si la nueva ubicación es sustancialmente distante de la anterior, el mapa de las estrellas será muy diferente.

source: The "Make Home" button will set the selected location as your default observatory coordinates. This setting is then remembered for all future StarChart sessions.
es: El botón "Seleccionar hogar" fijará la ubicación seleccionada como tus coordenadas de observación predeterminadas. Este ajuste se recuerda entonces para todas las futuras sesiones de StarChart.

source: When |time_ico| (Specify Time)
es: Cuando |time_ico| (Especificar hora)

source: These controls let you specify the time for which you want the chart plotted.
es: Estos controles permiten especificar el tiempo para el cual deseas que el gráfico sea trazado.

source: Normally, "Now" is selected and the current year, month, day, hour and minute and the number of hours and minutes that your time-zone differs from GMT by is shown in the time and offset fields. Additionally, the time field will automatically be updated to track the current local time and the plot will automatically be recomputed once a minute. In this mode, the plot will match the current sky and will move over time the way the sky does. But you can also use these controls to specify that you want a chart for a particular time in the future or past.
es: Normalmente, "ahora" se selecciona y el año, mes, día, hora y minuto actual y el número de horas y minutos que tu zona horaria se diferencia de GMT se muestran en los campos hora y diferencia. Además, el campo de hora se actualizará automáticamente al realizar un seguimiento de la hora local actual y el gráfico será automáticamente recalculado una vez por minuto. En este modo, el gráfico coincidirá con el cielo actual y se desplazará a través del tiempo en la forma en que el cielo lo hace. Pero también se pueden utilizar estos controles para especificar que deseas un gráfico para un momento determinado en el futuro o en el pasado.
