Repository: tony37/sledhelp
Catalog: translated_po/*/starchart.po
Languages: es

source: Click the "Specify time" radio button, since "Now" isn't what you want anymore. Now specify the new time, beginning with the year. Time is entered as a four-digit year, a two-digit month and a two-digit day, separated by slash (/) characters, a comma (,) and then the hour and minute in 24-hour time separated by a colon (:). Example: 2008/02/20,22:00 would be 10 PM on the 20th of February, 2008. Next, if your location observes daylight time, you may need to add or subtract an hour from the time-zone offset value if the time you entered is on the "other side of the daylight time boundary". Finally, click "Ok" to get the new plot.
es: Haz clic en el botón "Especificar el tiempo", ya que "ahora" no es lo que tu quieres ahora. Ahora especifica el nuevo tiempo, a partir del año. El tiempo se introduce como un año de cuatro dígitos, un mes de dos dígitos y un día de dos dígitos, separados por una barra (/), una coma (,) y luego la hora y los minutos en el tiempo de 24 horas separados por dos puntos (:). Ejemplo: 2008/02/20,22: 00 sería 22:00 en el 20 de febrero del 2008. A continuación, si en tu lugar se observa el horario de verano, puede ser que tengas que añadir o restar una hora del valor de desplazamiento de zona horaria si el tiempo que has escrito esta al "otro lado del límite de la luz del día". Por último, haz clic en "Aceptar" para obtener la nueva imagen.

source: When you click on the "Specify time" radio button, StarChart stops the display from automatically being updated. Clicking on the "Now" radio button will set the time back to the current time and resume automatically updating the time fields and the chart.
es: Al hacer clic en el botón de opción "Especificar el tiempo", StarChart detiene la actalizacion de pantalla automática. Al hacer clic en el botón "Ahora" fijará el tiempo a la fecha y hora actual y reanudará automáticamente la actualización de los campos de hora y el gráfico.

source: Locate |type_ico|
es: Localiza |type_ico|

source: These controls let you select an object and have it highlighted on the chart so you can tell where the object is in the sky. You can "locate" planets, stars (either by the constellation which contains the star or from a list of the brightest stars) or "deep-sky" objects.
es: Estos controles permiten seleccionar un objeto y lo resalta en el gráfico de modo que se puede decir donde está el objeto en el cielo. Tu puedes "localizar" los planetas, las estrellas (ya sea por la constelación que contiene la estrella o de una lista de las estrellas más brillantes) u objetos del "cielo profundo".

source: Planets
es: Planetas

source: Stars by Constellation
es: Estrellas por constelación

source: Brightest Stars
es: Estrellas Brillantes

source: Deep-sky Objects
es: Objetos del Cielo Profundo

source: You begin by selecting the type of object. Then you pick the object itself...
es: Se empieza por la selección del tipo de objeto. Luego tienes que elegir el objeto en sí mismo. . .

source: Select from the list and sub-lists to locate whatever object you wish to.
es: Selecciona de la lista y sublistas para localizar cualquier objeto que desees.

source: Examples:
es: Ejemplos:

source: Reporting Bugs
es: Informar de errores

source: To report a bug or to see what bugs have been reported and/or fixed, please go to the `bug tracking page <http://wiki.laptop.org/go/StarChart/Bug_tracking>`_.
es: Para informar de un fallo, o para ver qué errores han sido reportados y / o solucionados, por favor ve a la página `bug tracking <http://wiki.laptop.org/go/StarChart/Bug_tracking>`_.

source: References
es: Referencias

source: `Wiki page <http://wiki.laptop.org/go/StarChart>`_
es: `Página Wiki <http://wiki.laptop.org/go/StarChart>`_
