Repository: tony37/sledhelp
Catalog: translated_po/*/starting_the_xo.po
Languages: es

source: Starting the XO
es: Iniciando de la XO

source: To start the XO, press the Power button, near the lower right corner of the screen. The XO takes about 30 seconds to start up.
es: Para iniciar la XO, pulsa el botón de encendido, cerca de la esquina inferior derecha de la pantalla. La XO tarda unos 30 segundos en encenderse.

source: If the battery needs charging, the light next to the power button glows red. Plug the AC adaptor into the left side of the XO and plug the power cord into an outlet if you see the red light or if the XO does not start up.
es: Si la batería necesita carga, la luz al lado del botón de encendido se ilumina en rojo. Enchufa el adaptador de CA en el lado izquierdo de la XO y enchufa el cable de alimentación a una toma si ves la luz roja o si la XO no se inicia.

source: If you have difficulty starting your XO, refer to the Repairing chapter for ideas.
es: Si tienes dificultad para iniciar el XO, consulta el capítulo Reparación para más ideas.

source: Starting for the first time
es: Comenzando por primera vez

source: After you press the power button and the XO initially starts up, the XO screen asks for your first name. The next time you start it, it remembers your name and goes directly to the Home View. Later on you can learn how to change to a nick name of your choosing.
es: Después de presionar el botón de encendido y que el XO se pone en marcha por primera vez, el XO te pide tu nombre de pila. La próxima vez que lo inicies, recuerda tu nombre y va directamente a la vista principal. Más adelante se puede aprender a cambiar el nombre de usuario a tu elección.

source: Type your name.
es: Escribe tu nombre.

source: After you enter your name, click Next. (Use a finger on the touchpad below the keyboard to move the arrow over the word "Next". Press the key below the touchpad on the left with an "X" on it to "click".)
es: Después de escribir tu nombre, haz clic en Siguiente. (Usa un dedo en el panel táctil debajo del teclado para mover la flecha sobre la palabra "Siguiente". Presione la tecla debajo del panel táctil de la izquierda con una "X" en él para hacer "clic". )

source: Next, you see a small O on top of an X. This symbol represents you when you use your XO. Use your finger on the touchpad to move the arrow over the person symbol. "Click" this person symbol by pressing the key with an "X" on the left below the touchpad to choose colors that you like.
es: A continuación, se ve una pequeña O en la parte superior de un X. Este símbolo te representa cuando utilizas tu XO. Usa tu dedo sobre el panel táctil para mover la flecha sobre el símbolo persona. "Haz clic en" este símbolo persona pulsando la tecla con una "X" de la izquierda debajo del panel táctil para elegir los colores que te gustan.

source: After you chose your colors, click "Done."
es: Después de que elijas tus colores, haz clic en "Hecho. "

source: Putting the XO to sleep
es: Poner la XO a dormir

source: When you are ready to stop using your XO for a while, you can put it to sleep by pushing the power key you used to turn it on. The screen that appears when you push the power button shows the two reasons for sleeping; when you haven't been using it for a while, or when you push the power button.
es: Cuando estés listo para dejar de usar tu XO por un tiempo, puedes ponerlo a dormir presionando la tecla de encendido que utilizaste para encenderlo. La pantalla que aparece al pulsar el botón de encendido muestra las dos razones para dormir; cuando no la has estado usando durante un tiempo, o cuando se presiona el botón de encendido.

source: Shutting down the XO
es: Apagado del XO

source: When you have finished using the computer, click over the XO icon in the middle of the Home screen, and select the option Shutdown.
es: Cuando hayas terminado de utilizar el equipo, haz clic sobre el icono de XO en el centro de la pantalla Inicio y selecciona la opción de apagado.

source: Forced Shutdown
es: Apagado Forzado

source: Whenever the XO becomes unresponsive to the keyboard or to the touchscreen, you can make an emergency shutdown by pressing and holding the power button for a few seconds. Be careful that your power button does not get "stuck" in the down position. If it does get stuck, the XO does not detect the depression of the power button, and does not turn on. If this happens, refer to the Repairing chapter for information.
es: Siempre que la XO no responde al teclado o al panel táctil, se puede hacer una parada de emergencia pulsando y manteniendo pulsado el botón de encendido durante unos segundos. Ten cuidado de que el botón de encendido no quede "atascado" en la posición hacia abajo. Si se atasca, la XO no detecta la depresión del botón de encendido, y no se enciende. Si esto ocurre, consulte el capítulo Reparación para obtener información.
