Repository: tony37/sledhelp
Catalog: translated_po/*/stopwatch.po
Languages: es

source: StopWatch
es: Cronómetro

source: About
es: Acerca de

source: StopWatch is the quintessential stopwatch Sugar, intuitivoy well as being easy to use, supports the needs of both simple and advanced timing.Among its innovations, StopWatch offers the ability to manage multiple timers simultaneously and to make it easier to manage their watches, you can rename them all.
es: Cronómetro es el cronómetro por excelencia de Sugar, intuitivo y además fácil de usar, soporta las necesidades tanto de medición de tiempo simple y avanzada. Entre sus innovaciones, Cronómetro ofrece la posibilidad de gestionar varios temporizadores simultáneamente y para que sea más fácil de administrar tus relojes, puedes cambiar el nombre de todos ellos.

source: Where to get StopWatch
es: Dónde obtener StopWatch

source: While the StopWatch activity does not come preinstalled on all distributions OLPC software, you can download activity from its `Activity page <http://activities.sugarlabs.org/en-US/sugar/addon/4263>`_
es: Si bien la actividad Cronómetro no viene preinstalado en todas las distribuciones de software de OLPC, se puede descargar la `página de la actividad <http://activities.sugarlabs.org/en-US/sugar/addon/4263>`_

source: Using
es: Uso

source: Indeed, the StopWatch activity is very easy to use, but if you do not understand any of the features of this activity, the references are listed below:
es: De hecho, la actividad Cronómetro es muy fácil de usar, pero si no entiendes alguna de las características de esta actividad, las referencias se enumeran a continuación:

source: Select the name of a timing to keep your work organized.
es: Selecciona el nombre de un temporizador para mantener tu trabajo organizado.

source: Start/Pause the timing.
es: Inicia / Pausa el cronómetro.

source: Reset the timing.
es: Reinicia el cronómetro.

source: Create a mark of this time(in others timers, known as "A return").
es: Crear una marca de tiempo (en otros temporizadores, conocido como "Una marca").

source: The visor of actual time.
es: EL visor del tiempo actual.

source: A list of all times you checked.
es: Una lista de todos los tiempos que haz marcado.
