Repository: tony37/sledhelp
Catalog: translated_po/*/sugar_features.po
Languages: es

source: Sugar Features
es: Características de Sugar

source: This page presents a number of Sugar features common to many Activities. The page is designed as a series of "reference topics".
es: Esta página presenta una serie de características de Sugar comunes a muchas actividades. La página se ha diseñado como una serie de "temas de referencia".

source: This experimental page includes graphical spacers to separate non-related topics.
es: Esta página experimental incluye separadores gráficos para separar temas no relacionados.

source: View source
es: Ver código fuente

source: You always can view the source code of Sugar Activities. In most cases, View Source will show you the python code of the activity, in other cases, like Browse, you can see the HTML code of the page seen in the activity.
es: Siempre se puede ver el código fuente de las Actividades de Sugar. En la mayoría de los casos, Ver código te mostrará el código python de la actividad, en otros casos, como en Navegar, se puede ver el código HTML de la página se ve en la actividad.

source: You can see the source window pressing Fn-space in your XO or Ctrl-Shift-V or pressing right click on the Activity's icon in the :doc:`/frame`. Here is an example of viewing the source of a page in :doc:`/help` Activity. In the case of this activity, you see the simple text, which Help converts into HTML pages for display. This is useful in the process of editing Help pages as described here :doc:`/how_to_help`
es: Se puede ver la ventana del código fuente presionando las teclas Fn-espacio en tu XO o Ctrl-Shift-V o pulsando el botón derecho sobre el icono de la actividad en el :doc:`/frame`. He aquí un ejemplo de visualización del fuente de una página en la actividad :doc:`/help`. En el caso de esta actividad, se ve el texto simple, que Ayuda convierte en páginas HTML para su visualización. Esto es útil en el proceso de edición de páginas de ayuda como se describe aquí :doc:`/how_to_help`

source: Duplicating activities
es: Duplicación de actividades

source: A option to duplicate an activity has been added to the View Source alert. By selecting this option, a copy of the activity is created in the user's $HOME/Activities directory. Thus we hope to encourage Sugar users to make modifications and improvements to the code they use without the risk of breaking the original activity.
es: Una opción para duplicar una actividad se ha añadido a la ventana Ver código fuente. Al seleccionar esta opción, se crea una copia de la actividad en el directorio $HOME/Activities del usuario. Por lo tanto, esperamos animar a los usuarios de Sugar a hacer modificaciones y mejoras al código que utilizan sin el riesgo de romper la actividad original.

source: |more| For more information:
es: |more| Para más información:

source: The Sugarlabs.org wiki has a informative article: http://wiki.sugarlabs.org/go/View_Source
es: Los wiki de sugarlabs tiene un artículo informativo: http://wiki.sugarlabs.org/go/View_Source

source: *End of topic - spacer below.*
es: *Fin del tema - espaciador debajo. *

source: Say selected text
es: Decir texto seleccionado

source: You can have :doc:`/speak`, or robot Alice, read aloud, selected text. Here we demonstrate Alice reading text framed by :doc:`/help`. In Help, for instance, you can select a whole page of text, and have it read aloud to you while you explore that Activity.
es: Tu puedes hacer : doc:`/speak` o robot Sara, leer en voz alta, texto seleccionado. Aquí demostramos Sara leyendo texto seeccionado en :doc:`/ help`. En Ayuda, por ejemplo, puedes seleccionar una página entera de texto, y hacer que se lea en voz alta mientras exploras la Actividad.

source: Try it now, Select the text in this frame.
es: Pruébalo ahora, Seleccione el texto en este marco.

source: To select text, move the mouse to the top left of the text, there is a green arrow near the correct point. Click the left, or main, mouse button. Move the cursor to the bottom right of the text to select, there is a red arrow near the correct point.
es: Para seleccionar texto, mueva el ratón a la parte superior izquierda del texto, hay una flecha verde cerca del punto correcto. Haz clic en el botón de la izquierda, o principal del ratón. Mueve el cursor a la parte inferior derecha del texto que deseas seleccionar, hay una flecha roja cerca del punto correcto.

source: Bring in the :doc:`/frame` with the "Frame key" or F6. Press on the "Speech lips" icon in the bottom of the frame, then press on *Say selected text*. Notice also that there is a pause feature, once *speech* has started.
es: Muestra el :doc:`/ frame` con la tecla "Marco" o F6. Pulsa en el icono de "labios" en la parte inferior del marco, a continuación, pulsa en *Decir texto seleccionado*. Observa también que hay una función de pausa, una vez ha comenzado a hablar.

source: The *Say selected text* feature is available in many text based Activities including :doc:`/browse`, :doc:`/fototoon`, :doc:`/write`. Look out for the "Speech lips" icon in the bottom of the Frame, or as a button in the toolbar of an Activity, as in :doc:`/write`.
es: La característica *Decir texto seleccionado* está disponible en muchas actividades basadas en textos como :doc:`/ browse`, : doc:`/fototoon`, o :doc:`/ write`. Busca el icono de "labios" en la parte inferior del marco, o como un botón en la barra de herramientas de una actividad, como en :doc:`/ write`.

source: This is a new unfinished page, you can modify it yourself following guidance here :doc:`/how_to_help`
es: Esta es una nueva página sin terminar, puedes modificarla tu mismo siguiendo las orientaciones aquí :doc:`/ how_to_help`
