Repository: tony37/sledhelp
Catalog: translated_po/*/sugar_ui.po
Languages: es

source: The Sugar User Interface
es: La interfaz de usuario de Sugar

source: The Sugar platform encourages learning through personal expression.
es: La plataforma Sugar estimula el aprendizaje a través de la expresión personal.

source: The user interface differs from the traditional Desktop metaphor. It uses a "zooming" metaphor—each view represents a different scale of interaction. You move between a view of the network "neighborhood", your "friends", your "home page", and your currently open application ("Activity"). Each view occupies the entire screen. There are no overlapping windows to deal with.
es: La interfaz de usuario se diferencia de la metáfora de escritorio tradicional. Tu te mueves entre una vista del "vecindario" de la red, tus "amigos", tu "página de inicio", y tu aplicación abierta ("Actividad"). Cada vista ocupa toda la pantalla. No hay que lidiar con ventanas que se superponen.

source: With Sugar, you zoom between views: from your network neighborhood to your current Activity.
es: Con Sugar, cambias el zoom entre las vistas: desde el entorno de red a tu actividad actual.

source: Sugar supports sharing and collaboration by default. Sugar brings many of the rich collaboration mechanisms we are accustomed to from the Internet directly into the user interface. Sharing a file, starting a chat, collaborating in a writing exercise, or playing a game with other people are never more than a single click away.
es: Sugar soporta el uso compartido y la colaboración por defecto. Sugar trae muchos de los ricos los mecanismos de colaboración que estamos acostumbrados desde Internet directamente en la interfaz de usuario. Compartir un archivo, a partir de una charla, colaborar en un ejercicio de escritura, o jugar un juego con otras personas no estan más que a un solo clic de distancia.

source: Sugar incorporates a Frame around the border of the screen; the Frame holds status information, such as alerts, a clipboard, open activities, and your current collaborators.
es: Sugar incorpora un marco alrededor del borde de la pantalla; el Marco mantiene la información de estado, como alertas, un portapapeles, actividades abiertas, y tus colaboradores actuales.

source: Sugar maintains a Journal (or diary) of everything you do; it is a place for reflection. You do not need to save files or create folders; Activities automatically save your work to the Journal.
es: Sugar mantiene un Diario (o registro) de todo lo que haces; es un lugar para la reflexión. No es necesario guardar los archivos o crear carpetas; las actividades guardan automáticamente el trabajo en el Diario.

source: Sugar emphasizes discovery. Every object in the interface has a menu that reveals more details and options for action. Many Activities include a "view source" option; for example, the Browse activity lets you examine the HTML code that reveals how a web page is created. Most Activities are written in the Python scripting language. You can see how they work, and make changes to them.
es: Sugar enfatiza el descubrimiento. Cada objeto en la interfaz tiene un menú que revela más detalles y opciones de acción. Muchas actividades incluyen una opción de "Ver código fuente"; por ejemplo, la actividad Navegar le permite examinar el código HTML que revela cómo se crea una página web. La mayoría de las actividades están escritos en el lenguaje de programación Python. Tu puedes ver cómo funcionan, y hacer cambios en ellas.

source: Sugar has clarity of design. There is no need to "double click". There are no overlapping windows. Sugar uses color and shape throughout the interface to provide a fun, expressive, approachable platform for computing.
es: Sugar tiene claridad de diseño. No hay necesidad de "doble clic". No hay ventanas superpuestas. Sugar utiliza el color y la forma en toda la interfaz para proporcionar una plataforma divertida, expresiva y accesible para la computación.

source: For parents and teachers
es: Para los padres y maestros

source: **Activities, not Applications**
es: **Actividades, no aplicaciones**

source: Sugar does not have applications in the traditional sense. Activities are distinct from applications in what they focus on (collaboration and expression) and in their implementation (journaling and iteration). This is more than a new naming convention; it represents an intrinsic quality of the learning experience we hope the children will have when using Sugar.
es: Sugar no tiene aplicaciones en el sentido tradicional. Las Actividades difieren de las aplicaciones en lo que se enfocan (la colaboración y la expresión) y en su aplicación (diario e iterativo). Esto es más que una nueva convención de nombres; representa una cualidad intrínseca de la experiencia de aprendizaje que esperamos los niños tendrán al usar Sugar.

source: **Presence is always Present**
es: **La colaboracion siempre está presente**

source: Everyone has the potential for learning and teaching. Sugar puts collaboration at the core of the user experience in order to realize this potential. The presence of other learners encourages children to take responsibility for others' learning as well as their own. The exchange of ideas amongst peers makes the learning process more engaging and stimulates critical thinking skills. Sugar encourages these types of social interaction with the laptops.
es: Todo el mundo tiene el potencial para el aprendizaje y la enseñanza. Sugar pone la colaboración en el núcleo de la experiencia del usuario con el fin de realizar este potencial. La presencia de otros estudiantes anima a los niños a asumir la responsabilidad del aprendizaje de otros, así como el suyo. El intercambio de ideas entre compañeros hace que el proceso de aprendizaje sea más atractivo y estimula el pensamiento crítico. Sugar alienta este tipo de interacción social con los ordenadores portátiles.

source: Most activities have the potential to become network enabled. For example, consider the Browse activity. With typical computer interfaces, you browse in isolation. In Sugar, sharing links is an integral part of Browse, transforming web-surfing into a group collaboration.
es: La mayoría de las actividades tienen el potencial de ser habilitada para el uso en red. Por ejemplo, considere la actividad Navegar. Con interfaces típicos de los ordenadores, se navega de forma aislada. En Sugar, compartir enlaces es una parte integral de Navegar, transformando la navegación web en una colaboración grupal.

source: **Tools of Expression**
es: **Herramientas de Expresión**

source: Sugar emphasizes thinking, expressing, and communicating using technology. Sugar starts from the premise that we want to use what people already know in order to make connections to new knowledge. Computation is a "thing to think with". Sugar makes the primary activity of the children one of creative expression, in whatever form that might take. Most activities focus on the creation of some type of object, be it a drawing, a song, a story, a game, or a program. In another language shift describing the user experience, we refer to objects rather than files as the primary stuff of creative expression.
es: Sugar enfatiza el pensamiento, la expresión y comunicación con la tecnología. Sugar parte de la premisa de que queremos utilizar lo que la gente ya sabe, para conectarlo con nuevo conocimiento. Computación es una "cosa con la que pensar". Sugar hace que la actividad principal de los hijos sea la expresión creativa, en cualquier forma que pueda tomar. La mayoría de las actividades se centran en la creación de algún tipo de objeto, ya sea un dibujo, una canción, un cuento, un juego o un programa. En otro cambio de lenguaje que describe la experiencia del usuario, nos referimos a objetos en vez de archivos como el material principal de la expresión creativa.

source: As most software developers would agree, the best way to learn how to write a program is to write one, or perhaps teach someone else how to do so. Studying the syntax of the language is useful, but it doesn't teach one how to code. We apply the principle of "learning through doing" to all types of creation. For example, we emphasize composing music over downloading music. We also encourage the children to engage in the process of collaborative critique of their expressions and to iterate upon this expression as well.
es: Como la mayoría de los desarrolladores de software concordarán, la mejor manera de aprender cómo escribir un programa es escribiéndolo, o quizás enseñar a alguien más cómo hacerlo. El estudio de la sintaxis del lenguaje es útil, pero no enseña como codificar. Aplicamos el principio de "aprender haciendo" a todo tipo de creación. Por ejemplo, incitamos a componer música en vez de la descarga de música. También animamos a los niños a participar en el proceso de crítica colaborativa de sus expresiones y a iterar sobre sus expresión también.

source: Turning the traditional file system into objects speaks more directly to real-world metaphors: instead of a sound file, we have an actual sound; instead of a text file, a story. In order to support this concept, activity developers can define object types and associated icons to represent them.
es: Al tornar el sistema de archivos tradicional en objetos hablamos más directamente a las metáforas del mundo real: en vez de un archivo de sonido, tenemos un sonido real; en lugar de un archivo de texto, una historia. Para apoyar este concepto, los desarrolladores de actividades pueden definir tipos de objetos e iconos asociados para representarlos.

source: **Journaling**
es: **El diario**

source: The concept of the Journal, a written documentation of everyday events, is generally understood, albeit in various forms across cultures. A journal typically chronicles the Activities one has done throughout the day. We have adopted a journal metaphor for the file system as our approach to file organization. The underlying implementation of the journal does not differ significantly from file systems in contemporary operating systems. The file system layout is less important than the journal itself.
es: El concepto de Diario, una documentación escrita de los eventos diarios, es usualmente entendido, con algunas diferencias en todas las culturas. Típicamente, un diario relata las actividades que uno ha hecho en todo el día. Hemos adoptado una metáfora del diario para el sistema de archivos como nuestro enfoque para presentar organización. La implementación subyacente al diario no difiere significativamente de los sistemas de archivos en los sistemas operativos contemporáneos. El diseño del sistema de archivos es menos importante que el propio diario.

source: The journal embodies the idea of storing a history of the things a child has done and the activities a child has participated in. The child, parent, and teacher can reflect on the journal to assess progress.
es: El diario encarna la idea de almacenar un historial de las cosas que un niño ha hecho y las actividades las que el niño ha participado. El niño, los padres y maestros pueden reflexionar en el diario para evaluar el progreso.

source: The Journal stores objects created while the student runs an Activity. This function is secondary, although important. The Journal naturally lends itself to a chronological organization. Objects in the Journal can be tagged, searched, and sorted by a variety of means. The Journal records what a child has done, not just what the child has saved. The Journal is a portfolio or scrapbook history of the child's interactions with the machine and also with peers.
es: El diario almacena los objetos creados mientras el estudiante ejecuta una Actividad. Esta función es secundaria, aunque importante. El Diario se presta de forma natural a una organización cronológica. Los objetos en el Diario se pueden etiquetar, buscar, y ordenar por una variedad de medios. El Diario registra lo que el niño ha hecho, no sólo lo que el niño ha salvado. El Diario es una cartera o anotador con la historia de las interacciones del niño con la máquina y también con sus compañeros.

source: The Journal includes entries explicitly created by the children with entries that are implicitly created through the child's participation in an Activities. Developers must think carefully about how an activity integrates with the Journal more so than with a traditional file system that functions independently of an application. The Activities, the objects, and the means of recording all tightly integrate to create a different kind of computer experience.
es: El Diario incluye entradas creadas expresamente por los niños con entradas que se crean implícitamente a través de la participación del niño en Actividades. Los desarrolladores deben pensar cuidadosamente acerca de como se integran con el Diario mucho más que con un sistema de archivos tradicional que funciona independientemente de la solicitud. Las actividades, los objetos y los medios de registrar deben integrarse íntimamente para crear un tipo diferente de experiencia de la computadora.
