Repository: tony37/sledhelp
Catalog: translated_po/*/terminal.po
Languages: es

source: About
es: Acerca de

source: Terminal is a full-screen text mode program that provides a Command-Line Interface (CLI) to the software on a Linux system, such as the Fedora Linux that Sugar on the XO is based on. Users type (sometimes cryptic) commands to perform file management, system administration, or in fact almost anything that can be done within Linux that does not involve graphics or video.
es: Terminal es un programa en modo texto de pantalla completa que proporciona una interfaz de línea de comandos (CLI) para el software en un sistema Linux, como Fedora Linux en el que Sugar se basa en la XO. El usuario tipéa (a veces crípticos) comandos para llevar a cabo la gestión de archivos, administración de sistemas, o de hecho casi cualquier cosa que se puede hacer dentro de Linux que no involucra gráficos o vídeo.

source: For example, typing **pwd** (Print name of current/Working Directory) at the command line in the home directory gives that location as /home/olpc, and typing **ls** at the command line lists the content of the current directory.
es: Por ejemplo, escribir **pwd** muestra el nombre de directorio de trabajo/actual en la línea de comandos.En el directorio principal esa ubicación es /home/olpc, y escribiendo **ls** en la línea de comando muestra el contenido de el directorio actual.

source: Where to get Terminal
es: Dónde conseguir Terminal

source: Terminal is provided with Sugar on every XO. However, by default it is not selected for display in the Home view as a Favorite.
es: Terminal está provisto con Sugar en cada XO. Sin embargo, por defecto no está seleccionada para su visualización en la vista de hogar como favorito.

source: To select Terminal as a Favorite, go to Home view, then click the List view icon. Type **Te** into the search box. Click the star next to Terminal. When you switch back to the ring of icons in Home view, Terminal will be visible.
es: Para seleccionar Terminal como Favorito, ve a la vista de inicio, a continuación, haz clic en el icono de la vista de lista. Escribe **Te** en el cuadro de búsqueda. Haz clic en la estrella junto a la Terminal. Cuando se cambia de nuevo al anillo de iconos en la vista principal, la terminal será visible.

source: Alternatively, you can leave Terminal unselected, and start it from list view by clicking its icon or selecting Start from its hover menu.
es: Alternativamente, puedes dejar Terminal no seleccionada, y empezar desde la vista de lista haciendo clic en su icono o seleccionando Inicio en su menú flotante.

source: If for some reason Terminal is not installed, it can be downloaded from its `Activity page <http://activities.sugarlabs.org/en-US/sugar/addon/4043>`_
es: Si por alguna razón la terminal no está instalado, se puede descargar desde su `página <http://activities.sugarlabs.org/en-US/sugar/addon/4043>`_

source: Using
es: Uso

source: Type commands with options that modify their effects and arguments, usually file names or other indications of where to get input and where to put output.
es: Tipéa comandos con opciones que modifican sus efectos y argumentos, por lo general los nombres de archivo u otros indicios de dónde obtener la entrada y dónde poner la salida.

source: Examples: **pwd** and **ls**, as shown above
es: Ejemplos: **pwd** y **ls**, como se muestra más arriba

source: Chain programs together, so that the following program processes the output of the earlier program.
es: Encadena programas juntos, de modo que el siguiente programa procesa la salida del programa anterior.

source: Get a listing of the current directory, but show only lines where the file or directory name includes the text "Sugar". The **|** symbol, read pipe, represents the data link between the programs.
es: Obtener un listado del directorio actual, pero mostrar sólo las líneas en que el nombre del archivo o directorio incluye el texto "Sugar". El símbolo **|**, tubo de lectura, representa el enlace de datos entre los programas.

source: Get information on programs. For example, many commands respond to the **-h** or **--help** options with a concise summary.
es: Obtener información sobre los programas. Por ejemplo, muchos de los comandos responden a las opciones **-h** o **--help** con un breve resumen.

source: The **man** and **info** utilities are unfortunately not available on XOs, but will undoubtedly be included in Sugar whenever the XO of that time is capacious enough for all of the manual and information pages in all of the supported languages.
es: Las utilidades **man** e **info** por desgracia no están disponibles en las XO, pero, sin duda, se incluirán en Sugar cuando el XO tenga la suficiente capaciad para todas las páginas de manual y de información en todos los idiomas soportados.

source: The Toolbar
es: La barra de herramientas

source: Activity: Name this session and add a description to Journal
es: Actividad: Nombre de esta sesión y descripción para el Diario

source: Edit (scissors icon): Copy and Paste
es: Editar (icono de las tijeras): Copiar y Pegar

source: View (eye icon): Increase or Decrease font size, view in full screen
es: Ver (icono del ojo): Aumentar o Disminuir tamaño de fuente, ver en pantalla completa

source: Help: Display useful commands
es: Ayuda: Muestra comandos útiles

source: Stop: Close terminal activity
es: Stop: Cerrar la actividad Terminal

source: Tabs: Open and close tabs
es: Pestañas: Abrir y cerrar pestañas

source: Learning with Terminal
es: Aprender con Terminal

source: Terminal is essential to learning advanced Linux functions, such as system administration, compiling software, and many other such topics.
es: Terminal es esencial para el aprendizaje de las funciones avanzadas de Linux, como la administración del sistema, la compilación de software, y muchos otros temas similares.

source: Extending Terminal
es: Extensión de la terminal

source: Users have the option of installing text-mode software that works in a terminal window. Examples include text editors such as pico, or file managers such as Midnight Commander. MC simplifies many command line activities for the user, providing equivalents to many command in menus and text windows. To install mc, enter
es: Los usuarios tienen la opción de instalar software en modo texto que funciona en una ventana de terminal. Los ejemplos incluyen editores de texto como pico, o administradores de archivos tales como Midnight Commander. MC simplifica muchas actividades de línea de comandos para el usuario, proporcionando equivalentes a muchos comandos en menús y ventanas de texto. Para instalar mc, introduzca

source: This invokes the Yellow Dog Update Manager to install the Red Hat/Fedora package for mc, including the program, documentation, and other files. Then the user can type mc at the command line and get a two-panel display of files in the same or different directories, together with function buttons and menus for creating and deleting directories, moving or copying files, viewing or editing files, changing file permissions, and much more.
es: Esto invoca el Administrador de paquetes yum para instalar el paquete de Red Hat/Fedora para mc, incluyendo el programa, documentación y otros archivos. A continuación, el usuario puede escribir mc en la línea de comandos y obtener una pantalla de dos paneles de archivos en el mismo o diferentes directorios, junto con botones de funciones y menús para crear y borrar directorios, mover o copiar archivos, ver o editar archivos, cambiar permisos de archivos, y mucho más.

source: See the FLOSS Manuals manuals
es: Consulte los manuales FLOSS

source: `Terminal <http://en.flossmanuals.net/terminal/>`_ about the Sugar Terminal activity
es: `Terminal <http://en.flossmanuals.net/terminal/>`_ sobre la actividad Terminal en Sugar

source: `Introduction to the Command Line <http://en.flossmanuals.net/command-line/>`_ for a user's tutorial on command line functions
es: `Introducción a la línea de comandos <http://en.flossmanuals.net/command-line/>`_ para un tutoríal acerca de funciones de línea de comandos para el usuario
