Repository: tony37/sledhelp
Catalog: translated_po/*/turtleart.po
Languages: es

source: Sensors Palette
es: Paleta Sensores

source: query keyboard: check for keyboard input (results are stored in the keyboard block)
es: Leer Teclado: comprobar la entrada de teclado (los resultados se almacenan en el bloque del teclado)

source: keyboard: current value of keyboard input (can be used in place of a number block)
es: Teclado: valor actual de la entrada de teclado (se puede utilizar en lugar de un número de bloque)

source: read pixel: push the RGB value of the pixel under the turtle onto the FILO (blue is first, red is last)
es: leer pixel: empujar el valor RGB del píxel bajo la tortuga en la PILA (azul es primero, el rojo es el último)

source: turtle sees: the "palette color" of the pixel under the turtle
es: tortuga ve: la "paleta de colores" del píxel bajo la tortuga

source: time: number of seconds since program began
es: tiempo: número de segundos desde el inicio del programa

source: sound: raw data from microphone ranging -32000 to 32000
es: Sonido: datos brutos desde el micrófono que van de -32000 a 32000

source: volume (loudness): ranging 0 to 32000
es: volumen (alto): desde 0 a 32.000

source: pitch: the resolution is +-8Hz
es: frecuencia: la resolución es de +-8Hz

source: brightness: average luminance seen through camera
es: brillo: luminancia media vista a través de la cámara

source: camera: grab image from camera
es: cámara: Toma imagen con la cámara

source: button down: current state of the mouse button (1 == down; 0 == ip)
es: botón abajo: estado actual del botón del ratón (1 == abajo; 0 == arriba)

source: mouse x: x position of mouse
es: ratón x: posición x del ratón

source: mouse y: y position of mouse
es: mouse y: posición y del ratón

source: The OLPC XO can measure external inputs with its microphone jack:
es: El OLPC XO puede medir sensores externos con su conector de micrófono:

source: resistance: measurement range is 750 to 14k ohms, (OLPC XO1) and 2k ohms to open circuit (OLPC XO1.5)
es: resistencia: rango de medición es de 750 a 14k ohmios, (OLPC XO1) y 2k ohmios a circuito abierto (OLPC XO1.5)

source: voltage: measurement range is DC 0.4V to 1.85V. (OLPC XO1) and 0.17V to 3.0V (OLPC XO1.5)
es: voltaje: rango de medición es de CC 0.4V a 1.85V. (OLPC XO1) y 0.17V a 3.0VV (OLPC XO1. 5)

source: The OLPC XO 1.75 also includes an accelerometer.
es: El OLPC XO 1. 75 también incluye un acelerómetro.

source: accelerate (not shown): measure the acceleration of the computer. Results are pushed to the stack and can be retrieved by using 3 'pop' blocks (one for X (horizontal), one for Y (vertical), and one for Z (forward/backward))
es: acelerar (no mostrado): medir la aceleración de la computadora. Los resultados se agregan a la pila y se pueden recuperar mediante el uso de 3 bloques 'pop' (una para X (horizontal), uno para Y (vertical) y otro para Z (adelante / atrás))

source: See `Using Turtle Art Sensors <http://wiki.sugarlabs.org/go/Activities/Turtle_Art/Using_Turtle_Art_Sensors>`_ for more details about the sensor blocks.
es: Véase `Usando Sensores con Turtle Art <http://wiki.sugarlabs.org/go/Activities/Turtle_Art/Using_Turtle_Art_Sensors>`_ para más detalles acerca de los bloques de sensores.

source: Media Palette
es: Paleta Medios

source: These are a collection of blocks used for displaying media objects, such as images from the Journal.
es: Estos son un conjunto de bloques utilizados para la visualización de objetos multimedia, como imágenes del Diario.

source: journal: Sugar Journal media object (used with show block) (also available in Turtle Art)
es: diario: objeto multimedia del Diario de Sugar (se usa con bloque mostrar) (también disponible en Turtle Art)

source: audio: Sugar Journal media object (used with show block)
es: audio: objeto multimedia del Diario de Sugar (se usa con bloque mostrar)

source: video: Sugar Journal media object (used with show block)
es: video: objeto multimedia del Diario de Sugar (se usa con bloque mostrar)

source: description: Sugar Journal description field (used with show block)
es: Descripción: campo Descripción del Diario de Sugar (usado con bloque mostrar)

source: text: text string (used with show block; also used with box and action blocks)
es: texto: cadena de texto (se usa con bloque mostrar; también se utiliza con los bloques caja y acción)

source: show: draw text or display media object from the Journal
es: mostrar: dibujar texto o mostrar objeto multimedia del Diario

source: set scale: sets the scale of images displayed with show block
es: ajustado en la escala: establece la escala de las imágenes que se muestran con el bloque mostrar

source: save picture: save the canvas to the Sugar Journal as a .png image (note: saves the canvas as displayed)
es: Guardar imagen: guardar el lienzo en el Diario como imagen .png (nota: guarda el lienzo como se muestra)

source: save SVG: save turtle graphics to the Sugar Journal as a .svg image (note: only saves the changes to the canvas in the current execution run)
es: guardar SVG: guardar los gráficos de tortuga al Diario como imagen .svg (nota: sólo guarda los cambios en el lienzo en el plazo de ejecución actual)

source: scale: sets scale for show block (100% is full-screen)
es: escala: selecciona la escala para el bloque mostrar (100% es la pantalla completa)

source: wait for media: used to pause program while audio or video file plays
es: esperar multimedia: se utiliza para hacer una pausa en el programa mientras se reproduce el archivo de audio o vídeo

source: media stop: stop current sound or video
es: parar multimedia: detener sonido o vídeo actual

source: media pause: pause current sound or video
es: pausa medios: pausa de sonido o vídeo actual

source: media resume: resume playing paused media
es: retomar medios: reanudar la reproducción de los medios de comunicación en pausa

source: speak: sends text to the voice synthesizer
es: hablar: envía texto al sintetizador de voz

source: sine wave: plays a sine wave of a given frequency, amplitude, and duration
es: onda sinusoidal: reproduce una onda sinusoidal de una determinada frecuencia, amplitud y duración

source: Extras Palette
es: Paleta Extras

source: These are a collection of extra blocks for accessing advanced features only available in Turtle Blocks.
es: Esta son una colección de bloques adicionales para acceder a funciones avanzadas sólo disponibles en Turtle Blocks.

source: push: push value onto FILO (first-in last-out) heap
es: empujar: empuja valor en una pila FILO (first-in last-out, el primero en entrar es el último en salir)

source: show heap: show FILO in status block
es: mostrar pila: mostrar FILO en bloque de estado

source: empty heap: empty the FILO
es: vaciar pila: vaciar la FILO

source: pop: pop value off of the FILO (can be used in place of a number block)
es: pop: tomar valor pop fuera de la pila FILO (se puede utilizar en lugar de un número de bloque)

source: print: print value in status block (also available in Turtle Art)
es: imprimir: imprimir valor en el bloque de estado (también disponible en Turtle Art)

source: comment: program comment (displayed in "walk" mode)
es: comentario: comentario de programa (se muestra en modo "paso a paso")

source: chr: Python chr primitive: converts ASCII to character (useful for converting keyboard input to text)
es: chr: primitiva 'chr' de Python: convierte a caracteres ASCII(útil para convertir la entrada de teclado a texto)

source: int: Python int primitive: converts input to integers
es: int: primitiva int de Python: convierte la entrada a enteros

source: Python: a programmable block (can be used in place of a number block)
es: Python: un bloque programable (se pueden utilizar en lugar de un bloque de número)

source: add your own math equation in the block, e.g., sin(x); This block is expandable to support up to three variables, e.g. f(x,y,z)
es: añade tu ecuación matemática en el bloque, ej. sin(x); Este bloque es ampliable para soportar hasta tres variables, e. g. f(x,y,z)

source: Import Python: import Python code from the Sugar Journal (a more general-purpose programmable block). This block accepts a single variable x, as an input or up to 3 variables as an array x[0], x[1] and x[2]
es: Importación Python: importa código Python del Diario (un bloque programable de propósito general). Este bloque acepta una sola variable x, como entrada o hasta 3 variables como una matriz x[0], x[1] y x[2]

source: Cartesian: display Cartesian coordinate grid overlay
es: Cartesiana: visualización de grilla de coordenadas cartesianas

source: polar: display polar coordinate grid overlay
es: polar: visualización de grilla de coordenadas polares

source: turtle: specify which turtle is active
es: tortuga: especificar que tortuga está activa

source: turtle shell: import a image from the Journal to use as the turtle's 'shell', i.e., replace the turtle with a sprite.
es: caparazón de tortuga: importar una imagen desde el Diario para usar como 'caparazón' de la tortuga. Sustituya la tortuga con un sprite.

source: sandwich clamp: "clamp" a stack of blocks to hide
es: pinza sandwich: "pinza" una pila de bloques para ocultarlos

source: Portfolio Palette
es: Paleta Portafolio

source: These blocks are used to make multimedia presentations only available in Turtle Blocks.
es: Estos bloques se utilizan para hacer presentaciones multimedia sólo están disponibles en Turtle Blocks.

source: hide blocks: hides all blocks and palettes (useful for decluttering the screen during presentations) (also available in Turtle Art)
es: ocultar bloques: oculta todos los bloques y paletas (útil para limpiar el desorden de la pantalla durante las presentaciones) (también disponible en Turtle Art)

source: show blocks: shows blocks and palettes (useful for resuming programming after a presentation)
es: mostrar bloques: muestra bloques y paletas (útil para reanudar la programación después de una presentación)

source: full screen: goes into full-screen mode (hides Sugar toolbars)
es: pantalla completa: entra en modo de pantalla completa (oculta las barras de herramientas de Sugar)

source: list slide: used for bulleted lists; This block is expandable, allowing you to add as many bullets as you need
es: diapositivas de lista: se utiliza para crear listas con viñetas; Este bloque es ampliable, lo que le permite añadir tantos puntos como necesites

source: picture slides: used for picture slides (1×1, 2×2, 1×2, and 2×1)
es: diapositiva de imagen: usado por diapoitivas con imágenes (1×1, 2×2, 1×2, and 2×1)

source: Only available in Turtle Blocks:
es: Sólo disponible en Turtle Blocks:

source: left: holds current x-coordinate value of the left edge of the screen (can be used in place of a number block)
es: izquierda: toma el valor de la coordenada x del borde izquierdo de la pantalla (se puede utilizar en lugar de un bloque numérico)

source: top: holds current y-coordinate value of the top edge of the screen (can be used in place of a number block)
es: arriba: toma el valor actual de la coordenada del borde superior de la pantalla (se puede utilizar en lugar de un bloque numérico)

source: right: holds current x-coordinate value of the right edge of the screen (can be used in place of a number block)
es: derecha: toma el valor actual de la coordenada x del borde derecho de la pantalla (se puede utilizar en lugar de un bloque numérico)

source: bottom: holds current y-coordinate value of the bottom edge of the screen (can be used in place of a number block)
es: inferior: toma el valor actual de la coordenada del borde inferior de la pantalla (se puede utilizar en lugar de un bloque numérico)

source: width: screen width (can be used in place of a number block)
es: ancho: ancho de la pantalla (se puede utilizar en lugar de un bloque numérico)

source: height: screen height (can be used in place of a number block)
es: altura: altura de la pantalla (se puede utilizar en lugar de un bloque numérico)

source: **Note:** The slide blocks expand into stacks that can be edited for customized presentations.
es: **Nota:** Los bloques de presentación se expanden en pilas que se pueden editar para presentaciones personalizadas.

source: Trash Palette
es: Paleta de basura

source: This palette holds any blocks that have been put in the trash. You can drag blocks out of the trash to restore them. The trash palette is emptied when you quit Turtle Art.
es: Esta paleta contiene los bloques que se han tirado a la basura. Puedes arrastrar los bloques de la basura para restaurarlos. La paleta de basura se vacía al salir de Turtle Art.

source: Vertical palettes
es: Paletas verticales

source: An example of a vertical palette. Vertical palettes are used by default on the OLPC XO laptops running older versions of Sugar.
es: Un ejemplo de una paleta vertical. Paletas verticales se utilizan de forma predeterminada en las laptops XO de OLPC con versiones anteriores del Sugar.

source: Learning with Turtle Art
es: Aprender con Turtle Art

source: Tony Forster and Mokurai have created a number of Activities/Turtle Art/Tutorials Turtle Art Tutorials on a wide range of math, programming, art, and Computer Science topics. There is also a substantial literature of educational materials using the Logo programming language, from which Turtle Art and Turtle Blocks derive. The Exploring with Logo series from MIT Press is particularly recommended for showing how far beyond simple graphics Logo can go. Mokurai recommends starting with his first three, specifically designed for helping beginners of all ages, starting with the preliterate in preschool.
es: Tony Forster y Mokurai han creado una serie de actividades y tutoriales conTurtle Art en una amplia gama, de matemáticas, programación, arte y temas de Informática. También hay una literatura sustancial de materiales educativos utilizando el lenguaje de programación Logo, del que TurtleArt y Turtle Blocks se derivan. La exploración con la serie Logo de MIT Press se recomienda especialmente para mostrar cuanto más allá de los gráficos simples Logo puede ir. Mokurai recomienda empezar con los primeros tres, diseñados específicamente para ayudar a los principiantes de todas las edades, desde antes de la lectoescritura en preescolar.

source: `You be the Turtle <http://wiki.sugarlabs.org/go/Activities/Turtle_Art/Tutorials/You_be_the_Turtle>`_ without the computer.
es: `Se la tortuga <http://wiki.sugarlabs.org/go/Activities/Turtle_Art/Tutorials/You_be_the_Turtle>`_ sin el ordenador.

source: `Mathematics and art <http://wiki.sugarlabs.org/go/Activities/Turtle_Art/Tutorials/Mathematics_and_art>`_, an introduction to TA.
es: `Matemáticas y arte <http://wiki.sugarlabs.org/go/Activities/Turtle_Art/Tutorials/Mathematics_and_art>`_, una introducción a TA.

source: `Counting <http://wiki.sugarlabs.org/go/Activities/Turtle_Art/Tutorials/Counting>`_
es: `Contar <http://wiki.sugarlabs.org/go/Activities/Turtle_Art/Tutorials/Counting>`_

source: Extending Turtle Art
es: Extendiendo Turtle Art

source: There are versions of Turtle Art in several programming languages and environments, including Logo, Python, Smalltalk, and others. Turtle Art can export programs in Logo, as explained below. There are programmable blocks in Turtle Art which make it possible to include any Python program within the Turtle Art world. The simplest case is a single function call used in a graphing program, but there is no inherent limit on what capabilities of Python one can add to TA.
es: Hay versiones de Turtle Art en lenguajes de programación y entornos varios, incluyendo Logo, Python, Smalltalk, y otros. TurtleArt puede exportar programas en Logo, como se explica a continuación. Hay bloques programables en Turtle Art que hacen posible la inclusión de cualquier programa de Python en el mundo Turtle Art. El caso más simple es una sola llamada de función utilizado en un programa de gráficos, pero no hay límite inherente en las capacidades de Python que se pueden añadir a TA.

source: Exporting to Berkeley Logo
es: Exportación a Berkeley Logo

source: Turtle Art can export its projects to `Berkeley Logo <http://www.cs.berkeley.edu/~bh/>`_ (using either **View Source** or the **Save as Logo** button on the **Project Toolbar**)
es: Turtle Art puede exportar sus proyectos a `Berkeley Logo <http://www.cs.berkeley.edu/~bh/>`_ (utilizando **Ver código fuente** o el botón **Guardar como Logo** de la **barra de herramientas del proyecto**)

source: Python Blocks in Turtle Art
es: Bloques de Python en Turtle Art

source: There are two ways to create Python blocks: by loading sample code provided with Turtle Art or by loading Python code the your Journal.
es: Hay dos formas de crear bloques Python: cargando código de muestra provisto en Turtle Art o cargando el código Python de tu Diario.

source: **Loading sample code**
es: **Cargando código de ejemplo**

source: A number of individual sample programs are provided. Clicking on the Load Python Block button on the Load/Save Toolbar |loadpython| will invoke a file-selector dialog. Select the sample that you want and it will be both copied to the Journal and loaded into a Python block.
es: Se proporcionan una serie de programas individuales de muestra. Al hacer clic en el botón Cargar Python en la barra de herramientas Cargar/Salvar |loadpython| invocará un diálogo selector de archivo. Selecciona la muestra que deseas y será copiado en el Diario y se cargará en un bloque de Python.

source: **Loading code from the Journal**
es: **Cargando código del Diario**

source: Clicking on a Python block |pythoncodeblock| that has been dragged onto the canvas from the Extras palette will invoke an object-selector dialog.
es: Al hacer clic en un bloque Python |pythoncodeblock| que ha sido arrastrado en el lienzo de la paleta Extras invocará un diálogo selector de objetos.

source: Select the Python code that that you want and that code will be loaded into the selected block.
es: Selecciona el código Python que desees y el código será cargado en el bloque seleccionado.

source: You can't run a Python block by clicking on it, as that opens the object selector; instead attach the block to another one and click elsewhere on the stack you have created.
es: No se puede ejecutar un bloque Python haciendo clic en él, ya que se abre el selector de objeto; conecta el bloque a otro y haz clic en otra parte de la pila que hayas creado.

source: Which ever way you create them, multiple Python blocks can have different code loaded in them.
es: Sea cual sea la forma en que los crees, varios bloques de Python pueden tener diferente código cargado en ellos.

source: Modifying Turtle Art
es: Modificación de Turtle Art

source: Turtle Art is under the MIT license. You are free to use it and learn with it. You are also encourage to modify it to suit your needs or just for a further opportunity to learn.
es: Turtle Art se encuentra bajo la licencia MIT. Eres libre de usarlo y aprender con él. También se te anima a modificarlo para adaptarlo a tus necesidades o simplemente como una nueva oportunidad para aprender.

source: Much of the motivation behind the Version 83 refactoring of the code was to make it easier for you to make changes. Most changes can be confined to two modules: taconstants.py and talogo.py. The former defines the blocks and palettes; the latter defines what code is executed by a block.
es: Gran parte de la motivación detrás de la refactorización en la versión 83 del código fué para hacer más fácil para ti el hacer cambios. La mayoría de los cambios se pueden limitar a dos módulos: taconstants.py y talogo.py. El primero define los bloques y paletas; el último define qué código se ejecuta por un bloque.

source: **Note:** As of Version 106, there is also support for plugins. If you can use the plugin mechanism to add support for additional devices, e.g., Arduino, or for making modifications such as are described below without making changes to the standard code base. (The advantage to the latter is that your changes will remain intact even after you upgrade to a newer version.)
es: **Nota:** También a partir de la versión 106, hay soporte de plugins. Tu puedes utilizar el mecanismo de plugin para añadir soporte para dispositivos adicionales, ej., Arduino, o para realizar modificaciones, como se describe a continuación sin realizar cambios a la base de código estándar. (La ventaja de este último es que los cambios permanecerán intactos incluso después de actualizar a una nueva versión. )

source: The tabasics.py file contains the constants that by-in-large determine the behavior of Turtle Art. Notably, the block palettes are defined below. If you want to add a new block to Turtle Art, you could simply add a block of code to that file or to turtle_block_plugin.py, which contains additional blocks. (Even better, write your own plugin!!)
es: El archivo tabasics.py contiene las constantes que en gran medida determinan el comportamiento de Turtle Art. En particular, las paletas de bloque se definen alli. Si deseas agregar un nuevo bloque a Turtle Art, tu puedes simplemente añadir un bloque de código en ese archivo o en turtle_block_plugin.py, que contiene bloques adicionales. (Aún mejor, tus propios complementos !!)

source: Adding a new palette is simply a matter of:
es: La adición de una nueva gama de colores es simplemente una cuestión de:

source: For example, if we want to add a new turtle command, 'uturn', we'd use the add_block method in the Palette class.
es: Por ejemplo, si queremos añadir un nuevo comando de tortuga, 'uturn', usaríamos el método add_block en la clase Palette.

source: Next, you need to define what your block will do. def_prim takes 3 arguments: the primitive name, the number of arguments—0 in this case—and the function to call—in this case, the canvas.seth function to set the heading.
es: A continuación, es necesario definir lo que hará tu bloque. def_prim toma tres argumentos:el nombre de la primitiva, el número de argumentos (0 en este caso) y la función a llamar (en este caso la función seth para establecer la dirección).

source: That's it. When you next run Turtle Art, you will have a 'uturn' block on the 'mypalette' palette.
es: Eso es todo. La próxima vez que ejecute Turtle Art, tendrá un bloque 'uturn' en la paleta 'mypalette'.

source: You will have to create icons for the palette-selector buttons. These are kept in the icons subdirectory. You need two icons: mypaletteoff.svg and mypaletteon.svg, where 'mypalette' is the same string as the entry you used in instantiating the Palette class. Note that the icons should be the same size (55x55) as the others. (This is the default icon size for Sugar toolbars.)
es: Tu tendrás que crear iconos para los botones de selección de paleta-. Estos se mantienen en el subdirectorio de iconos. Necesitas dos iconos: mypaletteoff.svg y mypaletteon.svg, donde 'mypalette' es la misma cadena que la entrada que utilizaste al crear instancias de la clase Paleta. Ten en cuenta que los iconos deben ser del mismo tamaño (55x55) como los otros. (Este es el tamaño de los iconos por defecto para las barras de herramientas de Sugar. )

source: Where to report problems
es: Dónde reportar problemas

source: Please file bug reports `here <https://bugs.sugarlabs.org/newticket?component=Turtleart>`_.
es: Por favor, presentar informes de fallos `aquí <https://bugs.sugarlabs.org/newticket?component=Turtleart>`_.

source: Credits
es: Créditos

source: Walter Bender and Raúl Gutiérrez Segalés maintain the code (with some occasional help from Simon Schampijer)
es: Walter Bender y Raúl Gutiérrez Segalés maintienen el código (con alguna ayuda ocasional de Simon Schampijer)

source: Alan Jhonn Aguiar Schwyn and the Butia Team have provided great feedback and many patches.
es: Alan Jhonn Aguiar Schwyn y el Equipo de Butia han proporcionado una gran realimentacion y muchos parches.
