Repository: tony37/sledhelp
Catalog: translated_po/*/turtleart.po
Languages: es

source: Especially helpful feedback from Tony Forster, Guzmán Trinidad, and Bill Kerr
es: Especialmente util realimentacion de Tony Forster, Guzmán Trinidad, y Bill Kerr

source: Brian Silverman is the first author of Turtle Art
es: Brian Silverman es el primer autor de Turtle Art
