Repository: tony37/sledhelp
Catalog: translated_po/*/turtleart.po
Languages: es

source: About
es: Acerca de

source: Turtle Art, also known as Turtle Blocks, is an activity with a Logo-inspired graphical "turtle" that draws colorful art based on snap-together visual programming elements. Its "low floor" provides an easy entry point for beginners. It also has "high ceiling" programming, graphics, mathematics, and Computer Science features which will challenge the more adventurous student.
es: TortugArte, también conocido como TurtleArt o TurtleBlocks, es una actividad inspriada en Logo con una "tortuga" gráfica que dibuja arte colorido basado en programación visual de elementos que se encajan. Su "piso bajo" ofrece un punto de entrada fácil para los principiantes. También tiene "alto techo" con características de programación, gráficos, matemáticas y Ciencias de la Computación que desafiará al estudiante más aventurero.

source: Where to get Turtle Art
es: Dónde obtener Turtle Art

source: Is included in the OLPC image, and can be downloaded from the `Sugarlabs Activities repository <http://activities.sugarlabs.org/en-US/sugar/addon/4027>`_
es: Está incluido en la imagen de la OLPC, y se puede descargar desde el `repositorio de actividades de Sugar <http://activities.sugarlabs.org/en-US/sugar/addon/4027>`_

source: There are two inter-compatible programs: Turtle Art and Turtle Blocks. Turtle Art, which closely parallels the Java version of Turtle Art maintained by Brian Silverman, offers a small subset of the functionality of Turtle Blocks. Turtle Blocks is the version included in the Sugar distribution. Sugar users probably want to use Turtle Blocks rather than Turtle Art. (Also see Turtle Confusion, a collection of programming challenges designed by Barry Newell.)
es: Hay dos programas compatibles: Turtle Art y Turtle Blocks. Turtle Art, que se asemeja mucho a la versión Java de Turtle Art mantenido por Brian Silverman, ofrece un pequeño subconjunto de la funcionalidad de los bloques de la tortuga. Turtle Blocks es la versión incluida en la distribución de Sugar. Usuarios de Sugar probablemente quieren usar Turtle Blocks en lugar de Turtle Art. (Véase también 'La confusión de la tortuga', una colección de retos de programación diseñada por Barry Newell.)

source: Using Turtle Art
es: Utilizando Turtle Art

source: Start by clicking on (or dragging) blocks from the Turtle palette. Use multiple blocks to create drawings; as the turtle moves under your control, colorful lines are drawn.
es: Comienze haciendo clic en (o arrastrando) cuadras de la paleta de la tortuga. Utilize múltiples bloques para crear dibujos; cuando la tortuga se mueve bajo tu control, se dibujan líneas de colores.

source: You add blocks to your program by clicking on or dragging them from the palette to the main area. You can delete a block by dragging it back onto the palette. Click anywhere on a "stack" of blocks to start executing that stack or by clicking in the Rabbit (fast) , Turtle (slow) or Bug (debug) buttons |rabit-turtle| on the Project Toolbar.
es: Tu agregas bloques a tu programa haciendo clic en o arrastrándolos desde la paleta a la zona principal. Puedes eliminar un bloque arrastrándolo de nuevo a la paleta. Haz clic en cualquier lugar de una "pila" de bloques para iniciar la ejecución de esa pila o haciendo clic en los botones del conejo (rápido), la tortuga (lento) o insecto (depuración) |rabit-tortuga| en la barra de herramientas del proyecto.

source: Toolbars
es: Barras de herramientas

source: Main Toolbar
es: Barra de herramientas principal

source: From left to right:
es: De izquierda a derecha:

source: Activity toolbar (includes sharing; saving/loading options);
es: Barra de herramientas de actividad (incluye compartir; opciones de guardar / cargar);

source: Edit toolbar (including copy and paste);
es: Barra de herramientas Editar (incluyendo copiar y pegar);

source: View toolbar (including full-screen, coordinate overlays; turtle status, etc.);
es: Barra de herramientas Ver (incluyendo pantalla completa, coordinar superposiciones; situación de la tortuga, etc.. );

source: Palette toolbar (including all programming blocks);
es: Barra de herramientas Paleta (incluyendo todos los bloques de programación);

source: erase canvas;
es: borrar el dibujo;

source: run project fast (rabbit);
es: ejecución rápida de proyecto (conejo);

source: run project slow (snail);
es: ejecución lenta de proyecto (caracol);

source: stop project;
es: abandonar de proyecto;

source: save a snapshot (save a copy of the current state of the project);
es: guardar una instantánea (guardar una copia del estado actual del proyecto);

source: load examples;
es: cargar ejemplos;

source: display help palette;
es: Mostrar paleta de ayuda;

source: stop activity
es: parar actividad

source: Keyboard short cuts for the above: Alt+ palette; blocks; run; walk; stop; erase; e.g., Alt+e will erase the screen. Esc will return from full-screen mode.
es: Atajos de teclado para lo anterior: Alt+ paleta; bloques; ejecutar; paso a paso; detener; borrar; ej. Alt+e borrará la pantalla. Esc volverá desde el modo de pantalla completa.

source: **Notes:** The run buttons are tied to the Start Block. If no Start Block is used, then all blocks are run when either run button is clicked. The "rabbit" button runs the blocks at maximum speed. The "snail" button pauses and displays the turtle and block values between each step.
es: **Notas:** Los botones de ejecución están vinculados al bloque de inicio. Si no se utiliza un bloque de inicio, entonces, todos los bloques se ejecutan cuando se hace clic en cualquiera de los botones de ejecución. El botón de "conejo" ejecuta los bloques a la máxima velocidad. El botón "caracol" pausa y muestra la tortuga y los valores de bloque en cada paso.

source: On older versions of Sugar (e.g., 0.84), the main toolbar will look like this:
es: En versiones anteriores de Sugar (ej. 0.84), la barra de herramientas principal se verá así:

source: Project Toolbar
es: Barra de herramientas Proyecto

source: Project title;
es: Título del proyecto;

source: Write to Journal (on newer versions of Sugar)
es: Escribir al Diario (en las versiones más recientes de Sugar)

source: Keep button (not shown; only appears on older Sugar systems)
es: Botón Guardar (no se muestra; sólo aparece en sistemas de Sugar más antiguos)

source: Share button;
es: Botón Compartir;

source: Share blocks; shown in disable state. Used to share stacks of blocks between collaborators.
es: Compartir Bloques; se muestra en el estado desactivado. Se utiliza para compartir pilas de bloques entre colaboradores.

source: Save as image;
es: Guardar como imagen;

source: Save as Logo;
es: Guardar como Logo;

source: Load a previously saved project from the Sugar Journal;
es: Cargar un proyecto guardado previamente del Diario;

source: Load Python code into a programmable block
es: Cargar código Python en un bloque programable

source: **Notes:**
es: **Notas:**

source: On older Sugar systems, these controls appear on the Import/Export toolbar.
es: En los sistemas Sugar más antiguos, estos controles aparecen en la barra de herramientas de Importación y Exportación.

source: On smaller screens, the load/save buttons are shown on a palette.
es: En las pantallas de menor tamaño, los botones cargar / guardar se muestran en una paleta.

source: To share a stack, click on the share button. The cursor will change to the hand shape Ta-hand-cursor.png. Place the cursor on any block or stack of blocks and click. The blocks will be shared and the cursor will change back to the arrow shape.
es: Para compartir una pila, haz clic en el botón de compartir. El cursor cambiará a la forma de la mano Ta-hand-cursor.png. Coloca el cursor en cualquier bloque o grupo de bloques y haz clic. Los bloques serán compartidos y el cursor se cambiará a la forma de flecha.

source: Edit Toolbar
es: Barra de herramientas de Edición

source: The Edit toolbar is used to copy stacks of blocks to the clipboard and to paste stacks from the clipboard. To copy a stack, click on the copy button or type Ctrl-c. The cursor will change to the hand shape Ta-hand-cursor.png. Place the cursor on any block or stack of blocks and click. The blocks will be copied to the Sugar clipboard and the cursor will change back to the arrow shape. To paste from the clipboard, type Ctrl-v or click the paste button.
es: La barra de herramientas de edición se utiliza para copiar pilas de bloques en el portapapeles y para pegar las pilas desde el portapapeles. Para copiar una pila, haz clic en el botón de copia o pulse Ctrl-c. El cursor cambiará a la forma de la mano Ta-hand-cursor.png. Coloca el cursor en cualquier bloque o grupo de bloques y haz clic. Los bloques se pueden copiar en el portapapeles de Sugar y el cursor se cambiará a la forma de flecha. Para pegar desde el portapapeles, pulse Ctrl-V o haz clic en el botón de pegar.

source: Copy
es: Copia

source: Paste
es: Pega

source: View Toolbar
es: Barra de herramientas Ver

source: Full-screen button;
es: Botón de pantalla completa;

source: Cartesian-coordinate grid;
es: Cuadrícula de coordenadas cartesiana;

source: polar-coordinate grid;
es: Grilla de coordenadas polares;

source: not shown: centimeter-coordinate grid (XO-only);
es: No se muestra: grilla en centímetros (XO-solamente);

source: display of x,y coordinates, heading of turtle;
es: visualización de coordenadas x, y, en dirección de la tortuga;

source: Rescale-coordinates button;
es: Botón Cambiar escala de coordenadas;

source: Grow block size;
es: Incrementar tamaño de bloques;

source: Shrink block size
es: Reducir tamaño de bloques

source: Disable/enable hover help
es: Activar / desactivar la ayuda flotante

source: Palettes Toolbar
es: Barra de herramientas Paletas

source: The palette menus are revealed by clicking on the Block icon on the main toolbar. (On older Sugar systems, select the Projects toolbar. When running Turtle Art from GNOME, the palettes are visible by default.)
es: Los menús de paleta se revelan haciendo clic en el icono Bloques en la barra de herramientas principal. (En los sistemas más viejos de Sugar, selecciona la barra de herramientas de Proyectos. Cuando se ejecuta Turtle Art en GNOME, las paletas son visibles por defecto. )

source: There are ten palettes of program elements available for program construction: Turtle movements; Pen attributes; Color attributes; Numeric operators; Logical operators; Logical blocks; Sensor blocks; Media blocks; Customization functions; and Presentation blocks. An eleventh palette is used for restoring blocks from the trash.
es: Hay diez paletas de elementos de programas disponibles para la construcción de programas: Movimientos de la tortuga; Atributos de pluma; Atributos de color; Operadores numéricos; Operadores lógicos; Bloques lógicos; Bloques de sensores; Bloques multimedia; Funciones de personalización; Bloques de Presentación. Una undécima paleta se utiliza para la restauración de los bloques de la basura.

source: **Note:** Additional palettes may be loaded by plugin extensions to Turtle Blocks.
es: **Nota:** paletas adicionales pueden ser cargados por extensiones para Turtle Blocks.

source: Blocks are dragged from the palette onto the canvas surface. To dispose of a block, drag it back onto the palette. (It will be placed onto the trash palette.)
es: Los bloques se arrastran desde la paleta hasta la superficie del lienzo. Para quitar un bloque, arrastralo de nuevo a la paleta. (Será colocado en la paleta de basura.)

source: The |Showblocks| button, which replaces the Stop button on the main toolbar while the program is executing, is used to reveal the program blocks. Individual palettes can be hidden by clicking on their highlighted tab.
es: El botón |Showblocks|, que reemplaza el botón Detener de la barra de herramientas principal, mientras que el programa se está ejecutando, se utiliza para revelar los bloques de programa. Paletas individuales pueden ocultarse haciendo clic en su lengueta resaltada.

source: Turtle Palette
es: Paleta Tortuga

source: These blocks are used to control the movements of the turtle.
es: Estos bloques se utilizan para controlar los movimientos de la tortuga.

source: forward: move turtle forward
es: adelante: mueve la tortuga hacia delante

source: back: move turtle backward
es: atrás: mueve la tortuga hacia atrás

source: clean: clear the screen and position the turtle in the center of the screen, pen down, color red, heading 0
es: limpiar: borrar la pantalla y la posicionar de la tortuga en el centro de la pantalla, pluma apoyada, color rojo, en dirección 0

source: left: rotate turtle counterclockwise
es: izquierda: girar tortuga en sentido antihorario

source: right: rotate turtle clockwise
es: derecha: girar tortuga en sentido horario

source: arc: move turtle along an arc
es: arco mover la tortuga a lo largo de un arco

source: set xy: set turtle x,y position (0,0) is the center of the screen
es: establecer xy: definir posición x, y de la tortuga. (0,0) es el centro de la pantalla

source: seth: set turtle heading
es: seth: definir dirección de la tortuga

source: xcor: holds current x-coordinate value of the turtle (can be used in place of a number block)
es: xcor: obtiene el valor actual de la coordenada x de la tortuga (se puede utilizar en lugar de un bloque numerico)

source: ycor: holds current y-coordinate value of the turtle (can be used in place of a number block)
es: ycor: obtiene el valor actual de la coordenada y de la tortuga (se puede utilizar en lugar de un bloque numerico)

source: heading: holds current heading value of the turtle (can be used in place of a number block)
es: dirección: tiene el valor del rumbo actual de la tortuga (se puede utilizar en lugar de un bloque numérico)

source: Pen Palette
es: Paleta Pluma

source: These blocks are used to control the attributes of the turtle's pen.
es: Estos bloques se utilizan para controlar los atributos de la pluma de la tortuga.

source: pen up: turtle will not draw when moved
es: pluma arriba: la tortuga no dibujará cuando se mueve

source: pen down: turtle will draw when moved
es: pluma abajo: la tortuga dibujará cuando se mueve

source: set pen size: sets the width of the line drawn by the turtle
es: definir tamaño de pluma: establece el ancho de la línea trazada por la tortuga

source: fill screen: fill the screen with a color/shade and reposition the turtle in the center of the screen
es: llenar pantalla: llenar la pantalla con un color / sombra y cambiar la posición de la tortuga al centro de la pantalla

source: pen size: width of the line drawn by the turtle (can be used in place of a number block)
es: tamaño de la pluma: anchura de la línea trazada por la tortuga (se puede utilizar en lugar de un bloque numérico)

source: set color: sets the pen color
es: definir color: establece el color de la pluma

source: set shade: sets the pen shade
es: definir sombra: establece la sombra de la pluma

source: set gray: sets the gray-level of the pen (Only available in Turtle Blocks)
es: establecer gris: establece el nivel de gris de la pluma (Sólo disponible en Turtle Blocks)

source: color: current pen color (can be used in place of a number block)
es: color: el color actual de la pluma (se puede utilizar en lugar de un bloque numérico)

source: shade: current pen shade (can be used in place of a number block)
es: sombra: la sombra de la pluma actual (se puede utilizar en lugar de un bloque numérico)

source: gray: current pen gray level (can be used in place of a number block) (Only available in Turtle Blocks)
es: gris: nivel actual de gris pluma (se puede utilizar en lugar de un bloque numérico) (Sólo disponible en Turtle Blocks)

source: start fill: starts a filled polygon (straight sides, not arcs)
es: iniciar relleno: inicia un polígono relleno (lados rectos, no arcos)

source: end fill: ends a fill polygon (straight sides, not arcs)
es: final de llenado: termina un polígono relleno (lados rectos, no arcos)

source: Color Palette
es: Paleta de colores

source: These blocks can be used with the set-pen-color block in place of a number block.
es: Estos bloques se pueden usar con el bloque 'seleccionar color' en lugar de un bloque numérico.

source: Numbers Palette
es: Paleta Números

source: These blocks are arithmetic and boolean operators.
es: Estos bloques son operadores aritméticos y booleanos.

source: addition: adds two numeric inputs (also can be used to concatenate strings)
es: suma: añade dos entradas numéricas (también se puede utilizar para concatenar cadenas)

source: subtraction: subtracts the bottom numeric input from the top input
es: resta: resta la entrada numérica de la parte inferior a la entrada superior

source: multiplication: multiplies two numeric inputs
es: Multiplicación: multiplica dos entradas numéricas

source: division: divided top input (numerator) by bottom input (denominator)
es: división: divide la entrada superior (numerador) por la entrada inferior (denominador)

source: identity: identity function (used for spacing blocks)
es: identidad: función identidad (utilizado para los bloques de separación)

source: modulo (remainder): calculates remainder when dividing top input by the bottom input
es: módulo (resto): calcula resto de la división de la entrada superior por la entrada inferior

source: square root (Only available with Turtle Blocks)
es: raíz cuadrada (Sólo disponible en Turtle Blocks)

source: random number: generates a random integer between the minimum and maximum values
es: número aleatorio: genera un entero aleatorio entre los valores mínimos y máximos

source: number block: a numeric input
es: bloque numérico: una entrada numérica

source: greater than: boolean greater than operator (used with flow blocks)
es: mayor que: operador booleano mayor que (utilizado con bloques de flujo)

source: less than: boolean less than operator (used with flow blocks)
es: menor que: operador booleano menor que (utilizado con bloques de flujo)

source: equal to: boolean equal to operator (used with flow blocks)
es: igual a: operador booleano igual a (utilizado con bloques de flujo)

source: not: boolean not (Only available with Turtle Blocks)
es: No: operador booleano no (Sólo disponible en Turtle Blocks)

source: and: boolean and (Only available with Turtle Blocks)
es: y: operador booleano y (Sólo disponible en Turtle Blocks)

source: or: boolean or (Only available with Turtle Blocks)
es: o: operador boolean o (Sólo disponible en Turtle Blocks)

source: Flow Palette
es: Paleta Flujo

source: These blocks control program flow.
es: Estos bloques controlan el flujo del programa.

source: wait: pause program execution (unit is seconds)
es: esperar: detener la ejecución del programa (la unidad es segundo)

source: forever: continuously repeat execute stack under the right flow
es: siempre: repetir continuamente ejecuta la pila incluida a la derecha

source: repeat: repeat the execution of stack under the right flow a specified number of times
es: repetir: repetir la ejecución de pila incluida a la derecha un número determinado de veces

source: if/then: conditional execution of the stack under the right flow (uses boolean operators found on the Number palette)
es: si / entonces: ejecución condicional de la pila de la derecha (utiliza operadores booleanos que se encuentran en la paleta de números)

source: if/then/else: conditional execution of the stack under the center and right flows (uses boolean operators found on the Number palette)
es: si / entonces / sino: ejecución condicional de la pila al centro y a la derecha (utiliza operadores lógicos que se encuentran en la paleta de números)

source: vertical spacer
es: espaciador vertical

source: stop stack: interrupt execution
es: detener pila: interrumpir la ejecución

source: while: execute stack under right flow while the condition is true (uses boolean operators found on the Number palette) (Only available with Turtle Blocks)
es: mientras que: ejecutar pila de la derecha, mientras que la condición es verdadera (utiliza operadores lógicos que se encuentran en la paleta de Número) (Sólo disponible en Turtle Blocks)

source: until: execute stack under right flow until the condition is true (uses boolean operators found on the Number palette) (Only available with Turtle Blocks)
es: hasta: ejecutar la pila de la derecha hasta que la condición es verdadera (utiliza operadores lógicos que se encuentran en la paleta de Números) (Sólo disponible en Turtle Blocks)

source: **Note:** Nesting while and/or until blocks is not always reliable. If you encounter an error, try putting the nested block in a separate stack, accessed with an action block.
es: **Nota:** anidar bloques 'mientras que' y / o 'hasta que' no siempre es fiable. Si encuentras un error, trata de poner el bloque anidado en una pila separada, incluida con un bloque de acción.

source: Blocks Palette
es: Paleta Bloques

source: These blocks are for defining variables and subroutines.
es: Estos bloques son para las variables que definen y subrutinas.

source: start: connects action to toolbar 'Run' button
es: empezar: conecta la acción del botón "Ejecutar" de la barra de herramientas

source: store in box 1: store a number, string, or media object in box 1 (Only available with Turtle Blocks)
es: almacenar en caja 1: almacenar un número, una cadena o un objeto multimedia en la caja 1 (Solo disponible en Turtle Blocks)

source: store in box 2: store a number, string, or media object in box 2 (Only available with Turtle Blocks)
es: almacenar en caja 2: almacenar un número, una cadena o un objeto multimedia en la caja 2 (Solo disponible en Turtle Blocks)

source: text: string input
es: texto: entrada de cadena

source: box 1: current value of box 1 (can be used in place of a number block) (Only available with Turtle Blocks)
es: caja 1: valor actual de la caja 1 (se puede utilizar en lugar de un número de bloque) (Solo disponible en Turtle Blocks)

source: box 2: current value of box 2 (can be used in place of a number block) (Only available with Turtle Blocks)
es: caja 2: valor actual de la caja 2 (se puede utilizar en lugar de un número de bloque) (Solo disponible en Turtle Blocks)

source: box: current value of named box (can be used in place of a number block)
es: caja: valor actual de la caja nombrada (se puede utilizar en lugar de un número de bloque)

source: store in: store a number, string, or media object in a named box
es: almacenar en: almacenar un número, una cadena o un objeto multimedia en una caja nombrada

source: action: top of named action stack
es: acción: la parte superior de la pila de acción nombrada

source: action 1: top of action 1 stack (Only available with Turtle Blocks)
es: acción 1: parte superior de la pila acción 1 (Solo disponible en Turtle Blocks)

source: action 2: top of action 2 stack (Only available with Turtle Blocks)
es: acción 2: parte superior de la pila acción 2 (Solo disponible en Turtle Blocks)

source: action: execute named action stack
es: acción: ejecutar pila acción nombrada

source: action 2: execute action 2 stack (Only available with Turtle Blocks)
es: acción 2: ejecutar la pila acción 2 (Solo disponible en Turtle Blocks)

source: action 1: execute action 1 stack (Only available with Turtle Blocks)
es: acción 1: ejecutar la pila acción 1 (Solo disponible en Turtle Blocks)

source: **Note:** When a named action or named box block are used, new blocks appear on the palette that correspond to these names; e.g., if a top of action stack is rename, "to square", an action block, "to square" is added to the palette.
es: **Nota:** Cuando se utilizan una acción con nombre o un bloque con nombre, nuevos bloques aparecen en la paleta que se corresponden con estos nombres; ej. , Si una pila de acción es renombrada como "cuadrar", un bloque de acción, "cuadrar" se agrega a la paleta.
