Repository: tony37/sledhelp
Catalog: translated_po/*/upgrade_all.po
Languages: es

source: Upgrade all your Software
es: Actualiza todo tu software

source: Your XO comes pre-loaded with the software OS (operating system) designed for the XO. It is a good idea to keep your software up to date because our latest builds fix bugs in earlier releases and they are awesome!
es: Tu XO viene pre-cargado con el sistema operativo diseñado para el XO. Es una buena idea mantener tu software actualizado porque nuestra últimas versiones corrigen errores en versiones anteriores y son impresionantes!

source: The XO-1’s came with Sugar software. Did you know that with the latest software your XO can have both Sugar and GNOME? GNOME provides an option to teach older children in a learning environment that will be familiar and transferable to using Windows or Mac OS. This Chapter will tell you how to upgrade your software.
es: La XO-1 vienen con Sugar instalado.¿Sabías que con el último software de tu XO puedes tener tanto Sugar como GNOME? GNOME proporciona una opción para enseñar a los niños de más edad en un ambiente de aprendizaje que sea familiar y transferible para el uso de Windows o Mac OS. Este capítulo le dirá cómo actualizar el software.

source: The Software Releases can be found here: http://wiki.laptop.org/go/Releases
es: Las versiones de software se pueden encontrar aquí: http://wiki.laptop.org/go/Releases

source: The main page of the OLPC Wiki also contains links to the latest releases. http://wiki.laptop.org
es: La página principal de la OLPC Wiki también contiene enlaces a las últimos versiones http://wiki.laptop.org

source: There several methods of upgrading. Which one is right for you? Most people will want to use the "clean install" method. An overview of the upgrade options can be found here. http://wiki.laptop.org/go/Updating_the_XO
es: Hay varios métodos de actualización. Cuál es el adecuado para usted? La mayoría de la gente querrá utilizar el método de "instalación limpia". Una visión general de las opciones de actualización se puede encontrar aquí. http://wiki.laptop.org/go/Updating_the_XO

source: Clear instructions on how to to change, upgrade, downgrade, or replace your XO's OS can be found in the Release notes. Choose the release (build) that you want to install here: http://wiki.laptop.org/go/Releases Next click on the Release notes for the release you will install.
es: Instrucciones claras sobre la forma de cambiar, mejorar, reducir o reemplazar su sistema operativo de XO se pueden encontrar en las notas de la versión. Elija la liberación (build) que desea instalar aquí: http://wiki.laptop.org/go/Releases Luego haga clic en las notas de la versión para la liberación que va a instalar.

source: Decide whether you want to do a clean install (Installation) which will completely reformat your XO with files from a USB drive, or an online or offline update which will update the current software without erasing the existing Journal. Follow the instruction for the update method chosen.
es: Decide si quieres hacer una instalación limpia (Instalación) que formatea por completo tu XO con archivos de una unidad USB, o una actualización en línea o fuera de línea que actualiza el software actual sin borrar el Diario existente. Sigue las instrucciones para el método de actualización elegido.

source: A clean install uses a USB stick and the "four button procedure" to begin the update. Warning Reminder: This method re-formats your XO and EVERYTHING on your XO will be deleted if you use this method. You will follow the instructions in the Release Notes for the build chosen, and you will need A USB storage device that has at least 1 GB of space free and a computer with Internet access that will allow you to download the required 300-400MB within about an hour.
es: Una instalación limpia utiliza una memoria USB y los "procedimiento de cuatro botones" para iniciar la actualización. Recordatorio Advertencia: Este método formatea tu XO y todo en tu XO se borrará si se utiliza este método. Debes seguir las instrucciones de las notas de la versión para la versión elegida, y se necesita un dispositivo de almacenamiento USB que tenga al menos 1 GB de espacio libre y un ordenador con acceso a Internet que te permitirá descargar los 300-400MB requeridos en aproximadamente una hora.

source: 1 - Battery indicator
es: 1 - Indicador de batería

source: 2 - Power indicator
es: 2 - Indicador de alimentación

source: 3 - Power button
es: 3 - Botón de encendido

source: 4 - Game buttons
es: 4 - Botones de juego

source: Follow these steps to upgrade your XO
es: Sigue estos pasos para actualizar tu XO

source: Connect your XO to its charger.
es: Conecta tu XO a su cargador.

source: Turn off your XO.
es: Apaga tu XO.

source: Connect your prepared USB storage device to your XO.
es: Conecta el dispositivo de almacenamiento USB preparado para tu XO.

source: Next, hold down all four gamepad keys above the power button, and then push the power button to turn the XO on. You will see a message that tells you to "Release the game key to continue". Do not continue until you see this message.
es: A continuación, manten pulsadas las cuatro teclas de juego sobre el botón de encendido, y luego presiona el botón de encendido para encender el XO. Verá un mensaje que le dice que "Release the game key to continue" (Suelte la tecla juego para continuar). No continúes hasta que veas este mensaje.

source: Release the gamepad keys. The reflash process runs automatically; first you will see the XO arrange and color in a grid of boxes, then the XO will display "Rebooting in 10 seconds..."
es: Suelta las teclas de juego. El proceso reflash se ejecuta automáticamente; primero verás al XO organizar y colorear una cuadrícula de cajas, y al final el XO mostrará "El reinicio en 10 segundos. . . "

source: The XO will then restart with a clean image.
es: La XO se reiniciará con una imagen limpia.

source: Enter your name for your XO and then click Next.
es: Escribe tu nombre para tu XO y luego haz clic en Siguiente.

source: Click the XO icon to change the colors and then click Done.
es: Haz clic en el icono de XO para cambiar los colores y luego haz clic en Hecho.

source: Optionally, connect your XO to the Internet, then use the Control Panel to download the latest Activities.
es: Opcionalmente, conecta tu XO a Internet, a continuación, utiliza el panel de control para descargar las últimas actividades.
