Repository: tony37/sledhelp
Catalog: translated_po/*/write.po
Languages: es

source: Write
es: Escribir

source: About
es: Acerca de

source: The Write Activity serves as the document creation Activity in Sugar. Its simple interface provides an easy starting point for children, presenting tools that make writing a story, poem, or essay simple and straightforward. It also supports tools for inserting images, creating tables, and performing layout operations.
es: La actividad Escribir sirve como la actividad de creación de documentos en Sugar. Su sencilla interfaz proporciona un punto de partida fácil para los niños, presentando herramientas que hacen que escribir un cuento, un poema o ensayo sea simple y directo. También es compatible con las herramientas para la inserción de imágenes, creación de tablas, y la realización de operaciones de diseño.

source: Write utilizes the :doc:`/journal`, your work is automatically saved, and :ref:`Collaboration` in the form of peer editing, group storytelling, etc.
es: Escribir utiliza el : doc:`/journal`, el trabajo se guarda automáticamente, y :ref:`Collaboration` en la forma de edición con los compañeros, la narración de cuentos en grupo, etc..

source: The Write Activity can be used to open and edit most common file formats, including ODT, DOC, RTF, TXT, and HTML.
es: La actividad de escritura puede ser utilizada para abrir y editar los formatos de archivo más comunes, incluyendo ODT, DOC, RTF, TXT y HTML.

source: Write is included in OLPC images and can be downloaded from `ASLO <http://activities.sugarlabs.org>`_, search for Paint.
es: Escribir está incluido en las imágenes de OLPC y se puede descargar desde `ASLO <http://activities.sugarlabs.org>`_, buscar Write.

source: Using
es: Uso

source: Here Write has been used to produce some colorful text.
es: Aquí Escribir se ha utilizado para producir un texto colorido.

source: The Toolbars
es: Las barras de herramientas

source: **Tip** Use the :ref:`say_selected_text` feature to have robot Alice read aloud this page in the background, while you explore the Write Activity.
es: **Tip** Utiliza la característica :ref:`say_selected_text` para hacer leer al robot Alice en voz alta esta página en el fondo, mientras explora la actividad de escritura.

source: We look first at the nine buttons in the top row of the toolbar. The buttons open the corresponding tab or toolbar.
es: Miramos primero los nueve botones en la fila superior de la barra de herramientas. Los botones abren la ficha o barra de herramientas correspondiente.

source: Activity tab, or button, here you can enter a name for the page or project. The Description button allows you to add a description to the :doc:`/journal` entry. Thirdly select Private, or My Neighbourhood.
es: Pestaña Actividad, o botón, aquí se puede introducir un nombre para la página o proyecto. El botón Descripción le permite añadir una descripción para la entrada en el :doc:`journal`. En tercer lugar la seleccion Privada o Mi Vecindario.

source: The Edit button: Allows to Copy, Paste, Undo, Redo, and search inside your document.
es: El botón Editar: Permite copiar, pegar, deshacer, rehacer, y buscar dentro de tu documento.

source: The View button: Allows you to zoom in and out of the document and to navigate through the pages quickly.
es: El botón Ver: Te permite acercar y alejar del documento y navegar a través de las páginas de forma rápida.

source: The Speak button. You can have Speak, robot Alice, read your work aloud.
es: El botón Hablar. Puedes hacer Hablar, al robot Alice, leer tu trabajo en voz alta.

source: The Fonts button: Allows you to change the font, size, empphasis, colour and justify.
es: El botón Fuentes: Te permite cambiar el tipo de letra, el tamaño, énfasis, color y justificación.

source: The Paragraph button : Allows you to set heading and list styles.
es: El botón Párrafo: Te permite establecer estilos de título y de listas.

source: The Insert table button : Allows you to insert and adjust a table.
es: El botón Insertar tabla: Permite insertar y ajustar una tabla.

source: The Insert Image button : Allows you to insert images.
es: El botón Insertar imagen: Te permite insertar imágenes.

source: Stop or clpose the Activity.
es: Detener o cerrar la Actividad.

source: The Toolbar Sub Menus
es: El Menu Sub Toolbar

source: Activity button (1)
es: Botón de actividad (1)

source: Allows you to name your file. Click the cursor in the field, the existing text is selected, and a new file name can be entered.
es: Te permite asignar un nombre a tu archivo. Haz clic en el cursor en el campo, se selecciona el texto existente, y un nuevo nombre de archivo se puede introducir.

source: The "pencil and book" icon, the Description button allows you to add a description to the :doc:`/journal` entry.
es: El icono "lápiz y el libro", el botón Descripción te permite añadir una descripción a la entrada del :doc:`/journal`.

source: This button is the collaboration, or sharing "switch". The options are
es: Este botón es el selector de colaboración, o compartir. Las opciones son

source: |Home_key_f3_small.png| Private, this is the non-sharing option, with no networking.
es: |Home_key_f3_small. png| Privado, esta es la opción de no compartir, sin redes.

source: |Neighborhood_key| My Neighbourhood, this is the sharing option, that is, networked with others.
es: |Neighborhood_key| Mi Vecindario, esta es la opción para compartir, es decir, en red con otros.

source: See also below, :ref:`Collaboration`.
es: Véase también más adelante, :ref:`Collaboration`.

source: Export, or Save in Rrich Text Format.
es: Exportar o Guardar en formato de texto rico (RTF).

source: Export, or Save in HTML.
es: Exportar o Guardar en HTML.

source: Export, or Save in Plain text.
es: Exportar o Guardar en Texto sin formato.

source: Export, or Save in Portable Document Format.
es: Exportar o Guardar en formato de documento portátil (PDF).

source: Edit button (2)
es: Botón Editar (2)

source: Copy
es: Copiar

source: Paste
es: Pegar

source: Undo
es: Deshacer

source: Redo
es: Rehacer

source: Search
es: Buscar

source: Back
es: ANterior

source: Forward
es: Siguiente

source: View button (3)
es: Botón Ver (3)

source: Zoom out
es: Alejar

source: Zoom in
es: Acercar

source: Zoom to width
es: Acomodar al ancho

source: Set Zoom
es: Ajuste zoom

source: Quick page navigation
es: Navegación de la página rápida

source: Speak button (4)
es: Botón Hablar (4)

source: Play / Pause the Speak function, robot Alice will read aloud any text which you select. See :ref:`say_selected_text`.
es: Reproducir/Pausar la función Hablar, el robot Alice leerá en voz alta cualquier texto que se seleccione. Ver :ref:`say_selected_text`.

source: Stop robot Alice.
es: Detener robot Alice.

source: Select robot Alice's language.
es: Seleccionar lenguaje del robot Alice.

source: Fonts button (5)
es: Botón Fuentes (5)

source: Name of font
es: Nombre de la fuente

source: Size of font
es: Tamaño de la fuente

source: Bold
es: Destacado

source: Italic
es: Itálico

source: Underline
es: Subrayar

source: Choose a color
es: Elige un color

source: Justify your text to left, centre, right, or fill justify.
es: Justificar el texto a la izquierda, centro, derecha, o llenar.

source: Paragraph button (6)
es: Botón Párrafo (6)

source: Heading 1
es: Título 1

source: Heading 2
es: Título 2

source: Heading 3
es: Título 3

source: Heading 4
es: Título 4

source: Block Text
es: Bloque de texto

source: Plain Text
es: Texto sin formato

source: Select list:
es: Seleccione la lista:

source: Bullet List
es: Lista punteada

source: Dashed List
es: Lista con lineas

source: Numbered List
es: Lista numerada

source: Lower Case List
es: Lista con letras minúsculas

source: Upper Case List
es: Lista con letras mayúsculas

source: The Insert Table button (7)
es: El botón Insertar tabla (7)

source: Create table, in the grid you select the number of rows and columns you want to appear.
es: Crear una tabla, en la cuadrícula puedes seleccionar el número de filas y columnas que deseas que aparezcan.

source: Insert row.
es: Insertar fila.

source: Delete row.
es: Eliminar fila.

source: Insert column.
es: Insertar columna.

source: Delete column.
es: Eliminar columna.

source: The Insert Image button (8)
es: El botón Insertar imagen (8)

source: This button opens the Journal, or attached media, in "search image mode". In the default (non floating) mode the image is inserted and the text is before or after the image. If you insert text before the image, the image is displaced. Sometimes, use a two box table to contain associated text reliably. Use this mode only to place images in tables.
es: Este botón abre el Diario, o medios conectados, en el modo "búsqueda de imagen". En el modo por defecto (no flotante) se inserta la imagen y el texto es antes o después de la imagen. Si inserta el texto antes de la imagen, la imagen se desplaza. Puedes, utilizar una tabla de dos cajas para contener texto asociado confiblemente. Utiliza este modo sólo para colocar las imágenes en tablas.

source: A checkbox allows to have image floating. In floating mode, the text will flush around the image, and the image will stay fixed in one place.
es: Una casilla de verificación permite tener imagen flotante. En el modo flotante, el texto fluye alrededor de la imagen, y la imagen se quedará fija en un solo lugar.

source: Collaboration
es: Colaboración

source: The Write Activity supports collaborative (peer) editing, which means that multiple people can edit the same document at the same time.
es: La actividad de escritura soporta la edición colaborativa, lo que significa que varias personas pueden editar el mismo documento al mismo tiempo.

source: To start a collaboration, either:
es: Para iniciar una colaboración, puedes:

source: send an invitation, or
es: enviar una invitación, o

source: share with the Neighborhood
es: compartir con el Vecindario

source: As with all Sugar Activities, invitations go to specific individuals, but sharing is open to anyone in the Neighborhood View.
es: Al igual que con todas las actividades de Suar, las invitaciones van a individuos específicos, sino el intercambio está abierto a cualquier persona en la Vista Vecibdario.

source: |more| For more on this subject, please see the chapter in this manual on :doc:`/collaborating`.
es: |more| Para más información sobre este tema, consulte el capítulo de este manual en :doc:`/collaborating`.

source: Note to parents and teachers
es: Nota para los padres y maestros

source: Collaboration is a powerful feature of Write, but it is recommended that when you do collaborate, keep the number of people editing the same document to just 2–3 people. Otherwise, there tend to be delays that cause the document to get out of synch from one computer to another. Also, try to avoid using too many large pictures or tables when collaborating, as these objects tend to get scrambled.
es: La colaboración es una caraacterística poderosa de Escribir, pero es recomendableque cuando se colabora se mantenga el número de personas trabajando en un mismo documento en no más de 2 o 3. De lo contrario, tiende a haber retrasos que hacen que el documento pierda la sincronización de un ordenador a otro. Además, trate de evitar el uso de imágenes o tablas demasiado grandes cuando colaboran, ya que estos objetos tienden a ser revueltos.

source: Group Storytelling
es: Cuenta cuentos en Grupo

source: The Dadaists, a cultural movement that began in Europe towards the end of World War I (1916) invented a number of art-construction techniques, including collage and photo montage. Many of their works were collaborative, including exquisite corpse, a method by which a collection of words or images was collectively assembled. Each collaborator adds to a composition in turn, either by following a rule or by being allowed to see the end of what the previous person contributed.
es: Los dadaístas, un movimiento cultural que comenzó en Europa a finales de la Primera Guerra Mundial (1916) inventó una serie de técnicas de arte de la construcción, incluyendo el collage y el fotomontaje. Muchas de sus obras fueron de colaboración, incluyendo el cadáver exquisito, un método por el cual un conjunto de palabras o imágenes se ensamblaba colectivamente. Cada colaborador se suma a una composición, por turnos, ya sea siguiendo una regla o por que se le permite ver el final de lo que la persona anterior contribuyó.

source: A shared instance of Write can be used in a similar way to create a collaborative story, poem, rhyme, or group stream of consciousness.
es: Una instancia compartida de Escribir se puede utilizar de una manera similar para crear una historia, poema o rima en colaboración.

source: Using Write for group storytelling
es: Usando Escribir para contar historias en grupo

source: It is fun and easy to use Write for group storytelling. Simply share a document with a group of friends (or your class); take turns opening the document and adding to the story.
es: Es divertido y fácil de usar de Escribir para contar historias en grupo. Simplemente compartir un documento con un grupo de amigos (o su clase); y turnarse para abrir el documento y agregar a la historia.

source: **Steps:**
es: **Pasos:**

source: Open a document in Write.
es: Abre un documento en Escribir.

source: Type in a rule on the first line for everyone to follow. (Some examples are listed below.)
es: Escribe una regla en la primera línea para que todo el mundo siga. (Algunos ejemplos son listados más abajo. )

source: Go to the Activity tab.
es: Ve a la pestaña Actividad.

source: Select "Share with Neighborhood".
es: Seleccione "Compartir con Vecindario".

source: One at a time, each person in the group should open the shared document by clicking it in the Neighborhood View.
es: Uno a la vez, cada persona en el grupo debe abrir el documento compartido haciendo clic en la Vista Vecindario.

source: During their turn, they should follow the rule to add to the end of the story.
es: Durante su turno, deben seguir la regla a añadir al final de la historia.

source: They should exit Write after they have added to the story. (Important: the person who originally shared the document should not exit Write until everyone has taken their turn.)
es: Deben salir de escritura después de que se han sumado a la historia. (Importante: la persona que originalmente compartió el documento no debe salir de escritura hasta que todos hayan tenido su turno. )

source: After each person has added to the story, the person who started the story should read it aloud to the group.
es: Después de que cada persona ha añadido a la historia, la persona que inició la historia debe leerlo en voz alta al grupo.

source: **Examples**
es: **Ejemplos**

source: Add a sentence that continues the theme of a story.
es: Añadir una frase que continúa con el tema de una historia.

source: Add a new sentence that starts with the last word of the sentence that comes before it.
es: Añadir una nueva oración que comienza con la última palabra de la frase anterior.

source: Add a new word that begins with the same letter as the last letter of the word before it.
es: Añadir una nueva palabra que comienza con la misma letra que la última letra de la palabra anterior.

source: Add an adjective after a noun, a noun after an adjective.
es: Añadir un adjetivo después de un sustantivo, un sustantivo después de un adjetivo.

source: Add a word with one more letter than the word before it (this gets hard for a large group!)
es: Añadir una palabra con una letra más de la palabra anterior (esto se pone difícil para un grupo grande!)

source: Add words in alphabetical order.
es: Añadir palabras en orden alfabético.

source: Letter to the Editor
es: Carta al Editor

source: Writing is one of the most powerful means of personal expression ever invented. The expression, "the pen is mightier than the sword" has rung true through out history.
es: La escritura es uno de los más poderosos medios de expresión personal que se ha inventado. La expresión, "la pluma es más poderosa que la espada" ha sido cierta a través de la historia.

source: It is important that the world hear your voice and you can make you voice heard, whether through a blog, a letter to the editor, a comment on a page in the Wikipedia, or by some other means. Write gives the power of expression as well as the means to share your expression with others.
es: Es importante que el mundo escuche tu voz y que te puedas hacer oír, ya sea a través de un blog, una carta al editor, un comentario en una página en la Wikipedia, o por algún otro medio. Escribir da el poder de expresión, así como el medio para compartir tu expresión con los demás.

source: If you want to write a letter to the editor, you first need to look in the newspaper or on the paper's web site to find their e-mail address for letters. Some newspapers have a policy of publishing all appropriate letters sent to the editor, but most are more selective. All require you to include your complete name, address, and a contact telephone number. You can, however, request that your letter be published with "name withheld" if you want. Most editors call you to verify that you really did write the letter before printing it. They also reserve the right to edit your letter to fit the available space on the page.
es: Si deseas escribir una carta al editor, primero tiene que mirar en el periódico o en la página web del periódico para encontrar su dirección de correo electrónico para las cartas. Algunos periódicos tienen una política de publicar todas las cartas apropiadas remitida al editor, pero la mayoría son más selectivos. Todos requieren que incluir tu nombre completo, dirección y un teléfono de contacto. Puedes, sin embargo, solicitar que tu carta se publique junto con "nombre no revelado" si quieres. La mayoría de los editores te llaman para verificar que realmente has escrito la carta antes de imprimirla. Ellos también se reservan el derecho de editar tu carta para ajustarse al espacio disponible en la página.

source: If you keep your letter short and to the point, you have a better chance of experiencing the thrill of seeing your own words in print. Good luck!
es: Si mantienes tu carta breve y al punto, tienes una mejor oportunidad de experimentar la emoción de ver tus propias palabras en la impresión. Buena suerte!

source: Examples
es: Ejemplos

source: Children in the Galadima School in Abuja, Nigeria used Write to write letters to the president of Nigeria with suggestions about how he could improve the conditions of school for all the children of Nigeria.
es: Los niños de la Escuela Galadima en Abuja, Nigeria utilizan Escribir para escribir cartas al presidente de Nigeria, con sugerencias sobre cómo podría mejorar las condiciones de la escuela para todos los niños de Nigeria.

source: Children in Ban Samkha, Thailand used Write to share ideas with their teachers, their families, and their community.
es: Los niños en Ban Samkha, Tailandia utilizan Escribir para compartir ideas con sus profesores, sus familias y su comunidad.

source: Children in Khairat, India use Write (and Record) to survey their village and compile a report to the community.
es: Los niños en Khairat, India usan Escribir (y Grabar) para hacer una encuesta en su aldea y compilar un informe para la comunidad.

source: Children in Uruguay and Colombia are writing blog entries, also known as blogging. Blog entries are typically chronologically ordered essays or stories.
es: Los niños en Uruguay y Colombia están escribiendo entradas de blog, también conocido como bloggear. Las entradas de blog son típicamente ensayos o cuentos ordenados cronológicamente.

source: Other learning activities
es: Otras actividades de aprendizaje

source: Start a school newspaper.
es: Iniciar un periódico en la escuela.

source: Write an autobiography.
es: Escribir una autobiografía.

source: Interview someone from your community.
es: Entrevista a alguien de tu comunidad.

source: Write an article for the Wikipedia about your community.
es: Escribir un artículo para la Wikipedia acerca de tu comunidad.

source: Credits
es: Créditos

source: Write is based upon Abiword; the Sugar port was done by J.M. Maurer, Martin Sevior, Tomeu Vizoso and Robert Staudinger
es: Escribir se basa en Abiword; la adaptación a Sugar fue hecho por J. M. Maurer, Martin Sevior, Tomeu Vizoso y Robert Staudinger
