Repository: tony37/sledhelp
Catalog: translated_po/ht/*_settings.po
Languages: ht

source: My Settings
ht: Anviwònman mwen

source: The My Settings page in Sugar is similar to a Control Panel or System Settings window in other operating systems. It provides a way to set various values needed by system functions, such as the language for menus and messages, the keyboard layout for typing and otherwise controlling the system, date and time values and format, and much more.
ht: Paj la Anviwònman mwen nan Sugar se menm jan ak yon fenèt Kontwòl Panel oswa System Anviwònman nan lòt sistèm operasyon. Li bay yon fason yo mete plizyè valè yo bezwen pa fonksyon sistèm, tankou lang la pou meni ak mesaj, layout nan klavye pou sezisman ak otreman kontwole sistèm, dat ak lè valè yo ak fòma, ak plis ankò.

source: To access My Settings, go to the Home view and activate the menu on the central XO icon, either by hovering with the cursor, or by right-clicking (O button on an XO). Then select My Settings. The following view appears.
ht: Pou jwenn aksè a Anviwònman mwen, ale nan gade nan Kay ak aktive meni an sou icon nan XO santral, swa pa elikopte ak kurseur a, oswa pa dwa-klike (bouton O sou yon XO). Lè sa a, chwazi Anviwònman mwen. View nan sa yo parèt.

source: My Settings page
ht: Paj Anviwònman mwen

source: Click any icon to open the indicated control. If you make changes, the window will offer you the choice whether to save (check mark) or discard (x) those changes. It may be necessary to reboot the computer or restart the Sugar session in order for the changes to take effect.
ht: Klike sou nenpòt icon yo louvri kontwòl la endike. Si ou kapab fè chanjman, fenèt la pral ofri w chwa pou si wi ou non pou konsève pou (chèk mak) oswa jete (x) chanjman sa yo. Li ka nesesè rdemare òdinatè a oswa rekòmanse sesyon an Sugar nan lòd pou fè chanjman yo yo pran efè.

source: About Me
ht: Sou mwen

source: View and change your XO colors and name.
ht: Wè ak chanje koulè XO ou ak non.

source: About my Computer
ht: Sou òdinatè mwen

source: View technical information about your computer: serial number, software versions (Sugar, firmware, wireless), copyright, and license.
ht: Egzamine enfòmasyon teknik sou òdinatè w lan: nimewo seri, vèsyon lojisyèl (Sugar, firmwèr, san fil), copyright, ak lisans.

source: Background
ht: Jan nou koumanse

source: Date & Time
ht: Dat ak Lè

source: Set timezone for date and time display.
ht: Mete Timezone pou dat ak lè ekspozisyon.

source: View and set activation rules for the frame. Set the dial as to whether you would like the frame to show up instantaneously (right away), never or somewhere in between when you move your cursor to both the corner and edge of your screen.
ht: View ak règleman deklanchman fikse pou ankadreman an. Mete rele nan kòm si ou ta renmen ankadreman an yo montre moute enstantane (touswit), pa janm oswa yon kote nan ant lè ou deplase kurseur ou a tou de kwen an ak kwen nan ekran ou.

source: Language
ht: Lang

source: View and set user interface language. The language you are currently using will show on line 1. If you click on the arrow at the end of the line, you can select another language. Select from the menu by country and language, or click the + icon by the last line to add another line. If there are two or more lines, a - icon will appear by the last line to allow you to delete it.
ht: View, li mete lang koòdone itilizatè. Lang nan w ap kounye a lè l sèvi avèk ap montre sou liy 1. Si ou klike sou flèch la nan fen liy lan, ou ka chwazi yon lòt lang. Chwazi soti nan meni an pa peyi ak lang, oswa klike sou + icon la pa liy ki sot pase a yo ajoute yon lòt liy. Si gen de oswa plis liy, yon - icon ap parèt pa liy ki sot pase a pou pèmèt ou al efase li.

source: Modem Configuration
ht: Modem konte genyen

source: Enter settings for a mobile broadband connection to a cellular (3G) network. Not required for WiFi.
ht: Antre nan anviwònman pou yon mobil bande koneksyon nan yon selilè (3 G) rezo. Pa obligatwa pou fil.

source: Network
ht: Rezo

source: View and change settings for turning off wireless in order to save battery power, and view or set the jabber server name for collaboration.
ht: View ak chanjman anviwònman pou sinon koupe fil yo nan lòd pou konsève pou pouvwa batri, ak gade oswa mete non an sèvè Jabber pou kolaborasyon.

source: Software update
ht: Software aktyalizasyon

source: If you are able, check over the Internet for software updates, and install any that are available.
ht: Si ou se kapab, tcheke sou entènèt la pou dènye lojisyèl, ak enstale nenpòt ki disponib.

source: Configure your Web Services
ht: Configured Sèvis Web ou

source: Manage your online accounts and interventions to Journal.
ht: Jere kont sou entènèt ou ak entèvansyon Journal.
