Repository: tony37/sledhelp
Catalog: translated_po/ht/abacus.po
Languages: ht

source: About
ht: Sou

source: Abacus lets the learner explore different representations of numbers using different mechanical counting systems developed by the ancient Romans and Chinese. There are several different variants available for exploration: a suanpan, the traditional Chinese abacus with 2 beads on top and 5 beads below; a soroban, the traditional Japanese abacus with 1 bead on top and 4 beads below; the schety, the traditional Russian abacus, with 10 beads per column, with the exception of one column with just 4 beads used for counting in fourths; and the nepohualtzintzin, a Mayan abacus, 3 beads on top and 4 beads below (base 20). There is also a binary abacus, a hexadecimal abacus, and several abacuses that lets you calculate with common fractions: 1/2, 1/3, 1/4, 1/5, 1/6, 1/8, 1/9, 1/10, and 1/12. And there is a customization toolbar that lets you design your own abacus. The Incan abacus (Yupana) as a standalone program.
ht: Abacus pèmèt elèv k ap aprann nan eksplore reprezantasyon diferan nan nimewo lè l sèvi avèk diferan sistèm mekanik konte devlope pa Women yo ansyen ak Chinwa. Gen plizyè varyant diferan ki disponib pou eksplorasyon: yon suanpan, abak a tradisyonèl Chinwa ak 2 pèl sou tèt ak 5 pèl anba a; yon soroban, tradisyonèl abak Japonè a ak 1 chaplèt sou tèt ak 4 pèl anba a; schety a, abak nan tradisyonèl, Ris, ak 10 pèl pou chak kolòn, ak eksepsyon de yon kolòn ak jis 4 pèl yo itilize pou konte nan kar; ak nepohualtzintzin an, yon abak Maya, 3 pèl sou tèt ak 4 pèl anba a (baz 20). Genyen tou yon abak binè, yon abak ekzadesimal, ak plizyè abacuses ki pèmèt ou kalkile ak fraksyon komen: 1/2, 1/3, 1/4, 1/5, 1/6, 1/8, 1/9, 1/10, ak 1/12. Apre sa, se yon ba ikòn personnalisation ki pèmèt ou desine abak pwòp ou a. Abak a Incan (Yupana) kòm yon pwogram otonòm.

source: Using Abacus
ht: Lè l sèvi avèk Abacus

source: Clearing the abacus
ht: Netwaye abak a

source: Before you start an arithmetic operation, you need to "clear" the abacus. The upper beads should be positioned against the top of the frame and the lower beads should be positioned against the bottom of the frame. This is the default position for the abacus when you launch the activity.
ht: Anvan ou kòmanse yon operasyon aritmetik, ou bezwen "klè" abak a. Pèl a anwo yo ta dwe positionné kont tèt la nan ankadreman an ak pèl yo pi ba yo ta dwe positionné kont fon an nan ankadreman an. Sa a se pozisyon nan default pou abak a lè ou lanse aktivite a.

source: Note that some of the abacuses (e.g., the schety) do not have any upper beads. In such cases, all of the beads should start in the down position. Also note that the Clear Button on the main toolbar will also clear the abacus for you.
ht: Remake byen ke kèk nan abacuses yo (e. g. , Schety a) pa gen okenn pèl anwo. Nan ka sa yo, nan tout pèl yo ta dwe kòmanse nan yon pozisyon nan desann. Epitou sonje ke bouton an Klè sou ba zouti a prensipal pral klè tou abak la pou ou.

source: Reading the abacus
ht: Lekti abak a

source: In each column, the bottom beads represent 1s and the top beads represent 5s. (The exception is the column in the schety with only 4 beads. These are 1/4 each.) So for each bead you raise up from the bottom in a column add 1 and for each bead you lower from the top in the same column, add 5.
ht: Nan chak kolòn, pèl yo anba reprezante 1S ak pèl an tèt yo reprezante 5s. (Eksepsyon a se kolòn nan nan schety la ak sèlman 4 pèl. Sa yo se 1/4 chak. ) Se konsa, pou chak chaplèt ou ogmante moute anba nan fon an nan yon kolòn ajoute 1 epi pou chak chaplèt ou pi ba nan tèt la nan menm kolòn nan, ajoute 5.

source: The columns themselves represent decimal positions from right to left, e.g., 1s, 10s, 100s, 1000s, etc. (There are some exceptions: (1) the nepohualtzintzin uses base 20, e.g., 1s, 20s, 400s, 8000s, etc.; (2) on the schety, the beads to the right of the column with just four beads are 0.1s, 0.01s, 0.001s, and 0.0001s; the black beads on the Caacupé abacus are fractions; and the custom abacus lets you choose whatever (integer) base you want.)
ht: Kolòn yo tèt yo reprezante pozisyon desimal de dwat a gòch, e. g. , 1, 10, 100s, 1000s, elatriye. (Genyen kèk eksepsyon: (1) nepohualtzintzin a itilize baz 20, e. g. , 1, 20s, 400s, 8000s, elatriye. ; (2) sou schety a, pèl yo a dwat a kolòn a ak jis kat pèl yo se 0. 1, 0. 01s, 0. 001s, ak 0. )

source: The current value is always displayed on the frame. Experiment and you will quickly learn to write and read numbers.
ht: Valè aktyèl la se toujou parèt sou ankadreman an. Eksperyans epi w ap byen vit aprann yo ekri epi li nimewo.

source: Examples: In the gallery below, several simple examples are shown. In the gallery of images above, the number 54321 is shown on each of the different abaci.
ht: Men kèk egzanp: Nan galri a anba a, plizyè egzanp ki senp yo montre. Nan galri a nan imaj pi wo a, se nimewo a 54321 montre sou chak nan Abacı nan diferan.

source: From left to right,
ht: De gòch a dwat,

source: 1 bottom bead is up, corresponding to 1 unit
ht: 1 chaplèt anba a se leve, ki koresponn a 1 inite

source: 1 top bead is down, corresponding to 5 units
ht: 1 tèt chaplèt se desann, ki koresponn a 5 inite

source: 5 bottom beads are up, also corresponding to 5 units
ht: 5 pèl anba yo moute, tou ki koresponn a 5 inite

source: 1 bottom bead is up and 1 top bead is down, corresponding to 6 units
ht: 1 chaplèt anba a se leve, li 1 tèt chaplèt se desann, ki koresponn a 6 inite

source: 5 bottom beads are up and 1 top bead is down, corresponding to 10 units (time to "carry" to the left)
ht: 5 pèl anba yo moute ak 1 tèt chaplèt se desann, ki koresponn a 10 inite (tan nan "pote" nan bò gòch la)

source: This 10 is equivalent to...
ht: Sa a 10 se ekivalan a. . .

source: ... this 10
ht: . . . sa a 10

source: Note: The display always assumes a fixed unit column, but you can override this choice.
ht: Remak: ekspozisyon a toujou pansé ké yon kolòn inite fiks, men ou ka pase sou desizyon chwa sa a.

source: The beads moved most recently are highlighted.
ht: Pèl an te deplase pi resamman yo make.

source: Addition
ht: Adisyon

source: To add, simply move in more beads to represent the number you are adding. There are two rules to follow: (1) whenever you have a total of 5 units or more on the bottom of a column, cancel out the 5 by sliding the beads back down and add a five to to the top; and (2) whenever you have a total of 10 units or more in a column, cancel out the 10 and add one unit to the column immediately to the left. (With the nepohualtzintzin, you work with 20 rather than 10.)
ht: Pou ajoute, tou senpleman deplase nan plis pèl reprezante ki kantite w ap ajoute. Gen de règ yo swiv: (1) nenpòt lè ou gen yon total de 5 inite oswa plis sou anba a nan yon kolòn, anile soti nan 5 pa glisman pèl yo tounen desann epi ajoute yon senk a nan tèt la; ak (2) nenpòt lè ou gen yon total de 10 inite oswa plis nan yon kolòn, anile soti 10 an epi ajoute yon inite kolòn nan imedyatman nan bò gòch la. (Avèk nepohualtzintzin a, w ap travay avèk 20 olye ke 10. )

source: Example: 4+3+5+19+24=55
ht: Egzanp: 4 + 3 + 5 + 19 + 24 = 55

source: from left to right,
ht: de gòch a dwat,

source: carry 5s to next column
ht: pote 5s nan pwochen kolòn

source: Subtraction
ht: Soustraksyon

source: Subtraction is the inverse of addition. Move out beads that correspond to the number you are subtracting. You can "borrow" from the column immediately to the left: subtracting one unit and adding 10 to the current column.
ht: Soustraksyon se envès la nan de sa. Deplase soti pèl ki koresponn ak nimewo a ou ap soustraksyon. Ou ka "prete" nan kolòn nan imedyatman nan bò gòch la: soustraksyon yon inite epi ajoute 10 a kolòn nan aktyèl.

source: cary 10 to the right
ht: CARY 10 a dwat a

source: Multiplication
ht: Miltiplikasyon

source: There are several strategies for doing multiplication on an abacus. In the method used in the example below, the multiplier is stored on the far left of the abacus and the multiplicand is offset to the left by the number of digits in the multiplier. The red indicator is used to help keep track of where we are in the process.
ht: Gen plizyè estrateji pou fè miltiplikasyon sou yon abak. Nan metòd la itilize nan egzanp ki anba a, se miltiplikatè a ki estoke sou byen lwen kite nan abak a epi li se multiplikand a konpanse pa kantite chif nan miltiplikatè a kite a. Se endikatè a wouj itilize ede kenbe tras nan kote nou ye nan pwosesis la.

source: 486×24=? Begin by placing 24 in the left-most columns and 486 offset from the far right by two columns (since 24 has two digits). Set the indicator to the right of the multiplicand.
ht: Mete endikatè ki a dwat a multiplikand la.

source: Move the indicator over one column to the left.
ht: Deplase endikatè a sou yon kolòn sou bò goch la.

source: Division
ht: Divizyon

source: Simple division (by a single-digit number) is the inverse of multiplication. In the example below, the dividend is put on the left (leaving one column vacant for the quotient) and the divisor on the right.
ht: Senp divizyon (pa yon kantite sèl-chif) se envès nan miltiplikasyon. Nan egzanp ki anba la a, se dividann a mete yo sou bò gòch la (kite yon kolòn vid pou kosyan an) ak divizè a sou bò dwat la.

source: 123456789÷2=? Place the dividend (123456789) on the left, leaving one blank column. Place the divisor (2) on the right.
ht: Mete divizè a (2) sou bò dwat la.

source: Working from the left to the right, divide a digit in the quotient and then move the indicator one column to the right. 1÷2=0.5
ht: K ap travay soti nan bò gòch la sou bò dwat la, divize yon chif nan kosyan an ak lè sa a deplase endikatè ki yon kolòn a dwat a. 5

source: The result is 61728394.5.
ht: Rezilta a se 61728394. 5.

source: Fractions
ht: Fraksyon

source: The fraction abacus lets you add and subtract common fractions: 1/2, 1/3, 1/4, 1/5, 1/6, 1/8, 1/9, 1/10, and 1/12, The fractional value is determined by the number of black beads on a rod, e.g., to work with thirds, use the rod with three beads, to work with fifths, use the rod with five beads.
ht: Abak a fraksyon pèmèt ou fè adisyon ak soustraksyon fraksyon komen: 1/2, 1/3, 1/4, 1/5, 1/6, 1/8, 1/9, 1/10, ak 1/12, fraksyon nan Se valè detèmine pa ki kantite pèl nwa sou yon baton, e. g. , Yo travay avèk tyè, sèvi ak baton an ak twa pèl, yo travay avèk senkyèm, sèvi ak baton an ak senk pèl.

source: The rods with white beads are whole numbers in base 10; from left to right 100000, 10000, 1000, 100, 10, and 1.
ht: Branch yo ak pèl blan yo se nonb antye nan baz 10; de gòch a dwat 100000, 10000, 1000, 100, 10, ak 1.

source: The toolbars
ht: Bar yo

source: From left to right:
ht: De gòch a dwat:

source: project-toolbar button see below edit-toolbar button see below abacus-toolbar button see below customization-toolbar button clear button clear the abacus stop button exit the activity
ht: bouton pwojè-toolbar gade pi ba a bouton edit-toolbar gade pi ba a bouton abak-toolbar gade pi ba a personnalisation-toolbar bouton bouton klè klè sòti nan abak bouton sispann aktivite a

source: copy copy current value to clipboard paste paste a value from the clipboard into the abacus
ht: kopi kopi valè aktyèl la clipboard keratin kole yon valè soti nan clipboard a nan abak a

source: rods select the number of rods: top beads select the number of beads on the top of the frame bottom select the number of beads on the bottom of the frame factor select the multiplication factor of top beads (e.g., on the Chinese abacus, each top bead counts as 5× the value of a bottom bead on the same rod) base select the base to determine the value of bottom beads across rods; this is 10 on most conventional abacuses, but 20 on the Mayan abacus, 16 on the hexadecimal abacus, and 2 on the binary abacus. create you must push this button to activate the selections you've made
ht: branch bwa chwazi nimewo ki nan branch: tèt pèl chwazi nimewo ki nan pèl sou tèt la nan pati anba a ankadreman chwazi nimewo ki nan pèl sou anba a nan faktè a ankadreman chwazi faktè a miltiplikasyon nan pèl tèt (e. g. kreye ou dwe pouse bouton sa-a yo sa aktive seleksyon yo ou te fè

source: Gallery of abaci
ht: Galeri nan fo

source: suanpan (Chinese)
ht: suanpan (Chinwa)

source: soropan (Japanese)
ht: soropan (Japonè)

source: schety (Russian)
ht: schety (Ris)

source: nepohualtzintzin (Mayan)
ht: nepohualtzintzin (Maya)

source: binary (base 2)
ht: binè (baz 2)

source: hexadecimal (base 16)
ht: ekzadesimal (baz 16)

source: fractions (1/2, 1/3, 1/4,...)
ht: fraksyon (1/2, 1/3, 1/4,. . . )

source: decimal (base 10)
ht: desimal (baz 10)

source: Cuisenaire-style rods (fractions)
ht: Branch Cuisenaire-style (fraksyon)

source: custom, as shown: octal (base 8)
ht: koutim, menm jan yo montre: oktal (baz 8)

source: Learning with Abacus
ht: Aprann ak Abacus

source: `Some lesson plans <http://wiki.sugarlabs.org/go/Activities/Abacus/Worksheet>`_ for using Abacus are found here.
ht: `Gen kèk leson plan <http: // wiki. sugarlabs. org / ale / Aktivite / Abacus / Worksheet> `_ pou lè l sèvi avèk Abacus yo jwenn isit la.

source: Using beads or pebbles, you can make an abacus. What is the difference between the abacus on the computer and a physical abacus?
ht: Lè l sèvi avèk pèl oswa ti wòch, ou ka fè yon abak. Ki sa ki se diferans ki genyen ant abak la sou òdinatè a ak yon abak fizik?

source: It is possible to create a custom abacus. I often use the example of `Sumerian mathematics <https://en.wikipedia.org/wiki/Babylonian_mathematics#Sumerian_mathematics_.283000_.E2.80.94_2300_BC.29>`_: the Sumerians counted on the digital bones (phalanges) of their fingers, so the base of their counting system was 12. All of the 12s (and 60s) we have in our mathemateics, e.g., 12 hours, 60 seconds, etc. have their roots in Sumerian math. But the Sumerians never invented an abacus. What would a Sumerian abacus look like?
ht: Li se posib yo kreye yon abak koutim. Mwen souvan sèvi ak egzanp nan `matematik Sumerian <https: // en. wikipedia. org / wiki / Babylonian_mathematics # Sumerian_mathematics_. 283000_. E2. 80. 94_2300_BC. 29> `_: sumeryen yo konte sou zo yo dijital (falanj) nan dwèt yo, se konsa baz la nan sistèm konte yo te 12. Tout moun nan 12s yo (ak 60s) nou gen nan nou an mathemateics, e. g. , 12 èdtan, 60 segonn, elatriye. gen rasin yo nan Sumerian matematik. Men, yo pa janm sumeryen envante yon abak. Ki sa ki ta yon abak Sumerian sanble?

source: Extending Abacus
ht: Pwolonje Abacus

source: A fun project is to compare calculations using Abacus with the Calculate Activity. Which is faster? Which is more accurate? Which is better for estimating? Which is better for comparing?
ht: Yon pwojè plezi se yo konpare kalkil lè l sèvi avèk Abacus ak Kalkile aktivite a. Ki se pi vit? Ki se pi egzak? Ki se pi bon pou estime? Ki se pi bon pou konpare?

source: Abacus supports paste, so you can take numeric values from other programs and paste them into the abacus to see what their representations are; for example, I often paste numbers into the hexadecimal abacus as a quick way of converting decimal to hexidecimal.
ht: Abacus sipòte keratin, kidonk, ou ka pran nimerik valè soti nan lòt pwogram ak keratin yo nan abak a yo wè sa ki yo se reprezantasyon; pou egzanp, mwen souvan kole nimewo nan ekzadesimal nan abak kòm yon fason rapid nan konvèti desimal hexidecimal.

source: Abacus also supports copy, so you can take a sum calculated on an abacus and export it into SimpleGraph or some other data-visualization Activities.
ht: Abacus sipòte tou kopi, kidonk, ou ka pran yon sòm kalkile sou yon abak ak ekspòtasyon li nan SimpleGraph oswa kèk lòt aktivite done-vizyalizasyon.

source: A fun collaborative mode might be to have a number randomly selected and each sharer work independently to post it on the abacus of their choice first. There could be a tally of beads awarded for each correct answer.
ht: Yon plezi mòd kolaborasyon ta ka gen yon nimewo tirajosò ak chak travay sharer poukont yo afiche l 'sou abak a nan chwa yo an premye. Ta ka kapab genyen yon tally nan pèl bay pou chak repons ki kòrèk.

source: Reporting Problems
ht: Rapòte Pwoblèm

source: If you discover a bug in the program or have a suggestion for an enhancement, please `file a ticket <https://bugs.sugarlabs.org/newticket?component=Abacus>`_ in our bug-tracking system.
ht: Si ou dekouvri yon ensèk nan pwogram nan oswa ki gen yon sijesyon pou yon amelyorasyon, tanpri `depoze yon tikè <https: // pinèz. sugarlabs. org / newticket? eleman = Abacus> `_ nan sistèm ensèk-Suivi nou an.

source: You can `view the open tickets here. <https://bugs.sugarlabs.org/query?status=accepted&status=assigned&status=new&status=reopened&component=Abacus>`_
ht: Ou ka wè `tikè yo louvri isit la. <Https: // pinèz. sugarlabs. org / query? estati = aksepte & kondisyon = asiyen & kondisyon = nouvo & kondisyon = reouvri & eleman = Abacus> `_

source: References
ht: Referans

source: `Wiki page <http://wiki.sugarlabs.org/go/Activities/Abacus>`_
ht: `Paj Wiki <http: // wiki. sugarlabs. org / ale / Aktivite / Abacus> `_
