Repository: tony37/sledhelp
Catalog: translated_po/ht/about_sugar.po
Languages: ht

source: About Sugar
ht: Sou Sugar

source: What is Sugar?
ht: Ki sa ki se Sugar?

source: *"We like to think that a child's play is unconstrained—but when children appear to feel joyous and free, this may merely hide from their minds their purposefulness; you can see this more clearly when you attempt to drag them away from their chosen tasks. For they are exploring their worlds to see what's there, making explanations of what those things are, and imagining what else could be; exploring, explaining and learning are among a child's most purposeful urges and goals. The playfulness of childhood is the most demanding teacher we have. Never again in those children's lives will anything drive them to work so hard." —Marvin Minsky, The Emotion Machine*
ht: Pou yo eksplore mond yo yo wè sa ki nan gen yo, ki fè eksplikasyon nan sa ki bagay sa yo ye, epi imajine ki lòt bagay ta ka; eksplore, eksplike ak aprantisaj se yo ki pami ankouraje ak objektif ki pi objektif yon timoun. Anjoue la nan anfans se pwofesè ki pi mande nou gen. Pa janm ankò nan lavi timoun sa a ap anyen mete yo nan travay sa difisil

source: Sugar is a learning platform that reinvents how computers are used for education. Collaboration, reflection, and discovery are integrated directly into the user interface. Sugar promotes "studio thinking [1]_" and "reflective practice [2]_". Through Sugar's clarity of design, children and teachers have the opportunity to use computers on their own terms. Students can reshape, reinvent, and reapply both software and content into powerful learning activities. Sugar's focus on sharing, criticism, and exploration is grounded in the culture of free and open-source software (FOSS).
ht: Sugar se yon platfòm aprantisaj ki reenvant jan òdinatè yo te itilize pou edikasyon. Yo Kolaborasyon, refleksyon, ak dekouvèt entegre dirèkteman nan koòdone nan itilizatè. Sugar pwomosyon "estidyo panse [1] _" ak "pratik meditativ [2] _". Atravè klè Sugar a nan konsepsyon, timoun yo ak pwofesè gen opòtinite pou yo sèvi ak òdinatè sou tèm pwòp yo. Elèv yo ka reorganized, reenvante, ak re-aplike tou de lojisyèl ak kontni nan aktivite aprantisaj pwisan. Se konsantre Sugar a sou pataje, kritik, ak eksplorasyon chita nan kilti a nan lojisyèl gratis epi yo louvri-sous (FOSS).

source: |sugar_sharing| Sugar facilitates sharing and collaboration. Children can write documents, share books and pictures, or make music together with ease.
ht: | Sugar_sharing | Sugar fasilite pataje ak kolaborasyon. Timoun yo ka ekri dokiman, liv ak foto pataje, oswa fè mizik ansanm ak fasilite.

source: |sugar_ring| There are no files, folders, or applications. Children interact with Activities. Activities includes an application, data, and history of the interaction that can be used to resume and reflect on the child's work.
ht: | Sugar_ring | Pa gen okenn dosye, dosye, oswa aplikasyon pou. Timoun kominike avèk Aktivite. Aktivite an gen ladan yon aplikasyon, done, ak istwa nan entèraksyon an ki ka itilize yo rezime ak reflete sou travay timoun nan.

source: |sugar_backup| Everything is saved automatically. It is our goal that you will never lose your work. Documents will eventually be synced with a network server, adding additional protection.
ht: | Sugar_backup | Tout se sove otomatikman. Li se objektif nou ke ou pa janm ap pèdi travay ou. Dokiman pral evantyèlman dwe senkronize ak yon sèvè rezo, pandan l ajoute plis pwoteksyon.

source: |sugar_journal| A Journal is used for accessing data. The Journal is a diary of things that you make and actions you take. It is a place to reflect upon your work.
ht: | Sugar_journal | Yon Journal ki itilize pou gen aksè nan done. Journal a se yon jounal pèsonèl de bagay sa yo ke ou fè ak aksyon ou pran. Li se yon kote yo reflechi sou travay ou.

source: |opensource| Sugar is free and open-source software. Sugar is licensed under the GNU GPL; updates will always respect the freedom of its users.
ht: | Opansours | Sugar se lojisyèl gratis epi yo louvri-sous. Se Sugar lisansye dapre GNU gpl la; dènye ap toujou respekte libète a nan itilizatè li yo.

source: Note to parents and teachers The Sugar Philosophy
ht: Remake byen paran ak pwofesè Filozofi nan Sugar

source: Information is about nouns. Learning is about verbs. The Sugar user interface differs from traditional user interfaces in that it is based on both cognitive and social constructivism. We believe that learners should engage in exploration and collaboration. The Sugar platform is based on three defining human principles. These are the pillars of user experience for learning:
ht: Enfòmasyon se sou nouen. Aprantisaj se sou vèb. Koòdone nan itilizatè Sugar diferan de itilizatè interfaces tradisyonèl nan ke li se ki baze sou tou de konstruktivism mantal ak sosyal. Nou kwè ke elèv k ap aprann yo ta dwe angaje yo nan eksplorasyon ak kolaborasyon. Se platfòm la Sugar ki baze sou twa prensip defini imen. Sa yo se poto yo nan eksperyans itilizatè pou aprantisaj:

source: Everyone is a teacher and a learner.
ht: Tout moun se yon pwofesè ak yon elèv k ap aprann.

source: Humans are social beings.
ht: Moun se èt sosyal.

source: Humans are expressive.
ht: Moun yo espresif.

source: Two principles define the Sugar platform:
ht: De prensip defini platfòm la Sugar:

source: You learn through doing, so if you want to learn more, you want to do more.
ht: Ou aprann nan fè, se konsa si ou vle aprann plis, ou vle fè plis.

source: Love is a better master than duty—you want people to engage in things that are authentic to them, things that they love. Internal motivation almost always trumps external motivations.
ht: Entèn motivasyon prèske toujou Vanport motivasyon ekstèn.

source: Three experiences characterize the Sugar platform:
ht: Twa eksperyans karakterize platfòm la Sugar:

source: Sharing: The Sugar interface always shows the presence of other learners. Collaboration is a first-order experience. Students and teachers dialog with each other, support each other, critique each other, and share ideas.
ht: Pataje: Koòdone a Sugar toujou montre prezans nan lòt elèv k ap aprann. Kolaborasyon se yon eksperyans premye-lòd. Elèv yo ak pwofesè dyalòg youn ak lòt, sipòte chak lòt, kritike chak lòt, epi pataje ide.

source: Reflecting: Sugar uses a "Journal" to record each learner's activity. The Journal serves as a place for reflection and assessment of progress.
ht: Reflechi: Sugar sèvi ak yon "Journal" nan dosye aktivite chak elèv k ap aprann nan. Jounal nan sèvi kòm yon kote pou refleksyon ak evalyasyon nan pwogrè.

source: Discovering: Sugar can accommodate a wide variety of users, with different levels of skill in terms of reading, language, and different levels of experience with computing. It is easy to approach, yet it doesn't put an upper bound on personal expression. One can peel away layers and go deeper and deeper, with no restrictions.
ht: Dekouvri: Sugar kapab akomode yon gran varyete nan itilizatè yo, ak diferan nivo konpetans an tèm de lekti, lang, ak diferan nivo eksperyans avèk informatique. Li se fasil apwòch, men li pa mete yon mare anwo sou ekspresyon pèsonèl. Yon moun kapab kale lwen kouch epi ale pi fon ak pi fon, ki pa gen okenn restriksyon.

source: Sugar is written in Python, an easy-to-learn interpreted language [3]_. This allows the direct appropriation of ideas in whatever realm the learner is exploring; music, browsing, reading, writing, programming, or graphics. The student can go further. They are not going to hit a wall. They can, at every level, engage with and affect the very tools they are using for their personal expression.
ht: Sugar ki ekri nan Piton, yon fasil-a-aprann entèprete lang [3] _. Sa a pèmèt Afektasyon an dirèk nan lide nan tou sa domèn elèv k ap aprann nan se eksplore; mizik, Navigasyon, lekti, ekriti, pwogram, oswa grafik. Elèv la ka ale pi lwen. Yo pa yo ale nan frape yon miray. Yo ka, nan chak nivo, angaje ak ak afekte zouti yo trè yo lè l sèvi avèk pou ekspresyon pèsonèl yo.

source: Throughout this manual we have added brief "Note to parents and teachers" sections which explains the philosophy behind the Sugar platform. We hope these sections help you guide your children and students through the learning process.
ht: Pandan tout gid sa a nou te ajoute tou kout "Remake byen paran ak pwofesè" seksyon ki eksplike filozofi a dèyè platfòm lan Sugar. Nou espere seksyon sa yo ede w gide pitit ou yo ak elèv yo atravè tout pwosesis la aprantisaj.

source: Sugar was designed for One Laptop per Child (OLPC), as part of an effort to provide an opportunity for a quality education to every children through the distribution of connected laptop computers, our most powerful tools for expression. Sugar is the user interface used on the OLPC XO laptop.
ht: Sugar te fèt pou Youn Laptop pou chak timoun (OLPC), kòm yon pati nan yon efò yo bay yon opòtinite pou yon bon kalite edikasyon nan tout timoun jiska distribisyon an nan òdinatè pòtatif konekte, zouti ki pi pwisan nou an pou ekspresyon. Sugar se koòdone nan itilizatè itilize sou konpitè pòtatif li a OLPC XO.

source: Sugar Labs is a non-profit foundation whose mission is to produce, distribute, and support the use of the Sugar learning platform. Sugar Labs supports the community of educators and software developers who want to extend the platform and who have been creating Sugar Activities. Sugar is a community project. It is available under the open-source GNU General Public License (GPL) and free to anyone who wants to use or extend it.
ht: Sugar Labs se yon fondasyon ki pa Peye-ki gen misyon se yo pwodwi, distribye, ak sipòte itilize nan platfòm la aprann Sugar. Sugar Labs sipòte kominote a nan edikatè ak devlopè lojisyèl ki vle pou yon ekstansyon pou platfòm la ak ki te kreye Sugar Aktivite. Sugar se yon pwojè kominote. Li disponib anba louvri-sous Lisans lan GNU Jeneral Piblik (GPL) ak lib yo nenpòt moun ki vle itilize oswa pwolonje li.

source: Studio thinking is a term used to describe how visual arts teachers teach and what visual arts students learn. The term is detailed in Studio Thinking: The Real Benefits of Visual Arts Education. Studio thinking includes "studio structures": demonstrations, projects, and critiques; as well as "studio habits of mind": develop craft, engage and persist, envision, express, observe, reflect, stretch and explore, and understand the art world. In the context of Sugar, studio thinking is applied not just to the arts, but to all disciplines.
ht: Panse Studio se yon tèm yo itilize a dekri kouman vizyèl art pwofesè anseye ak sa elèv yo aprann atizay vizyèl. Se yon tèm nan detaye nan Panse Studio: benefis yo reyèl nan vizyèl Edikasyon Art. Panse Studio gen ladan "estrikti estidyo": manifestasyon, pwojè, ak kritik; osi byen ke "abitid estidyo nan tèt ou": devlope atizanal, angaje ak pèsiste, ENVISION, eksprime, obsève, reflechi, detire ak eksplore, ak konprann mond lan atizay. Nan kontèks la nan Sugar, se panse estidyo aplike pa sèlman yo nan ar, men nan tout disiplin.

source: Reflective practice is a concept introduced by Donald Schön in his book The Reflective Practitioner. Reflective practice involves students applying their own experiences to practice while being mentored by domain experts. In the context of Sugar, the expert could be a teacher, a parent, a community member, or a fellow student.
ht: Pratik refleksyon enplike elèv ki aplike pwòp eksperyans yo pratike pandan ke y ap encadré pa ekspè domèn. Nan kontèks la nan Sugar, ekspè an te kapab fè yon pwofesè, yon paran, yon manm nan kominote a, oswa yon elèv parèy.

source: An interpreted language is a programming language whose instructions are interpreted "on the fly" (or compiled to a virtual machine code) as opposed to precompiled. The significance of interpreted languages to the Sugar platform include: platform independence, ease of debugging, ready access to source code, and small program size. Python is a general-purpose, high-level programming language. It emphasizes code readability and features a minimalist syntax and comprehensive standard library.
ht: Yon lang entèprete se yon lang programmation ki gen enstriksyon yo entèprete "sou vole a" (oswa konpile yon kòd machin vityèl) kòm opoze a prekonpile. Siyifikasyon nan entèprete lang nan platfòm la Sugar gen ladan yo: platfòm endepandans yo, fasilite nan debogaj, pare aksè nan kòd sous, ak ti gwosè pwogram. Piton se yon jeneral-bi, wo nivo lang programmation. Li mete aksan sou Kòd lizibilite ak karakteristik yon sentaks minimalist ak bibliyotèk konplè estanda.
