Repository: tony37/sledhelp
Catalog: translated_po/ht/battery.po
Languages: ht

source: Charging the Battery
ht: Pote plent-batri a

source: Using battery power
ht: Lè l sèvi avèk pouvwa batri

source: The XO needs its battery or to be plugged into a wall directly. The laptop will run from either source of power. When you get your battery it should come with some amount of charge. Use the following instructions to install your battery and charge your laptop.
ht: XO a bezwen batri li yo oswa yo dwe konekte nan yon miray dirèkteman. Laptop la ap kouri soti nan swa sous pouvwa. Lè ou jwenn batri ou li ta dwe vini ak kèk kantite lajan pou chaj. Sèvi ak enstriksyon sa yo yo enstale batri ou ak chaje laptop ou.

source: This is the XO battery. The battery goes on the back of your XO.
ht: Sa a se batri a XO. Batri a ale sou do a nan XO ou.

source: Installing the battery
ht: Enstale batri a

source: Line up the four tabs on the new battery with the long edge furthest from the catches.
ht: Liy moute kat onglè yo ki sou batri a nouvo ak pi lwen nan kwen lontan nan kaptur yo.

source: Drop the battery into place.
ht: Drop batri a nan plas.

source: Slide the left-hand side catch to the left, and press the battery gently into place.
ht: Slide trape an bò gòch-men nan bò gòch la, ak laprès batri a dousman nan plas.

source: Slide the right-hand side catch to the left, to lock the battery in place.
ht: Slide trape an bò men dwat-ou a gòch la, fèmen batri a nan plas.

source: Charging the battery
ht: Pote plent-batri a

source: Ensure that the battery is in the back of the XO's case.
ht: Asire w ke batri a se nan do a nan ka XO a.

source: Plug the power cord into your XO.
ht: Ploge kòd la pouvwa nan XO ou.

source: Plug the other end of the power cord into the nearest power source, such as the one connected to the school's generator or a 12 Volt car battery.
ht: Ploge fen a lòt nan kòd la pouvwa nan sous la pouvwa pi pre a, tankou yon sèl la ki konekte nan dèlko lekòl la oswa yon batri machin 12 Volt.

source: Plugging in your XO
ht: Rakorde nan XO ou

source: You can use your XO while it is plugged in, when you are charging the battery or when you have a good source for power. For power sources, you can use the generator supplied by your school, the electrical grid, or another source of electricity.
ht: Ou kapab sèvi ak XO ou pandan y ap li se ploge nan, lè ou ap chaje batri la oswa lè ou gen yon bon sous pou pouvwa. Pou sous pouvwa, ou ka itilize dèlko a apwovizyone lekòl ou pa, griy la elektrik, oswa yon lòt sous elektrisite.

source: When to charge the battery
ht: Lè chaje batri la

source: The battery icon in the Frame fills with color, showing you the current charge, or amount of power in the battery. Move the pointer over the battery icon to see how full the battery is. While the battery charges, the battery light near the power button (shaped like a battery) should display yellow, turning to green when the battery is fully charged. A red light tells you that the battery is running very low and you should charge it soon.
ht: Icon la batri nan ankadreman an plen ak koulè po yo, ki montre ou chaj aktyèl la, oswa kantite lajan ki gen pouvwa nan batri a. Deplase konsèy la sou icon nan batri yo wè ki jan plen batri a se. Pandan ke akizasyon yo batri, limyè a batri tou pre bouton an pouvwa (ki gen fòm tankou yon batri) ta dwe montre jòn, Jezi vire bò vèt lè se batri a chaje nèt. Yon limyè wouj di ou ke batri a ap kouri trè ba epi ou ta dwe peye li pli vit.

source: Troubleshooting
ht: Depanaj

source: If your battery charge gets extremely low during shipping, your XO may not start up. Plugging in external power may not charge the battery.
ht: Si chaj batri ou vin ba anpil pandan anbake, XO ou a pa ka kòmanse moute. Rakorde nan pouvwa ekstèn pa kapab chaje batri a.

source: The solution is to remove the battery, power up the laptop on external power and then insert the battery. Then it will charge and the charging light will be on.
ht: Solisyon an se yo retire batri a, pouvwa moute konpitè pòtatif li a sou pouvwa ekstèn ak Lè sa a, insert batri a. Lè sa a, li pral chaje ak limyè a chaje pral sou.

source: If you're the tinkering type, several more advanced battery troubleshooting tips are at: http://wiki.laptop.org/go/XO_Troubleshooting_Battery.
ht: Si w ap kalite a brikolaj, plizyè pi avanse konsèy batri depanaj se nan: http: // wiki. laptop. org / ale / XO_Troubleshooting_Battery.

source: Locating a battery for replacement
ht: Lokalize yon batri pou ranplasman

source: Refer to http://wiki.laptop.org/go/Directory_of_repair_centers to get to the most recent directory of repair centers, and ask for a replacement battery for your XO.
ht: Gade nan http: // wiki. laptop. org / ale / Directory_of_repair_centers pou li ale nan anyè a ki pi resan nan sant reparasyon, epi mande pou yon batri ranplasman pou XO ou.
