Repository: tony37/sledhelp
Catalog: translated_po/ht/browse.po
Languages: ht

source: About
ht: Sou

source: The Browse activity is your means to explore a wider source of information and content that can be found in what's called the World Wide Web (Internet or Web for short). Although there are some built-in information included on this activity (OLPC Library), to make the most of this activity you need an internet connection. Please see the chapter on "Neighborhood View and Connecting to the Internet".
ht: Aktivite nan Browse se vle di ou yo eksplore yon sous pi laj de enfòmasyon ak kontni ki ka jwenn nan sa ki rele World Wide Web la (entènèt oswa sit entènèt pou kout). Malgre ke gen kèk bati-an enfòmasyon enkli nan aktivite sa a (Bibliyotèk OLPC), yo fè pi plis nan aktivite sa a ou bezwen yon koneksyon entènèt. Tanpri gade chapit sou "Katye View ak Konekte sou entènèt la".

source: The first thing that you will see when you first click on the Browse icon from the Home View is what's called the Home page.
ht: Premye bagay ki ou pral wè lè ou premye klike sou icon nan Browse soti nan View nan Kay se sa ki rele paj la Kay.

source: Using Browse
ht: Lè l sèvi avèk Browse

source: Activity Tool
ht: Zouti pou Aktivite

source: Text/Edit Tool
ht: Tèks / Edit Zouti

source: View Tool
ht: View Zouti

source: Home
ht: Kay

source: Address Bar (URL)
ht: Adrès Bar (URL)

source: Refresh/Reload
ht: Rafrechi / Reload

source: Navigation Arrows (Back & Forward)
ht: Navigasyon Flèch (Retounen & Forward)

source: Stop
ht: One Stop

source: Window tab
ht: Tab Fenèt

source: (Note: To see the name of the tool/button, you can put your mouse arrow on top of its picture)
ht: (Remak: Pou wè non an nan zouti / bouton an, ou ka mete flèch sourit ou sou tèt nan foto li yo)

source: **Activity**
ht: ** Aktivite **

source: **Browse Journal Entry Name** - This will serve as the name of the Journal entry. Change this to something distinctive especially when you have multiple window tabs opened that's related to one particular topic.
ht: ** Browse Journal Antre Non ** - Sa a pral sèvi kòm non an nan antre nan Journal. Chanjman sa a nan yon bagay diferan espesyalman lè ou te onglè fenèt miltip louvri ki nan ki gen rapò ak yon sijè patikilye.

source: **Browse Description Bar** - This will serve as the **Browse** activity description in the Journal.
ht: ** Browse Deskripsyon Bar ** - Sa a pral sèvi kòm ** Browse ** deskripsyon ki aktivite nan jounal la.

source: **Privacy Tool** - Use this to change the privacy setting of the current Browse activity. The default is set to Private.
ht: ** Zouti Privacy ** - Sèvi ak sa a chanje anviwònman an sou vi prive nan aktyèl aktivite nan Browse. Se default a mete nan Prive.

source: **Text Finder and Edit Tool**
ht: ** Tèks Chèche ak Edit Zouti **

source: **Undo** - The Browse activity remembers the last change that you've made on the page. Use this button to step back to the last change that you made.
ht: ** Defèt ** - Aktivite nan Browse sonje chanjman ki sot pase a ke ou te fè nan paj la. Sèvi ak bouton sa-a nan etap tounen nan chanjman ki sot pase a ke ou te fè.

source: **Redo** - Use this button to go back to the current changes that you made after doing an "Undo".
ht: ** Refè ** - Sèvi ak bouton sa a pou tounen nan chanjman sa yo aktyèl ke ou te fè apre yo fin fè yon "Defèt".

source: **Copy** - This is used to copy a text or passage from the current page you are viewing. To do this, you need to first highlight (left-click while dragging your mouse arrow) the text. You know you've highlighted a text when its background color turned grey. Then, press this tool to copy it to the clipboard. A small image on the left hand side of the frame will appear. This "holds" the text you just copied. You can now "paste" this text or just simply click and drag it to other activities. The copied text will disappear once the XO is restarted or shutdown.
ht: ** Kopi ** - Sa a se itilize a kapab bay kopi yon tèks oswa pasaj soti nan paj la kounye a ou se gade. Pou fè sa, ou bezwen premye rekò (kite-klike sou pandan y ap trenen flèch sourit ou) tèks la. Ou konnen ou te make yon tèks lè koulè background li yo te tounen gri. Lè sa a, peze zouti sa a kapab bay kopi li nan clipboard a. Yon imaj ti sou bò men gòch nan ankadreman an ap parèt. Sa a "kenbe" tèks la ou jis kopye. Ou kapab kounye a "paste" tèks sa a oswa jis tou senpleman Sur Et trennen l 'bay lòt aktivite. Se tèks la kopye pral disparèt yon fwa XO a rekòmanse oswa are.

source: **Paste** - This tool is for pasting texts from other activities into the current page that you are viewing. You can only paste texts on areas of the page where pasting is allowed. It will remember this text until the XO is restarted or shutdown.
ht: ** Kole ** - Zouti sa a se pou tèks kole soti nan lòt aktivite nan paj la kounye a ke ou ap gade. Ou kapab sèlman kole tèks sou zòn nan paj la kote kole pèmèt. Li pral sonje tèks sa a jiskaske yo XO a rekòmanse oswa are.

source: **Text Search Bar** -This tool is great to use when you need to quickly find a text on a current page you're viewing. Press the enter key to go down the page. The text that you are looking for would be highlighted in green. Press the little "x" symbol on the right of the bar to erase the text.
ht: ** Tèks Search Bar ** zouti -Sa a se gwo yo sèvi ak lè ou bezwen byen vit jwenn yon tèks sou yon paj aktyèl w ap gade. Peze kle a antre nan desann ale paj la. Tèks la ke ou ap chèche pou ta dwe make nan vèt. Peze ti kras "X" senbòl la sou bò dwat la nan ba a ou efase tèks la.

source: **Text Search Navigation Arrows** - While you can press the Enter key to search down the page, these arrows are useful to search the page. Use the left arrow to go back up the page and the right arrow to go down the page.
ht: ** Tèks Search Navigasyon Flèch ** - Pandan ke ou ka peze kle Antre a nan rechèch desann paj la, flèch sa yo, se itil nan rechèch paj la. Sèvi ak flèch la kite yo ale tounen moute paj la ak flèch la dwa desann ale paj la.

source: **View Tool**
ht: ** View Zouti **

source: **Zoom Out** - When you want to see more of the page, use this tool to make it smaller.
ht: ** Rale soti ** - Lè ou vle wè plis nan paj la, sèvi ak zouti sa a fè li pi piti.

source: **Zoom In** - When you want to see things better, use this tool to make the page bigger.
ht: ** Zoom In ** - Lè ou vle wè bagay pi byen, sèvi ak zouti sa a fè paj la pi gwo.

source: **Full Screen** - You can press this to see the entire page without the toolbar.
ht: ** Full Screen ** - Ou kapab Sur sa a yo wè paj la tout antye san yo pa ba ikòn nan.

source: **Tray Toggle button** - This tool only works when you have things on the tray (the space on the bottom of the Browse page) like pages that you have bookmarked (Please see bookmark description). Use this tool to make the tray visible or invisible. Browse remembers your bookmarked pages even when the tray is not visible. Just simply make it visible again to see those bookmarks.
ht: ** Plato baskil bouton ** - Zouti sa a sèlman travay lè ou gen bagay sa yo sou plato a (espas ki la sou anba a nan paj la Browse) tankou paj ke ou te siye (Tanpri gade deskripsyon makè). Sèvi ak zouti sa a fè plato a vizib oswa envizib. Browse sonje paj siye ou menm lè plato a se pa vizib. Jis tou senpleman fè li vizib ankò nan wè sa yo Bookmarks.

source: **Home Icon**
ht: ** Icône Kay **

source: Clicking this takes you back to the Home Page. Useful when you're lost and need a starting point.
ht: Klike sa a pran ou tounen nan Page a Kay. Itil lè w ap pèdi epi yo bezwen yon pwen depa.

source: **Address Bar**
ht: ** Adrès Bar **

source: Each page on the internet has its own address. The address bar shows you the current web address of the page you are viewing. If you know the web address of a page, you can type it on this bar and press the enter key to navigate to that page.
ht: Chak paj sou entènèt la gen adrès pwòp li yo. Ba a montre ou adrès entènèt adrès la kounye a nan paj la ou se gade. Si ou konnen adrès wèb la nan yon paj, ou ka tape l 'sou ba sa a epi peze kle a antre nan navige nan paj ki.

source: Sometimes it is useful to remember the pages that you visited. Clicking this icon will save the web address of the current page you are viewing. A small thumbnail image of this page will appear on the bottom(tray). Bookmarks are saved only on the current Browse activity. They will not show up when you open a new Browse activity.
ht: Pafwa li se itil nan sonje paj sa yo ke ou te vizite. Klike icon sa a pral delivre adrès wèb la nan paj la kounye a ou se gade. Yon imaj ti thumbnail nan paj sa a ap parèt sou anba a (plato). Bookmarks yo te sove sèlman sou aktyèl aktivite nan Browse. Yo pa ap montre leve lè ou louvri yon nouvo aktivite Browse.

source: **Stop Activity Tool** Closes the current Browse activity.
ht: ** Stop Zouti aktivite ** Fèmen aktyèl aktivite nan Browse.

source: **OLPC Library**
ht: ** OLPC Bibliyotèk **

source: The Browse activity has built in books, information and pages that you can access even without a connection to the internet. Click on any of the texts to see what you can find. Have fun exploring!
ht: Gen aktivite nan Browse bati nan liv, enfòmasyon ak paj ki ou kapab jwenn aksè menm san yo pa yon koneksyon sou entènèt la. Klike sou nenpòt nan tèks yo yo wè sa ki ou ka jwenn. Pran plezi eksplore!

source: Copying Images From The Web
ht: Kopye Imaj soti nan entènèt la

source: Every time you create something whether it's a poem, a book or a nice picture, you own those works. The internet is filled with information and works that result from hard work and creativity of other people. Some owners of those work like to share them freely, but others don't or require that you give them the credit. Sometimes this information can be found on the page you are viewing. When in doubt make sure to make a note in your documentation on where you found the information. A great page for further reading: http://www.copyrightkids.org/
ht: Chak fwa ou kreye yon bagay si li nan yon powèm, yon liv oswa yon foto bèl, ou posede moun travay. Entènèt la se plen ak enfòmasyon ak travay ke rezilta soti nan travay di ak kreyativite nan lòt moun. Gen kèk mèt nan sa yo travay renmen pataje yo ak tout kè, men lòt moun pa fè sa oswa mande pou ke ou ba yo kredi a. Pafwa ka enfòmasyon sa a ka jwenn sou paj la ou se gade. Lè w gen dout asire w ke w fè yon nòt nan dokiman ou sou kote ou te jwenn enfòmasyon ki. Yon gwo paj pou plis lekti: http: // www. copyrightkids. org /

source: To copy an image, point your mouse arrow on the picture and right-click on it (press the button on the bottom of your track pad that has a circle on it). A box similar to the picture shown above will appear with information on the source or web address of the picture along with the file name of the picture. There are two ways to copy an image:
ht: A kapab bay kopi yon imaj, pwen flèch sourit ou a sou foto a ak dwa-klike sou li (peze bouton an sou anba a nan pad tras ou ki gen yon sèk sou li). Yon bwat ki sanble ak foto a montre pi wo a ap parèt ak enfòmasyon sou sous oswa entènèt adrès la nan foto a ansanm ak non an dosye nan foto a. Gen de fason a kapab bay kopi yon imaj:

source: **Keep Image** - this will put a copy of the image to the Journal.
ht: ** Kenbe Imaj ** - sa a pral mete yon kopi imaj la nan jounal la.

source: **Copy Image** - this will place a copy of the image to the clipboard, which you can then drag and drop to another activity. This copy is temporary and will disappear from the clipboard when you shutdown the XO. So if you need to save the image, it is best to do a "Keep Image" instead.
ht: ** Kopi Imaj ** - sa a pral mete yon kopi nan imaj la nan papye a, ki ou ka Lè sa a, trennen ak gout nan yon lòt aktivite. Sa a kopi se pou yon ti tan epi yo pral disparèt nan clipboard a lè ou are XO a. Se konsa, si ou bezwen pou konsève pou imaj la, li se pi bon fè yon "Imaj Kenbe" olye pou.

source: Learning with Browse
ht: Aprann ak Browse

source: Browse gives access to the internet which is a powerful information and communication tool and allows students to participate in the global community and experience. There are so many things on the web that you can use and incorporate in your classroom, but one of the many great ways to start is to help students make sense of where they are in relation to this global context. How far are they from the earthquake's epicenter that rocked Japan? Where is their country's capital? How big is their country compared to others? Where are the historical places in their country and the world that shaped human history and culture? One of the many great tools on the web that can be readily and freely accessed is Google maps (type this on the address bar): http://maps.google.com/
ht: Browse bay aksè a entènèt la ki se yon enfòmasyon ak kominikasyon pwisan zouti ak pèmèt elèv yo patisipe nan kominote mondyal la ak eksperyans. Gen anpil bagay sa yo sou entènèt la ke ou ka itilize ak enkòpore nan sal klas ou, men youn nan fason yo anpil gwo yo kòmanse se ede elèv yo fè sans nan kote yo ye an relasyon ak yon kontèks mondyal sa a. Ki jan lwen yo ye soti nan episant tranbleman tè a nan ki lanse Japon? Ki kote se kapital peyi yo a? Kòman gwo se peyi yo konpare ak lòt moun? Ki kote yo se kote yo istorik nan peyi yo ak mond lan ki gen fòm istwa imen ak kilti? Youn nan gwo zouti yo anpil sou entènèt la ki ka fasilman ak libreman aksè se Google kat (tape sa a sou ba a adrès): http: // kat. Google. com /

source: If you live in an area that is adequately mapped by Google Maps, you can ask students to use the "Get directions" tool on the page to see how they can go from one place to another. The directions tool can also teach students a sense of distance by showing how far two places are from each other. Example, how far do they travel every day for school (Given that sense of distance, how far and how long will it take to get to the nearest city or town)?
ht: Si w ap viv nan yon zòn ki se byen trase pa Google Maps, ou kapab mande elèv yo itilize "Jwenn direksyon" zouti a nan paj la yo wè ki jan yo ka ale soti nan yon kote nan yon lòt. Zouti a direksyon ka anseye tou elèv yon sans de distans pa montre ki jan lwen de kote yo soti nan chak lòt. Egzanp, ki jan lwen yo vwayaje chak jou pou lekòl (Etandone ke sans de distans, ki jan lwen epi depi konbyen tan li pral pran pou li ale nan lavil ki pi pre a oswa vilaj)?

source: Extending Browse
ht: Pwolonje Browse

source: There's a built in Google search bar on the home page of Browse that you can direct students to aid in their research. Help them narrow or expand their search texts to come up with better search results.
ht: Gen nan yon bati nan Google ba rechèch nan paj an kay nan Browse ke ou ka dirije elèv èd nan rechèch yo. Ede yo etwat oubyen etann tèks rechèch yo vini ak pi bon rezilta rechèch.

source: To allow students to be active participants in the global community, communication tools can be freely and readily accessed via Browse: from creating free e-mail accounts to tools that allow people to create their own internet sites and pages.
ht: Pou pèmèt elèv yo yo dwe patisipan aktif nan kominote mondyal la, zouti kominikasyon kapab libreman, e yo fasilman rantre atravè Browse: soti nan kreye kont e-mail gratis yo zouti ki pèmèt moun yo kreye sit pwòp entènèt yo ak paj.

source: But like with any type of exploration, you have to start with caution. Not all information on the internet is good. Start with educating kids to safely use and explore the internet. You can check out sites like: http://www.wiredkids.org/kids/index.html for more information.
ht: Men, tankou ak nenpòt ki kalite eksplorasyon, ou gen yo kòmanse avèk prekosyon. Se pa tout enfòmasyon sou entènèt la se yon bon bagay. Kòmanse ak edike timoun yo sèvi ak san danje ak eksplore entènèt la. Ou ka tcheke deyò sit tankou: http: // www. wiredkids. org / kids / endèks. html pou plis enfòmasyon.

source: Where to report problems
ht: Ki kote yo repòte pwoblèm

source: In http://bugs.sugarlabs.org, component Browse.
ht: Nan http: // pinèz. sugarlabs. org, eleman Browse.

source: Credits
ht: Kredi

source: Browse was developed and maintained by: Lucian, Sascha Silbe, erikos, manuq
ht: Browse te devlope ak mentni pa: Lucian, Sascha Silbe, erikos, manuq

source: Browse can be downloaded from the `Sugar Labs Activities repository <http://activities.sugarlabs.org/>`_.
ht: Ka browse telechaje soti nan `Sugar Labs Aktivite depo a <http: // aktivite. sugarlabs. org /> `_.
