Repository: tony37/sledhelp
Catalog: translated_po/ht/calculate.po
Languages: ht

source: Calculate
ht: Kalkile

source: About
ht: Sou

source: Using Calculate
ht: Lè l sèvi avèk Kalkile

source: For those who have used a scientific calculator, most of the functions of Calculate will be quite familiar.
ht: Pou moun ki te itilize yon kalkilatris syantifik, pi fò nan fonksyon yo nan Kalkile pral byen abitye.

source: The Toolbars are
ht: D yo se

source: Activity, Calculate icon: Name session, Journal entry description, collaborate
ht: Aktivite, Kalkile icon: Non sesyon, Journal deskripsyon antre, kolabore

source: Edit, scissors icon: Copy, Paste
ht: Edit, sizo icon: kopi, keratin

source: Functions, {x}: Square, square root, reciprocal, exponential, power, logarithm, factorial
ht: Fonksyon, {x}: Square, rasin kare, resipwòk, eksponansyèl, pouvwa, logaritm, faktoryèl

source: Trigonometry, triangle icon: sin, cos, tan, sin-1, cos-1, tan-1, sinh, cosh, tanh
ht: Trigonometri, triyang icon: peche, kosinis, tan, peche-1, kosinis-1, tan-1, sinh, matrak, tanh

source: Boolean, Venn diagram icon: and, or, =, !=
ht: Boolean, Venn dyagram icon: ak, oswa, =, =!

source: Constants, Greek letters icon: pi, e, gamma, phi
ht: Konstant, lèt grèk icon: pi, E, gama, phi

source: Plot: Hover menu offers Help
ht: Trase: meni Hover ofri Ede

source: Degrees/Radian angle measure
ht: Degre / Radyan mezi ang

source: Scientific/Engineering notation
ht: Syantifik notasyon / Jeni

source: Number of digits to show: 6, 9, 12, 15
ht: Nimewo nan chif yo montre: 6, 9, 12, 15

source: Base: Decimal, binary, octal, hex
ht: Sèvi: desimal, binè, oktal, Egzagòn

source: Exit
ht: Sòti

source: Getting help
ht: Jwenn èd

source: To see a help option for plot, enter the command
ht: Pou wè yon opsyon èd pou trase, antre nan yo lòd, ki

source: ``help(plot)``
ht: `` Èd (trase) ``

source: on the text entry line.
ht: sou liy lan antre tèks.

source: The general help function is
ht: Fonksyon an èd jeneral se

source: ``help()``
ht: `` Èd () ``

source: The list of help topics is available with the command
ht: Lis la nan èd sijè ki disponib ak yo lòd, ki

source: ``help(index)``
ht: `` Èd (endèks) ``

source: including topics not supported on the menus. Help is not provided for the constants pi, e, gamma (Euler-Mascheroni Constant) and phi (Golden Ratio), but these can be looked up on the Internet. Clicking their icons inserts their numeric values.
ht: ki gen ladan sijè pa sipòte sou meni yo. Ede pa sa yo bay pou pi nan konstan, e, gama (Euler-Mascheroni Constant) ak PHI (Golden Pwopòsyon), men sa yo ka leve je l 'sou entènèt la. Sur icônes yo foure nimerik valè yo.
