Repository: tony37/sledhelp
Catalog: translated_po/ht/chart.po
Languages: ht

source: Chart
ht: Tablo

source: About
ht: Sou

source: |Chart_icon| Chart lets you do graphical representation of simple tabular data, in the form "label: value". It can draw Horizontal/Vertical bar charts, line charts and pie charts.
ht: | Chart_icon | Tablo pèmèt ou fè grafik reprezantasyon nan done senp tabulaire, nan fòm lan "mete etikèt sou: valè". Li ka trase orizontal / vètikal tablo bar, tablo liy ak tablo tat.

source: Using chart
ht: Lè l sèvi avèk tablo

source: Basic Usage
ht: Debaz Itilizasyon

source: First you need to add data to create the graph
ht: Premye ou bezwen yo ajoute done yo kreye graf la

source: You can add data with |add_icon| button
ht: Ou kapab ajoute done ak | add_icon | bouton

source: ... or remove data wih |remove_icon| button
ht: . . . oswa retire done wih | remove_icon | bouton

source: To change the graph title, just change the activity title
ht: Pou chanje tit la graf, jis chanje tit la aktivite

source: Next, you can change the type of the graph
ht: Next, ou kapab chanje kalite a nan graf la

source: Vertical Bars |ver_icon|
ht: Barres Vètikal | ver_icon |

source: Horizontal Bars |hor_icon|
ht: Barres orizontal | hor_icon |

source: Lines |line_icon|
ht: Liy | line_icon |

source: Pie |pie_icon|
ht: | Pie_icon |

source: Configs
ht: Konfig

source: You can change the colors or the horizontal and vertical labels in the configs toolbar |set_icon|
ht: Ou ka chanje koulè yo oswa etikèt yo orizontal ak vètikal nan Konfig toolbar | set_icon la |

source: To enter full screen mode press ``Alt+Return`` or click the |FullScreen_Icon| Icon.
ht: Pou antre nan plein écran mòd laprès `` Alt + Return`` oswa klike | FullScreen_Icon | Icon nan.

source: `Activity page in our activities portal <http://activities.sugarlabs.org/en-US/sugar/addon/4534>`_
ht: `Paj Aktivite nan aktivite nou Portal <http: // aktivite. sugarlabs. org / en-US / sik / addon / 4534> `_

source: Development
ht: Devlopman

source: `Git Repository <http://git.sugarlabs.org//simplegraph>`_
ht: `Ale referansyèl <http: // Ale. sugarlabs. org // simplegraph> `_

source: Chart uses `PyCHA library <https://bitbucket.org/lgs/pycha>`_
ht: Tablo sèvi ak `PyCHA bibliyotèk <https: // bitbucket. org / LGS / fyète> `_

source: Ideas for future releases
ht: Ide pou degaje lavni

source: Show a help tutorial when activity is started from scratch
ht: Montre yon èd leson patikilye lè se aktivite te kòmanse nan grate

source: Share, edit the data with your friends
ht: Share, modifye done yo ak zanmi ou

source: Support
ht: Sipò

source: Support for this activity is provided by the developer
ht: Se Sipò pou aktivite sa a ki ofri pa pwomotè a

source: at http://wiki.sugarlabs.org/go/Activities/SimpleGraph
ht: nan http: // wiki. sugarlabs. org / ale / Aktivite / SimpleGraph

source: or by sending an e-mail to aguz@sugarlabs.org
ht: oswa ou kapab voye yon e-mail aguz @ sugarlabs. org

source: References
ht: Referans

source: `Wiki Page <http://wiki.sugarlabs.org/go/Activities/Chart>`_ `Download Page <http://activities.sugarlabs.org/en-US/sugar/addon/4534>`_
ht: `Wiki Page <http: // wiki. sugarlabs. org / ale / Aktivite / Tablo> `` _ Download Page <http: // aktivite. sugarlabs. org / en-US / sik / addon / 4534> `_
