Repository: tony37/sledhelp
Catalog: translated_po/ht/chat.po
Languages: ht

source: About
ht: Sou

source: The Chat Activity is used to exchange messages with your friends or classmates. You can chat about a topic you are studying or you can share something private that happened in your life. You need at least two active XOs to chat - your own and the one that your friend uses.
ht: Se aktivite a Chat itilize fè echanj mesaj avèk zanmi ou oswa kamarad klas. Ou ka chat sou yon sijè w ap etidye oswa ou ka pataje yon bagay prive sa ki te rive nan lavi ou. Ou bezwen omwen de XO aktif nan chat - pwòp ou a ak yon sèl la ki zanmi ou a itilize.

source: Using Chat
ht: Lè l sèvi avèk Chat

source: Starting Chat
ht: Koumanse Chat

source: Chat creates text conversation with others XO users. Chat is a shared activity, with one or many other "Friends" in your "Neighborhood", or those connected to your olpc mesh network.
ht: Chat kreye konvèsasyon tèks ak lòt moun XO itilizatè. Chat se yon aktivite Pataje, ak youn oswa anpil lòt "zanmi" nan "Katye" ou, oswa moun ki konekte nan rezo may ou OLPC.

source: The Chat Activity icon is a speech bubble. To add the Chat Activity to your home view, click the star on the left side of the icon. Now click on the Chat icon to start.
ht: Icon la Aktivite Chat se yon ti wonn lapawòl. Pou ajoute aktivite a Chat nan gade kay ou, klike sou zetwal la ki sou bò gòch nan icon a. Koulye a, klike sou icon nan Chat yo kòmanse.

source: Sharing Chat
ht: Pataje Chat

source: You can either share Chat publicly or keep it private and invite specific people to join.
ht: Ou kapab swa pati Chat piblikman oswa kenbe li prive ak envite moun espesifik yo rantre nan.

source: In the Chat toolbar, there is a circle icon with a dot. Click on this icon and select the neighborhood or public sharing.
ht: Nan ba ikòn nan Chat, gen yon icon sèk ki gen yon dot. Klike sou icon sa a epi chwazi katye an oswa pataje piblik.

source: When you have selected the Neighborhood View, find a friend to invite and hold the pointer on their icon until the "Invite to" popup appears. Now a Chat icon appears in the menu and the friend gets an invitation to Chat in their frame. Your Chat icon also appears in their Neighborhood view.
ht: Lè ou te chwazi View Katye, jwenn yon zanmi envite epi kenbe konsèy la sou icon yo jiskaske "Envite nan" popup parèt nan. Koulye a, yon icon Chat parèt nan meni an ak zanmi a vin yon envitasyon nan Chat nan ankadreman yo. Icon chat ou tou parèt nan gade Katye yo.

source: You can invite as many other XOs to your Chat as you like, creating a private group discussion. Anyone else who joins can invite others.
ht: Ou ka envite ke anpil lòt XOs an Chat ou tankou ou renmen, kreye yon gwoup diskisyon prive. Nenpòt lòt moun ki mete ka envite lòt moun.

source: Join a Chat
ht: Rantre nan yon Chat

source: You can join a Sugar Chat that has already been started.
ht: Ou ka rantre nan yon Chat Sugar ki te deja te kòmanse.

source: Two or more XO computers from One Laptop Per Child can speak to each other directly without an Internet connection. This is a direct connection. You can also chat with people on the Internet who use Sugar. This section describes joining a chat between two or more XO computers from One Laptop Per Child.
ht: De oubyen plis òdinatè XO soti nan Youn Laptop pou chak timoun ka pale youn ak lòt san yo pa dirèkteman yon koneksyon entènèt. Sa a se yon koneksyon dirèk. Ou kapab tou chat ak moun ki sou entènèt la ki itilize Sugar. Seksyon sa a dekri rantre nan yon chat ant de oswa plis ordinateurs XO soti nan Youn Laptop pou chak timoun.

source: First, look at the Neighborhood View to see if there is an existing Chat you want to join.
ht: Premyèman, gade nan View nan Katye yo wè si gen yon ki egziste deja Chat ou vle rantre nan.

source: **CHAT SAFELY**: Only chat with someone you know. If a someone invites you to chat, don't chat with them unless you know them.
ht: ** Chat SAN PWOBLÈM **: Se sèlman chat ak yon moun ou konnen. Si yon moun envite ou nan chat, pa chat avèk yo sof si ou konnen yo.

source: If you see a XO icon with a little speech bubble icon next to it, that person is in a shared Chat. Several people may be around the Chat icon, showing a group Chat.
ht: Si ou wè yon icon XO ak yon icon ti wonn ti kras lapawòl pwochen li, moun sa a se nan yon Chat Pataje. Plizyè moun ki ka dwe alantou icon la Chat, ki montre yon gwoup Chat.

source: Click the little speech icon, and select the Join option.
ht: Klike sou ikòn nan diskou ti kras, epi seleksyone opsyon ki Join.

source: Then the Chat Activity starts, connected to the shared Chat. You see the other people in the Chat, on the Frame.
ht: Lè sa a, aktivite a Chat kòmanse, ki konekte nan Chat la pataje. Ou wè lòt moun an nan chat la, sou ankadreman an.

source: Chatting
ht: Chita pale enfòmèl

source: Once you are in the Chat Activity, you can begin typing to send a message and chat with the other person. After you type a message you can press the enter key to send it.
ht: Yon fwa ou yo nan aktivite nan Chat, ou ka kòmanse sezisman a voye yon mesaj ak chat ak lòt moun nan. Apre ou tape yon mesaj ou ka peze antre nan la kle yo voye l '.

source: To enter messages type them in the box at the bottom of the Chat Activity. Always press enter at the end of the message. Once you press enter your message appears on your friend's computer.
ht: Pou antre nan mesaj tape yo nan ti bwat la nan pati anba a nan aktivite a Chat. Toujou peze antre nan nan fen a nan mesaj la. Yon fwa ou peze antre nan mesaj ou a parèt sou òdinatè zanmi ou a.

source: Accept an invitation to chat
ht: Aksepte yon envitasyon nan chat

source: You may be invited to chat. An invitation appears as a little speech icon in the upper-left of the screen in every view. (The invitation also appears on the Frame.) The colors of the icon match the colors of the friend who sent the invitation.
ht: Ou ka envite nan chat. Yon envitasyon parèt tankou yon icon diskou ti kras nan anwo-bò gòch la nan ekran an nan chak View. (Envitasyon an tou parèt sou ankadreman an. ) Koulè yo nan icon nan matche ak koulè yo nan zanmi ki voye envitasyon an.

source: You accept the invitation by hovering over the icon and selecting Join. You decline the invitation by selecting Decline.
ht: Ou aksepte envitasyon an pa elikopte sou icon nan epi chwazi Antre nan. Ou refize envitasyon an pa chwazi bès.

source: Things to Do with Chat
ht: Bagay sa yo fè ak Chat

source: Chat is a great for sending messages back and forth with a friend, socializing, and working together on projects.
ht: Chat se yon gwo pou voye mesaj retounen ak lide ak yon zanmi, sosyalize, e travay ansanm sou pwojè.

source: Remember that being polite on a computer is just as important as being polite when you're speaking with someone.
ht: Sonje ke yo te politès sou yon òdinatè se jis enpòtan menm jan yo te politès lè w ap pale ak yon moun.

source: Be polite. Try not to interrupt.
ht: Pou yo janti. Eseye pa entèwonp.

source: Read through what people are saying before you say something.
ht: Li nan sa moun ap di ou anvan ou di yon bagay.

source: Don't type in ALL CAPITAL LETTERS. This style is considered rude as it is like shouting at someone.
ht: pa tape nan TOUT lèt majiskil. Sa a se style konsidere kòm grosye kòm li se tankou t'ap rele byen fò nan yon moun.

source: If you do not speak the same language as another person it may be difficult to communicate with Chat. Be patient. If you have an Internet connection, you can try going to www.google.com/translate and type in a phrase that you want to say in another language so you can be friendly online.
ht: Si ou pa pale lang la menm jan ak yon lòt moun li ka difisil yo kominike avèk Chat. Pran pasyans. Si ou gen yon koneksyon entènèt, ou ka eseye ale nan www. Google. com / tradui ak kalite nan yon fraz ki ou vle di nan yon lòt lang se konsa ou ka dwe zanmitay sou entènèt.

source: It can be fun to make words shorter when typing in a Chat Activity because it is faster, like texting (sending messages) on a mobile phone. For example instead of typing in "how are you?", you can type in "how r u?"
ht: Li kapab plezi yo fè mo ki pi kout lè ou tape nan yon aktivite Chat paske li se pi vit, tankou voye tèks mesaj (voye mesaj) sou yon telefòn mobil. Pou egzanp olye pou yo sezisman nan "ki jan ou ye?", Ou ka tape nan "ki jan ru?"

source: The following are some ways you might like to try using Chat:
ht: Sa ki anba la yo se kèk fason ou ta ka renmen eseye lè l sèvi avèk Chat:

source: Arrange a time to meet friends to play.
ht: Fè aranjman pou yon tan al kontre zanmi yo jwe.

source: Organize a community gathering.
ht: Òganize yon rasanbleman kominote.

source: Bring friends together to talk about doing a group project.
ht: Pote zanmi ansanm yo pale sou fè yon pwojè gwoup.

source: Brainstorm ideas (either "fast and furious" or by taking turns).
ht: Lide Brainstorm (swa "vit ak furious" oswa lè yo pran vire).

source: Ask your teacher questions about your homework.
ht: Poze kesyon pwofesè ou sou devwa ou.

source: Use Chat and write a story with friends online using the Write Activity.
ht: Sèvi ak Chat ak ekri yon istwa ak zanmi sou entènèt lè l sèvi avèk ekri aktivite a.

source: Use Chat to practice writing in a foreign language (see if you can find a native speaker to chat with).
ht: Sèvi ak Chat yo pratike ekri nan yon lang etranje (wè si ou ka jwenn yon oratè natif natal nan chat ak).

source: Organize other Sugar or XO users to meet and learn from each other.
ht: Òganize itilizatè lòt Sugar oswa XO al kontre ak aprann soti nan chak lòt.

source: Use Chat to communicate with a grandparent or other family member.
ht: Sèvi ak Chat yo kominike avèk yon granparan oswa lòt manm nan fanmi an.

source: Take group discussion notes.
ht: Pran nòt gwoup diskisyon.

source: Play a word-association game such as typing the first word that comes to mind when your friend types red.
ht: Jwe yon jwèt mo-asosyasyon tankou sezisman pawòl Bondye a premye ki vini nan lespri lè kalite zanmi ou wouj.

source: Play a role-playing game (for example, have a friend pretend to be a character from a book you are reading, and chat with the role-playing friend).
ht: Jwe yon jwèt wòl-ap jwe (pou egzanp, gen yon zanmi pretann yo dwe yon karaktè soti nan yon liv w ap li, ak chat ak zanmi nan wòl-ap jwe).

source: Use emoticons in Chat
ht: Sèvi ak emoticon nan chat

source: There are ways to tell friends how you feel just by using letters - they can let someone know if you are happy, sad, or having fun. When you make letters look like a face, they are called emoticons.
ht: Gen fason yo di zanmi kijan ou santi ou jis lè l sèvi avèk lèt ​​- yo ka kite yon moun konnen si ou yo kontan, tris, oswa pran plezi. Lè ou fè lèt gade tankou yon figi, yo rele yo emoticon.

source: Some are written so that you read them sideways.
ht: Gen kèk yo ekri pou ke ou li yo sou kote.

source: This is a happy face:
ht: Sa a se yon figi kè kontan:

source: This is a sad face:
ht: Sa a se yon figi tris:

source: This is a wink:
ht: Sa a se yon wink:

source: See if you can find the keys on the keyboard to make the faces
ht: Gade wè si ou ka jwenn kle yo sou klavye a fè fas yo

source: The two dots are the colon key : and the semicolon key ;
ht: De pwen yo se kle nan kolon: ak virgules a kle;

source: The mouth are the parentheses keys ()
ht: Bouch la yo se kle yo parantèz ()

source: You can also make faces that go across:
ht: Ou kapab tou fè fas ki ale atravè:

source: Happy
ht: Ala bon sa bon

source: Sad
ht: USA

source: What other emoticons can you create with text in the Chat Activity?
ht: Ki lòt émoticônes ou kapab kreye ak tèks nan Aktivite nan Chat?

source: Can you draw pictures using only the text symbols on your keyboard? This combination of a symbol and a number looks like a sideways heart <3. "I <3 my XO" means, "I love my XO."
ht: Èske ou ka desine foto l sèvi avèk sèlman senbòl yo tèks sou klavye ou a? Sa a konbinezon de yon senbòl ak yon nimewo sanble yon kè sou kote <3. "Mwen <3 XO mwen an" vle di, "Mwen renmen m 'XO. "

source: Make Friends
ht: Fè zanmi

source: When you are in the Neighborhood View, if you move the pointer over someone, you can see their name, and click Make Friends. When you Make Friends, your new friend appears in your Group View list.
ht: Lè ou nan View nan Katye, si ou deplase konsèy la sou yon moun, ou kapab wè non yo, epi klike sou fè zanmi. Lè ou fè zanmi, nouvo zanmi ou parèt nan lis View Group ou.

source: The Group View list helps you keep a list of your friends online who you like chatting with.
ht: Lis la Group View ede ou kenbe yon lis zanmi ou yo sou entènèt ki ou renmen diskite ak.

source: Read a past log of conversations
ht: Li yon boutèy demi lit sot pase a nan konvèsasyon

source: If you open the Journal Activity to open the Chat in the detail view, you can choose to open the Chat Activity with the Write Activity instead of the Chat Activity window.
ht: Si ou louvri aktivite a Journal yo louvri Chat la nan gade nan detay, ou ka chwazi yo louvri aktivite a Chat ak ekri aktivite a olye pou yo fenèt la Aktivite Chat.

source: Notes for parents and teachers
ht: Nòt pou paran ak pwofesè

source: Chat presents a great opportunity engage children in reading and writing. The natural inclination for children to socialize and express themselves can be channeled in some of the exercises outlined above. (Some children who are by their nature shy and reserved, are more confident speaking up in a chat room.) Chat can be motivating and is an authentic use of language skills, however, preparation and supervision are recommended.
ht: Chat prezante yon gwo opòtinite angaje timoun yo nan lekti ak redaksyon. Ka enklinasyon natirèl la pou timoun yo sosyalize ak eksprime tèt yo dwe afèkte nan kèk nan egzèsis yo endike pi wo a. (Gen kèk timoun ki pa nati yo timid ak rezève, yo gen plis konfyans pale moute nan yon chanm chat. ) Chat ka motivasyon epi li se yon natif natal nan itilize ladrès pou lang, sepandan, preparasyon ak sipèvizyon yo rekòmande.

source: Prepare your children and students:
ht: Prepare pitit ou yo ak elèv yo:

source: Remind them never to chat with someone they don't know.
ht: Fè yo sonje pa janm chat ak yon moun yo pa konnen.

source: Remind them to be courteous and never to use language they wouldn't be comfortable with in their oral communication (for example, it's OK to disagree, but not to be disagreeable).
ht: Fè yo sonje yo dwe koutwa epi pa janm itilize langaj yo pa ta dwe konfòtab ak nan kominikasyon oral yo (pou egzanp, li la OK yo dakò, men se pa yo dwe enkonvenyans).

source: Prepare your chat session:
ht: Prepare sesyon chat ou:

source: Some teachers prepare questions in advance. They can paste these questions into the Chat session from the Clipboard or Write Activity—this helps them stay on task and keeps the pace of the session lively.
ht: Gen kèk pwofesè prepare kesyon an avanse.

source: Ask your students to prepare by posing questions in advance.
ht: Mande elèv ou yo prepare pa Pran pòz kesyon an avanse.

source: As in any classroom discussion, keep the conversation focused on just one or two topics.
ht: Kòm nan nenpòt diskisyon yo, kenbe konvèsasyon an konsantre sou jis youn oubyen de sijè.

source: IT IS SOMETIME USEFUL TO USE ALL-CAPS TO GET EVERYONE'S ATTENTION.
ht: IT se nenpòt moman itil yo sèvi ak tout-bouchon jwenn atansyon TOUT MOUN.

source: Advanced features
ht: Karakteristik avanse

source: Computers not running Sugar can initiate chat connections to a Sugar user by running a Jabber (XMPP) client, either with both computers registered on the same Jabber server or by running a link local XMPP account such as Empathy with salut or Pidgin with Bonjour.
ht: Odinatè pa kouri Sugar ka kòmanse koneksyon chat nan yon itilizatè Sugar pa kouri yon Jabber (XMPP) kliyan, swa ak tou de òdinatè anrejistre nan menm sèvè a Jabber oswa pa kouri yon lyen kont XMPP lokal tankou anpati ak salut oswa Pidgin ak Bonjour.

source: Here's an example of a buddy list on another non-Sugar computer.
ht: Isit la nan yon egzanp nan yon lis zanmi sou yon lòt sik ki pa òdinatè.

source: When you initiating the chat on a non-Sugar computer using a Jabber client, an invitation appears on the Sugar computer and the Sugar user can chat with you as usual except that the colors of the non-Sugar participant's response lines are gray as shown below.
ht: Lè ou kòmanse chat la sou yon òdinatè ki pa Sugar lè l sèvi avèk yon kliyan Jabber, yon envitasyon parèt sou òdinatè a Sugar ak itilizatè a Sugar ka chat avèk ou kòm dabitid eksepte ke koulè yo nan liy repons patisipan an ki pa Peye-Sugar a ki gen koulè gri jan yo montre anba a.

source: Here's what the non-Sugar computer sees on their Jabber client.
ht: Isit la nan sa Sugar ki pa òdinatè a wè sou kliyan Jabber yo.

source: And here's the response as seen on the Sugar computer.
ht: Ak isit la nan repons lan jan yo wè sou òdinatè a Sugar.

source: CHAT SAFELY: Remember, only chat with someone you know. If someone invites you to chat, don't chat with them unless you know them. It's perfectly okay to refuse a chat request.
ht: CHAT san danje: Sonje, se sèlman chat ak yon moun ou konnen. Si yon moun envite ou nan chat, pa chat avèk yo sof si ou konnen yo. Li nan parfe oke yo refize yon demann chat.

source: Note to parents and teachers
ht: Remake byen paran ak pwofesè

source: You can use this feature to chat with Sugar-enabled computers from non-Sugar-enabled computers; hence you can chat with your child or class from a conventional desktop or laptop computer.
ht: Ou kapab sèvi ak karakteristik sa a chat ak òdinatè Sugar ki pèmèt soti nan ki pa Peye-Sugar ki pèmèt òdinatè; kon sa ou ka chat ak pitit ou a oswa klas nan yon Desktop konvansyonèl oswa òdinatè pòtab.
