Repository: tony37/sledhelp
Catalog: translated_po/ht/collaborating.po
Languages: ht

source: Collaborating
ht: Kolabore

source: About Collaborating
ht: Sou Kolabore

source: One of the most important features of Sugar is the ability for you to collaborate, or network, and share a project that you are working on with others. This can take the form of multiple cursors in a document, multiple musical instruments, two players in a game, multiple uses in chat (below), and so on. Many Activities support collaboration, see below, :ref:`Where to get Collaborating`
ht: Youn nan karakteristik ki pi enpòtan nan Sugar se kapasite a pou ou pou w kolabore, oswa rezo a, ak pataje yon pwojè ki w ap travay sou ak lòt moun. Sa a ka pran fòm lan nan kurseur miltip yo nan yon dokiman, enstriman mizik miltip, de jwè nan yon jwèt, itilizasyon miltip nan chat (anba a), ak sou sa. Anpil Aktivite sipòte kolaborasyon, gade pi ba a,: ref: `Ki kote yo ka resevwa Collaborating`

source: This image is from the Activity toolbar of Write, which is an Activity which supports collaboration.
ht: Imaj sa a se soti nan ba ikòn nan aktivite nan Ekri, ki se yon aktivite ki sipòte kolaborasyon.

source: The highlighted button is the collaboration, or sharing, "switch". The options are
ht: Bouton an make se kolaborasyon an, oswa pataje, "switch". Opsyon yo se

source: |Home_key_f3_small.png| Home icon, which, when you hover the cursor over, reveals "Private". This is the non-sharing option, with no networking.
ht: | Home_key_f3_small. png | icon Kay, ki, lè ou hover kurseur a sou, revele "Prive". Sa a se opsyon a ki pa Peye-pataje, ki pa gen okenn rezo.

source: |Neighborhood_key| Neighborhood icon, which, when you hover the cursor over, reveals "My Neighborhood". This is the sharing option, that is, networked.
ht: | Neighborhood_key | Katye icon, ki, lè ou hover kurseur a sou, revele "Katye mwen". Sa a se opsyon a pataje, se sa ki, rezo.

source: In some activities, the collaboration button is grayed (disable), that means the activity can't collaborate.
ht: Nan kèk aktivite, se bouton an kolaborasyon grize (enfim), sa vle di aktivite a pa ka kolabore.

source: Chatting in Chat
ht: Chita pale enfòmèl Nan chat

source: An example of collaboration, or networking, is chatting. Chatting is available in the Sugar Activity Chat.
ht: Yon egzanp sou kolaborasyon, oswa rezo, se diskite. Chita pale enfòmèl a disponib nan Sugar aktivite Chat la.

source: Collaboration in Distance Activity
ht: Kolaborasyon nan Aktivite Distans

source: If you want to share with one of your friends, inside the Activity that you want share, click on the "Home" icon that says "Private" then click on the "Neighborhood" icon, like below.
ht: Si ou vle pataje ak youn nan zanmi ou yo, andedan Aktivite a ke ou vle pataje, klike sou "Kay" icon an ki di "Prive" Lè sa a, klike sou "Katye" icon an, tankou anba a.

source: This will make it available to all other persons connected to your same Ad-hock network. An icon of the Activity you are sharing will appear in the Neighborhood view inviting others to join. To join, all they will need to do is hover over the icon of the Activity you are sharing and click join. (This is also how you join the work of others when they share with you).
ht: Sa a pral fè li disponib nan tout lòt moun ki konekte nan rezo Piblisite-prisons menm ou. Yon icon nan aktivite a ou ap pataje ap parèt nan gade nan Katye envite lòt moun yo rantre nan. Yo rantre nan, tout yo pral bezwen fè se hover sou icon a nan aktivite a ou ap pataje ak klike sou rantre nan. (Sa a se tou ki jan pou w rantre nan travay la nan lòt moun yo lè yo pataje avèk ou).

source: Where to get Collaborating
ht: Ki kote yo ka resevwa Kolabore

source: Collaborating is a built-in function in the following Activities provided in the current Sugar distribution:
ht: Kolabore se yon fonksyon bati-an nan aktivite sa yo bay nan distribisyon an Sugar kounye a:

source: Calculate
ht: Kalkile

source: Distance
ht: Distans

source: Image Viewer (not marked Favorite)
ht: Viewer Imaj (pa make Favorite)

source: Implode
ht: Enplod

source: Maze
ht: Labirent

source: Read
ht: Li

source: Record
ht: Dosye

source: Speak
ht: Pale

source: TamTamMini
ht: Tamtam

source: Write
ht: Ekri

source: Not all Activities are able to collaborate. There are many others available in the `Sugar Labs Activities repository <http://activities.sugarlabs.org/>`_
ht: Se pa tout Aktivite yo kapab kolabore. Gen anpil lòt moun ki disponib nan `Sugar Labs Aktivite depo a <http: // aktivite. sugarlabs. org /> `_
