Repository: tony37/sledhelp
Catalog: translated_po/ht/dimensions.po
Languages: ht

source: Dimensions
ht: Dimansyon

source: About
ht: Sou

source: Dimensions (previously known as Visual Match) is a pattern-matching game written for Sugar; it is included as part of the Honey collection of Sugar add-ons. The object of the game is to find sets of three cards where each attribute—color, shape, number of elements, and shading—either match on all three cards or are different on all three cards.
ht: Dimansyon (deja li te ye kòm Visual Match) se yon jwèt modèl-matche ekri pou Sugar; li se enkli kòm yon pati nan koleksyon an siwo myèl nan Sugar ajoute-ons.

source: Prime Dimensions is the number variant of Dimensions, where instead of shape, three prime numbers, 5, 7, and 11, are used. Texture is replaced by representation, e.g. Arabic numerals, Roman numerals, Mayan numerals, etc.
ht: Premye Dimansyon se Variant a kantite Dimansyon, kote olye pou yo fòm, twa nimewo pwemye, 5, 7, ak 11, yo te itilize. Se Ifas ranplase pa reprezantasyon, e. g. Chif nimeral arab, chif nimeral Women, chif nimeral Maya, elatriye.

source: Word Dimensions is the word variant of Dimensions, where instead of shape, three word categories are used: animal, food, celestial body. Texture is replaced by font attribute: bold, italic, normal.
ht: Pawòl Dimansyon se pawòl Bondye Variant a nan dimansyon, kote olye pou yo fòm, twa kategori mo yo te itilize: bèt, manje, kò selès. Se Ifas ranplase pa font atribi: fonse, italik, nòmal.

source: Visual Match is deprecated.
ht: Se Visual Match Obsoleted.

source: Using Dimensions
ht: Lè l sèvi avèk Dimansyon

source: The Basics
ht: Basics yo

source: Play by clicking on three cards to make a match.
ht: Jwe pa klike sou twa kat fè yon matche ak.

source: As you click, the cards will move to the match area on the left side of the screen. (You can also drag the cards to the match area.)
ht: Kòm ou klike sou, kat yo ap deplase nan zòn nan matche ak sou bò gòch nan ekran an. (Ou kapab tou trennen kat yo nan zòn nan matche ak. )

source: Once three cards are in the match area, a validation test is run:
ht: Yon fwa twa kat yo nan zòn nan matche ak, se yon tès validation kouri:

source: If the cards make a `valid match <http://wiki.sugarlabs.org/go/Activities/Dimensions#Examples_of_valid_matches>`_, a smiley face will appear.
ht: Si kat yo fè yon matche ak `valab <http: // wiki. sugarlabs. org / ale / Aktivite / Dimansyon # Examples_of_valid_matches> `_, yon figi Smiley ap parèt.

source: If they are an `invalid match <http://wiki.sugarlabs.org/go/Activities/Dimensions#Examples_of_invalid_matches>`_, a frowny face will appear, which details as to why the cards do not match. Clicking on the smiley face will result in the match being removed and new cards dealt from the deck. Clicking on the frowny face will remove the last card in the match area back to the right side of the screen.
ht: Si yo yon `matche ak valab <http: // wiki. sugarlabs. org / ale / Aktivite / Dimansyon # Examples_of_invalid_matches> `_, yon figi frowny ap parèt, ki detay kòm poukisa kat yo pa matche ak. Klike sou figi a Smiley, sa pral lakòz nan match la ke yo te retire ak kat nouvo te fè fas nan pil kat la. Klike sou figi a frowny pral retire dènye kat la nan zòn nan matche ak tounen nan bò dwat la nan ekran an.

source: Once the game is over, the screen will fill with smiley faces.
ht: Yon fwa jwèt la se sou, ekran an ap ranpli ak ap fè fas Smiley.

source: `Video of basic game play <http://www.dailymotion.com/video/xbuw5j_visual-match>`_
ht: `Videyo nan jwèt debaz jwe <http: // www. YouTube. com / videyo / xbuw5j_visual-matche ak> `_

source: Note: When Dimensions first starts up, it shows a simple animation of game play. Click on the screen to interrupt the animation and begin play.
ht: Remak: Lè Dimansyon premye kòmanse leve, li montre yon animasyon senp nan jwe jwèt. Klike sou ekran an yo entèwonp animasyon an epi kòmanse jwe.

source: More Details
ht: Plis detay

source: Cards have four different attributes: color, shape, fill texture, and number of elements.
ht: Kat gen kat atribi diferan: koulè, fòm, ranpli teksti, ak nimewo nan eleman.

source: The number version works with prime factors instead of shapes and textures. The word version works with semantic groupings.
ht: Vèsyon an Nimewo travay ak faktè pwemye olye pou yo fòm ak tèkstur. Vèsyon an mo travay ak gwoupman semantik.

source: Matches must be valid across all four attributes. Examples of `valid <http://wiki.sugarlabs.org/go/Activities/Dimensions#Examples_of_valid_matches>`_ and `invalid <http://wiki.sugarlabs.org/go/Activities/Dimensions#Examples_of_valid_matches>`_ matches are shown below.
ht: Alimèt yo dwe valab atravè tout kat atribi. Men kèk egzanp sou `valab <http: // wiki. sugarlabs. org / ale / Aktivite / Dimansyon # Examples_of_valid_matches> `_ ak` valab <http: // wiki. sugarlabs. org / ale / Aktivite / Dimansyon # Examples_of_valid_matches> `_ Yo montre anba a alimèt.

source: A valid match is defined by cards where each attribute is either the same on each card or different on each card, e.g, all three red cards or one red, one green, and one blue card. An invalid match is when two cards share and attribute and the third card does not, e.g., one red and two green cards.
ht: Yon matche ak valab defini nan kat kote chak atribi se swa menm bagay la sou chak kat oswa diferan sou chak kat, e. g, tout twa kat wouj oswa yon sèl wouj, youn vèt, ak yon kat ble. Yon matche ak valab se lè de kat pataje ak atribi ak twazyèm kat la pa fè sa, e. g. , Youn wouj ak de kat vèt.

source: At the end of the game, all of the matches are displayed in a simple animation.
ht: Nan fen an nan jwèt la, nan tout alimèt yo yo ap parèt nan yon animasyon senp.

source: Also, the game state is saved to the Journal and restored upon resume.
ht: Epitou, se eta a jwèt sove nan jounal la ak restore sou rezime.

source: A simple cooperative sharing model is supported.
ht: Yon senp modèl pataje koperativ se sipòte.

source: Everyone works cooperatively to find matches. Only the initiator of the shared session can start new games, change game type or level.
ht: Tout moun ap travay ansanm yo jwenn alimèt. Se sèlman amors a nan sesyon-an pataje ka kòmanse nouvo jwèt, chanje kalite jwèt oswa nivo.

source: Examples of valid matches
ht: Men kèk egzanp sou alimèt ki valab

source: Rows from top to bottom
ht: Ranje depi anwo jouk anba

source: The colors, shapes, and shade match; numbers are different.
ht: Koulè, fòm, ak lonbraj matche ak nan; nimewo yo diferan.

source: The numbers match; colors, shapes and shade are different.
ht: Matche ak nan nimewo; koulè, fòm ak lonbraj yo diferan.

source: Everything is different.
ht: Tout se diferan.

source: Examples of invalid matches
ht: Men kèk egzanp sou alimèt valab

source: two of the same colors (red)
ht: de nan koulè yo menm (wouj)

source: two of the same shape (X)
ht: de nan fòm la menm (X)

source: two of the same shade (solid)
ht: de nan lonbraj la menm (solid)

source: two of the same number (2)
ht: de nan nimewo a menm (2)

source: Additional Features
ht: Karakteristik adisyonèl

source: Dimensions includes a computer (robot) assistant: The robot will help you find matches.
ht: Dimansyon an gen ladan yon òdinatè (robo) asistan: robo la ap ede w jwenn alimèt.

source: It operates on a timer—finding matches after an adjustable number of seconds. The robot is enabled/disabled by clicking on the button the the Tool menu. You can also use the robot as a computer opponent. Decreasing the time between moves increases the challenge.
ht: Se robo la pèmèt / enfim pa klike sou bouton an meni an nan Zouti. Ou kapab tou itilize robo an kòm yon advèsè òdinatè. Diminye tan an ant mouvman ogmante defi a.

source: Dimensions includes Beginner, Intermediate, and Expert Modes.
ht: Dimansyon an gen ladan Beginner, Entèmedyè, ak Ekspè mod.

source: In Beginner Mode, there are only 9 (32) cards and only two card characteristics, In Intermediate mode, there are 27 (33) cards and three card characteristics. In Expert Mode, there are 81 (34) cards and four card characteristics.
ht: Nan Beginner Mode, te gen sèlman 9 (32) kat ak sèlman de Karakteristik kat, Nan mòd Entèmedyè, gen 27 (33) kat ak twa kat Karakteristik. Nan Ekspè Mode, gen 81 (34) kat ak kat Karakteristik kat.

source: Dimensions includes number-search and word-search games in addition to the pattern-search game.
ht: Dimansyon an gen ladan nimewo-rechèch ak mo-rechèch jwèt nan adisyon a jwèt la modèl-rechèch.

source: There is an edit mode so that customized word lists can be used in the Word Game (and shared over the network). Also, you can load custom cards from the Journal.
ht: Gen yon mòd modifye pou ke lis mo Customized kapab itilize nan jwèt la Pawòl (ak pataje sou rezo a). Epitou, ou ka chaje kat koutim soti nan Journal la.

source: The grid layout is arbitrary; there is no need to pick in rows or columns, or one from each column.
ht: Layout a kadriyaj se abitrè; pa gen okenn bezwen yo chwazi nan ranje oubyen kolòn, oswa yon sèl soti nan chak kolòn.

source: The blank cards on the left are a place to display the most recent match; they can be otherwise ignored.
ht: Kat yo vid sou bò gòch la se yon kote yo montre match la ki pi resan; yo ka otreman inyore.

source: A count of number of matches found is shown in the toolbar; when the robot assistant is helping, the count is displayed as two numbers, where the number of matches found by the robot is in parentheses, e.g., 3(2) would indicate that the robot found 2 matches out of a total of 5 (3+2) found so far.
ht: Yon konte nan kantite alimèt yo te jwenn yo montre nan ba ikòn nan; lè asistan nan robo ap ede, se konte a parèt tankou de nonb, kote ki kantite alimèt jwenn pa robo a se nan parantèz, e. g. , 3 (2) ta kapab endike ke robo a te jwenn 2 alimèt soti nan yon total de 5 (3 + 2) yo te jwenn byen lwen tèlman.

source: Dimensions keeps track of your best times (one for Beginner Mode and one for Expert Mode). These times are displayed next to the level-mode buttons on the `Tools Toolbar <http://wiki.sugarlabs.org/go/Activities/Dimensions#The_toolbars>`_.
ht: Dimansyon kenbe tras nan pi bon fwa ou (yonn pou Beginner Mode ak yonn pou Ekspè Mode). Fwa sa yo ap parèt akote bouton sa yo nivo-mòd sou zouti yo `Toolbar <http: // wiki. sugarlabs. org / ale / Aktivite / Dimansyon # The_toolbars> `_.

source: As you improve, Dimensions will automatically advance you to a more difficult level of play.
ht: Kòm ou amelyore, Dimansyon pral otomatikman avanse ou nan yon nivo pi difisil nan jwe.

source: You can select cards using the keyboard:
ht: Ou ka chwazi kat lè l sèvi avèk klavye a:

source: Top Row
ht: Top Ranje

source: Second Row
ht: Dezyèm Ranje

source: Third Row
ht: Twazyèm ranje

source: a, s, d
ht: yon, S, D

source: Fourth Row
ht: Katriyèm ranje

source: Extra (bottom) Row
ht: Siplemantè (anba) Ranje

source: Watch out, because Dimensions can be very addictive.
ht: Gade deyò, paske Dimansyon ka trè depandans.

source: Other modes of play
ht: Lòt mòd nan jwe

source: Number Game
ht: Nimewo Jwèt

source: Everything is different: colors, prime factors, and representations.
ht: Tout se diferan: koulè, faktè pwemye, ak reprezantasyon.

source: Word Game
ht: Pawòl Jwèt

source: The words are from different semantic groups; the colors are different; the font style (bold) matches.
ht: Mo sa yo yo soti nan diferan gwoup semantik; koulè yo yo diferan; style la font (fonse) alimèt.

source: When there is no match
ht: Lè pa gen matche ak

source: On occasion, there is no match among the 12 cards on the grid. If there is no match, three additional cards are dealt along the bottom row as illustrated in the figure above.
ht: Nan okazyon, pa gen okenn matche ak nan mitan 12 kat yo sou griy la. Si pa gen okenn matche ak, twa kat adisyonèl yo te fè fas ansanm ranje anba a kòm ilistre pi wo a nan figi a.

source: Gallery
ht: Galeri

source: From left to right,
ht: De gòch a dwat,

source: Basic play: two dimensions: number and color
ht: Debaz jwe: de dimansyon: Nimewo ak koulè

source: Intermediate play: three dimensions: number, color, and shape
ht: Entèmedyè jwe: twa dimansyon: Nimewo, koulè, ak fòm

source: Advanced play: four dimensions: number, color, shape, and texture
ht: Avanse jwe: kat dimansyon: Nimewo, koulè, fòm, ak teksti

source: Numbers don't match
ht: Numbers pa matche ak

source: Colors don't match
ht: Koulè pa matche ak

source: Shapes don't match
ht: Fòm pa matche ak

source: Textures don't match
ht: Textures pa matche ak

source: Prime factors (1,2,3,5,7 and 11) are used to determine matches
ht: Faktè Premye (1,2,3,5,7 ak 11) yo itilize detèmine alimèt

source: Roman numerals and dots in a circle
ht: Chif nimeral Women ak pwen nan yon sèk

source: Hashes and products
ht: Achaj ak pwodwi

source: Mayan
ht: Maya

source: semantic word groups (animal, food, celestial objects) are used to determine matches
ht: yo te itilize gwoup semantik mo (bèt, manje, manje, objè selès) detèmine alimèt

source: Editing the word list
ht: Koreksyon lis la mo

source: Loading custom cards from the Journal
ht: Loading kat koutim soti nan Journal la

source: Custom cards loaded from the Journal
ht: Kat Custom chaje soti nan Journal la

source: Playing with cards loaded from the Journal
ht: Jwe ak kat chaje soti nan Journal la

source: the source code
ht: kòd la sous

source: Scores can be copied to the clipboard and then plotted by SimpleGraph.
ht: Nòt ka kopye nan clipboard a ak Lè sa a konplo pa SimpleGraph.

source: Learning with Dimensions
ht: Aprann ak Dimansyon

source: At a basic level, Dimensions can be used to enhance the observational skills of young learners; they are repeatedly asked: what is the same? what is different? At a deeper level, the concepts of multidimensional sets can be explored.
ht: Nan yon nivo debaz yo, Dimansyon ka itilize amelyore konpetans yo obsèvasyon nan jèn k ap aprann; yo repete mande: ki sa se menm bagay la? ki sa ki diferan? Nan yon nivo pi fon, konsèp yo nan kouche pluridimansyonèl ka eksplore.

source: The numbers games can be used to explore different arithmetic representations.
ht: Nimewo jwèt yo ka itilize yo eksplore diferan reprezantasyon aritmetik.

source: Extending Dimensions
ht: Pwolonje Dimansyon

source: Exploring the math
ht: Eksplore matematik la

source: The combinatoric math behind Dimensions may be of interest to some learners: See `this <http://en.wikipedia.org/wiki/Set_%28game%29#Basic_Combinatorics_of_Set>`_ for an explanation.
ht: Matematik nan combinatoric dèyè Dimansyon kapab nan enterè nan kèk elèv k ap aprann: Gade `sa a <http: // en. wikipedia. org / wiki / Set_% 28game% 29 # Basic_Combinatorics_of_Set> `_ pou yon eksplikasyon.

source: Creating a custom game
ht: Kreye yon jwèt koutim

source: You can create your own set of cards for Dimensions. Use your favorite program for creating images (Paint, Turtle Art, Record, etc.) to make sets of cards. You need to create at least 9 cards in order to play at the beginner level (3 cards each along 2 dimensions). You can also make a collection of 27 cards (3 cards each along 3 dimensions) or 81 cards (3 cards each along 4 dimensions). The cards must all have the same name in the journal with the exception of a number, beginning with 1 and incrementing by 1, e.g., card.1.png, card.2.png, ... card.9.png. Any image format supported by Sugar should work and you do not have to include the image-type suffix in the title, e.g., card.1, card.2, ... card.9 will also work. Just be sure that the order corresponds to the serialization of your multidimensional space, e.g.:
ht: Ou ka kreye mete pwòp ou nan kat pou Dimansyon. Sèvi ak pwogram pi renmen ou pou kreye imaj (penti, Turtle Atizay, Dosye, elatriye. ) Fè kouche nan kat. Ou bezwen yo kreye omwen 9 kat nan lòd yo jwe nan nivo debutan (3 kat chak ansanm 2 dimansyon). Ou kapab tou fè yon koleksyon 27 kat (3 kat chak ansanm dimansyon 3) oswa kat 81 (3 kat chak ansanm 4 dimansyon). Kat yo dwe gen tout menm non yo nan jounal la ak eksepsyon de yon nimewo, kòmanse ak 1 ak incrementing pa 1, e. g. , Kat. 1. png, kat. 2. png. . . kat. 9. png. Nenpòt fòma imaj sipòte pa Sugar yo ta dwe travay ak ou pa bezwen gen ladan SIFIKS nan imaj-kalite nan Tit, e. g. , Kat. 1, kat. 2,. . . kat. 9 ap travay tou. Jis asire w ke ke lòd la koresponn ak seryalizasyon a nan espas pluridimansyonèl ou, e. g. :

source: card name
ht: Non kat

source: dimension 1
ht: dimansyon 1

source: dimension 2
ht: dimansyon 2

source: my-card.1
ht: kat-mwen. 1

source: one
ht: youn

source: red
ht: wouj

source: my-card.2
ht: kat-mwen. 2

source: two
ht: de

source: my-card.3
ht: kat-mwen. 3

source: three
ht: twa

source: my-card.4
ht: kat-mwen. 4

source: green
ht: vèt

source: my-card.5
ht: kat-mwen. 5

source: my-card.6
ht: kat-mwen. 6

source: my-card.7
ht: kat-mwen. 7

source: blue
ht: ble

source: my-card.8
ht: kat-mwen. 8

source: my-card.9
ht: kat-mwen. 9

source: You load a set of custom cards from the Journal by clicking on the 'import image' icon |imp_img| and selecting any one image of your set. The rest will be loaded automatically.
ht: Ou chaje yon seri kat koutim soti nan Journal la pa klike sou 'imaj enpòte' icon | imp_img la | epi chwazi nenpòt imaj youn nan seri ou. Pral rès la dwe chaje otomatikman.

source: The above cards were generated in `Turtle Art <http://wiki.sugarlabs.org/go/Activities/Turtle_Art>`_. The sample code is supplied with `Turtle Art <http://wiki.sugarlabs.org/go/Activities/Turtle_Art>`_: set.ta, the code generates a deck of cards and saves them as SVG to the Journal.
ht: Kat ki pi wo yo te pwodwi nan `Turtle Art <http: // wiki. sugarlabs. org / ale / Aktivite / Turtle_Art> `_. Se kòd la echantiyon apwovizyone ak `Turtle Art <http: // wiki. sugarlabs. org / ale / Aktivite / Turtle_Art> `_: seri. TA a, kòd a jenere yon pil kat la kat ak ekonomis yo kòm SVG Journal la.

source: Modifying Dimensions
ht: Modifye Dimansyon

source: Show me the code
ht: Moutre m 'kòd la

source: You can explore the Dimensions source code [`cloning the project <http://git.sugarlabs.org/projects/visualmatch/repos/mainline>`_] directly from git.
ht: Ou ka eksplore kòd la sous Dimansyon [`klonaj pwojè a <http: // git. sugarlabs. org / pwojè / visualmatch / repos / prensipal> `_] ki sòti dirèkteman nan git.

source: Reporting Problems
ht: Rapòte Pwoblèm

source: There are several known problems with the current version of Dimensions:
ht: Gen plizyè pwoblèm li te ye ak vèsyon aktyèl la nan Dimansyon:

source: Restore from Journal does not work on pre-0.82 versions of Sugar.
ht: Renmèt soti nan Journal pa travay sou pre-0. 82 vèsyon nan Sugar.

source: Chinese Cards don't display properly on some systems due to a missing font.
ht: Kat Chinwa pa montre byen sou kèk sistèm akòz yon font manke.

source: There is no indication of whom found the match in group play.
ht: Pa gen okenn endikasyon de ki moun yo te jwenn matche ak nan nan jwe gwoup.

source: If you discover a bug in the program or have a suggestion for an enhancement, please `file a ticket <https://bugs.sugarlabs.org/newticket?component=Visual+Match>`_ in our bug-tracking system.
ht: Si ou dekouvri yon ensèk nan pwogram nan oswa ki gen yon sijesyon pou yon amelyorasyon, tanpri `depoze yon tikè <https: // pinèz. sugarlabs. eleman vizyèl = + Koresponn ak> `_ nan sistèm ensèk-Suivi nou an org / newticket?.

source: You can `view the open tickets here. <https://bugs.sugarlabs.org/query?status=accepted&status=assigned&status=new&status=reopened&component=Visual+Match>`_
ht: Ou ka wè `tikè yo louvri isit la. <Https: // pinèz. sugarlabs. org / sitiyasyon = aksepte & kondisyon = asiyen & kondisyon = nouvo & kondisyon = reouvri & eleman vizyèl = + Koresponn ak> `_ query?

source: Credits
ht: Kredi

source: Dimensions was written by `Walter Bender <http://wiki.sugarlabs.org/go/User:Walter>`_ and the students from his 2009-2010 freshman seminar at MIT: Games, Puzzles, and Other Things to Think With. Special thanks to Michele Pratusevich and Vincent Le, as well as Mark Battley.
ht: Dimansyon te ekri pa `Walter Bender <http: // wiki. sugarlabs. org / ale / Itilizatè: Walter> `_ ak elèv yo soti nan nevyèm ane seminè 2009-2010 l 'nan MIT: Jwèt, Jwèt kastèt, ak lòt bagay panse ak. Mèsi espesyal Michele Pratusevich ak Vincent Le, osi byen ke Mark Battley.

source: References
ht: Referans

source: `Wiki page <http://wiki.sugarlabs.org/go/Activities/Dimensions>`_
ht: `Paj Wiki <http: // wiki. sugarlabs. org / ale / Aktivite / Dimansyon> `_
