Repository: tony37/sledhelp
Catalog: translated_po/ht/finance.po
Languages: ht

source: Finance
ht: Finans

source: About
ht: Sou

source: Finance is a simple financial planning activity. It can be integrated into classroom assignments, or else used to track finances for a school club. It might also be useful for students who wish to help their parents with home finances.
ht: Finans se yon senp aktivite planifikasyon finansye. Li kapab entegre nan devwa yo, oswa lòt moun itilize yo swiv finans pou yon klib lekòl. Li ta ka tou gen pou itil pou elèv ki vle ede paran yo ak finans kay.

source: The register view allows students to enter income and expenses, assign categories, and review past transactions. The chart view shows students a visual breakdown of their expenses by category. The budget view allows users to assign a monthly budget to each category, and to see how each month's expenses compare to the budget.
ht: View nan enskri pèmèt elèv yo antre nan revni ak depans, bay kategori, ak revize tranzaksyon sot pase. View nan tablo a montre elèv yon pann vizyèl nan depans yo pa kategori. View nan bidjè pèmèt itilizatè yo asiyen yon bidjè chak mwa a chak kategori, ak yo wè ki jan depans chak mwa nan konpare ak bidjè a.

source: Finance is designed to be extensively localized. The user interface is translatable, and local conventions are used to display monetary values.
ht: Finans fèt yo dwe anpil lokalize. Koòdone nan itilizatè se tradwir, ak konvansyon lokal yo yo te itilize yo montre valè monetè.

source: Git It!
ht: GIT Li!

source: `Git Link <https://github.com/godiard/finance-activity>`_
ht: `GIT Link <https: // GitHub. com / godiard / Finans-aktivite> `_

source: Gallery
ht: Galeri

source: References
ht: Referans

source: `Sugar Wiki Activity Page <http://activities.sugarlabs.org/sugar/addon/4040>`_
ht: `Sugar Wiki aktivite Page <http: // aktivite. sugarlabs. org / sik / addon / 4040> `_

source: `Source <https://github.com/godiard/finance-activity>`_
ht: `Sous <https: // GitHub. com / godiard / Finans-aktivite> `_
