Repository: tony37/sledhelp
Catalog: translated_po/ht/fototoon.po
Languages: ht

source: Making and placing your Title: If you know what you would like your title to be, you can start with that. It can always be changed later. When you start a project in FotoToon there will already be a tiny box for the title in a narrow band across the top of the project window. You can drag the upper left corner of the box to enlarge it (look for the cursor arrow to change to a thinner double headed arrow). You can also move it around in the band across the top. Click on the box and type all or part of your title. Then you can change the type style and size using the pull downs in the Text Pulldown menu (see 8d and 8e) in the picture above). Experiment until you find a style and size you like. You can also change the color of the type. Don't worry if it isn't perfect, you can always come back later and change it. Notice that you can erase part of the text by backspacing over it.
ht: Fè epi mete Tit ou: Si ou konnen ki sa ou ta renmen tit ou yo dwe, ou ka kòmanse avèk ki. Li ka toujou ap chanje pita. Lè w kòmanse yon pwojè nan FotoToon gen pral deja gen yon ti bwat ti pou tit la nan yon bann etwat atravè tèt la nan fenèt la pwojè. Ou ka trennen kwen siperyè agòch nan bwat la yo elaji li (gade pou flèch la kurseur chanje nan yon mens doub flèch te dirije). Ou kapab tou deplase li alantou nan gwoup la atravè tèt la. Klike sou ti bwat la ak kalite tout oswa yon pati nan tit ou. Lè sa a, ou kapab chanje style la ak gwosè lè l sèvi avèk kalite Downs yo rale nan deroulan meni an Tèks (gade 8D ak 8E) nan foto a pi wo a). Eksperyans jiskaske ou jwenn yon style ak gwosè ou renmen. Ou kapab tou chanje koulè a ​​nan kalite la. Pa enkyete w si li se pa pafè, ou ka toujou tounen vin pita epi chanje li. Remake ou ka efase yon pati nan tèks la pa Backspacing sou li.

source: In this image you can see that we selected bold, a red color from the color palette, a type size of 26, and the Font "Monospace".
ht: Nan imaj sa a ou ka wè ke nou chwazi fonse, yon koulè wouj soti nan palèt an koulè, yon gwosè di ki kalite 26, ak Font "fixe a".

source: Adding Text Balloons: You can place the text balloons wherever you like within a pane. Click on the pane, then on the balloon you want to use (see "Add a global menu" and "Choose a movement line menu" above for explanations). The balloon will appear in the pane. You can drag it to the position where you want it, and also can drag the little tail to point to the source of the dialog. Add the words to the balloon in the same way you added them to the Title box.
ht: Ajoute Balon Tèks: Ou ka mete balon yo tèks tout kote ou renmen ki nan yon fenèt. Klike sou fenèt la, lè sa a sou balon an ou vle itilize (al gade "Add yon meni mondyal" ak "Chwazi yon liy meni mouvman" anwo a pou eksplikasyon). Balon an ap parèt nan fenèt la. Ou ka trennen l 'nan pozisyon an kote ou vle li, epi tou li ka trennen ti kras ke a nan pwen nan sous la nan dyalòg la. Ajoute mo yo nan balon an nan menm fason an ou te ajoute yo nan bwat la Tit.

source: In this image you can see that we have added 4 dialog balloons (#4 in the main toolbar). We could also have used the "think" balloon, or the "whisper" balloon. The first pane is OK, but the first balloon in the second pane needs to be dragged to a better shape and size. The second balloon in the second pane appears just as it does when it is first added. It still needs to have text added and to be resized (by dragging a corner). You can see that our type size is 10, text color is black, and we are still using the "Monospace" font.
ht: Nan imaj sa a ou ka wè ke nou gen te ajoute 4 balon dyalòg (# 4 nan ba ikòn prensipal la). Nou ta ka tou te itilize "panse nan" balon, oswa "chuichui" balon an. Fenèt an premye se OK, men balon an premye nan dezyèm fenèt la bezwen yo dwe trennen nan yon pi bon fòm yo ak gwosè. Balon an dezyèm nan dezyèm fenèt la parèt menm jan li fè sa lè li se premye te ajoute. Li toujou bezwen gen tèks te ajoute ak yo dwe rdimansyone (pa trenen yon kwen). Ou ka wè ki gwosè kalite nou an, se 10, koulè tèks se nwa, epi nou yo ap toujou lè l sèvi avèk "fixe" font la.

source: As you work with the various text items, you may wish to eliminate one entirely. Just click on it, then on the icon with the minus (-) sign (#7 in the main toolbar), and it will disappear.
ht: Kòm ou travay avèk divès kalite atik yo tèks, ou ka vle elimine youn antyèman. Jis klike sou li, Lè sa a, sou ikòn la ak mwens (-) siy nan (# 7 ki nan ba ikòn prensipal la), epi li pral disparèt.

source: Adding Exclamation Balloons: You may wish to include special exclamations to your project. Choose the exclamation balloon (choose from # 4 in the main toolbar). It is possible to eliminate the one longer point on the balloon by dragging it so that it matched the others. Again, type into the balloon just as you did in the title box and dialog balloons.
ht: Ajoute esklamasyon Balon: Ou ka vle gen ladan èksklamasyon espesyal nan pwojè ou. Chwazi balon an esklamasyon (chwazi nan # 4 nan ba ikòn prensipal la). Li posib yo elimine yon pwen nan pi long sou balon an pa trenen li pou ke li matche lòt moun yo. Yon fwa ankò, tape nan balon an menm jan ou te fè nan ti bwat la tit ak balon dyalòg.

source: Adding extra Text Boxes: You can add a text box anywhere in any pane by clicking on the pane and then on the box icon in the diagram (choose from #4 in the main toolbar).
ht: Ajoute bwat tèks siplemantè: Ou kapab ajoute yon bwat tèks nenpòt kote nan nenpòt ki fenèt pa klike sou fenèt la ak Lè sa a sou icon nan bwat nan dyagram lan (chwazi nan # 4 nan ba ikòn prensipal la).

source: In this example you can see we have added 4 exclamation balloons and one extra text box. We used the same text size, font, and color as in the rest of the project. You could choose to use different ones in your project.
ht: Nan egzanp sa a ou ka wè nou te ajoute 4 balon esklamasyon ak yon bwat tèks siplemantè. Nou itilize gwosè nan menm tèks, font, ak koulè tankou nan rès la nan pwojè a. Ou te kapab chwazi yo sèvi ak moun diferan nan pwojè ou.

source: Exporting Your Project
ht: Ekspòtatè Pwojè ou

source: Now, if you have followed the instructions above, you should have a small, completed FotoToon Project. You may have decided to use the same photos that are in the sample, or you may have chosen to use images you have imported. These can be from your camera, your XO, downloads from the web, projects you have made in other Activities, drawings you made in Paint, or even photos you have modified in Paint (import, then add things and/or crop as you like). When finished, your project will look something like this:
ht: Koulye a, si ou te swiv enstriksyon ki anwo yo, ou ta dwe gen yon ti, Pwojè FotoToon ranpli. Ou ka gen deside sèvi ak foto yo menm ki nan echantiyon an, oswa ou kapab te chwazi yo sèvi ak imaj ou te enpòte. Sa yo ka soti nan kamera ou, XO ou, downloads soti nan entènèt la, pwojè ou te fè nan lòt aktivite, desen ou te fè nan penti, oswa menm foto ou te modifye nan Penti (enpòte, lè sa a ajoute bagay sa yo ak / oswa rekòt tankou ou renmen ). Lè fini, pwojè ou yo ap gade yon bagay tankou sa a:

source: Regardless of what you have made for your project, you will probably want to share it with others. You can do this as an email attachment or print it out as a paper copy. To do this, you need to export your project as an image stored in your Journal. The instructions for exporting your project are shown above. We will repeat them here as well.
ht: Kèlkeswa sa ki ou te fè pou pwojè ou, ou pral pwobableman vle pataje li avèk lòt moun. Ou ka fè sa kòm yon atachman imel oswa enprime li soti kòm yon kopi sou papye. Pou fè sa, ou bezwen ekspòtasyon pwojè ou kòm yon imaj ki estoke nan jounal ou. Yo montre enstriksyon yo pou ekspòte pwojè ou pi wo a. Nou pral repete yo isit la kòm byen.

source: 1b- This allows you to add a description to jounal entry.
ht: 1b- sa a pèmèt ou ajoute yon deskripsyon jounal antre.

source: Look in the Journal. Your project should appear there with the name you gave it before exporting. If you forgot to give it a name, it will just say "FotoToon." If this happened, rename it now, in the Journal before you forget to do it.
ht: Gade nan jounal la. Pwojè ou a ta dwe parèt la ak non an ou te ban l 'devan ekspòte. Si ou bliye bay li yon non, li pral jis di "FotoToon. "Si sa a te pase a, chanje non li kounye a, nan jounal la anvan ou bliye fè li.

source: Extending FotoToon
ht: Pwolonje FotoToon

source: FotoToon can be used for much more than the simple 4-pane example we built in the instructions. It can be adapted for use in many different subject areas where students and teachers can construct lessons on any topic. Here are some possible ideas for projects:
ht: FotoToon kapab itilize pou pi plis pase senp egzanp a 4-fenèt nou bati nan enstriksyon yo. Ou kapab adapte li pou itilize nan anpil zòn sijè diferan kote elèv yo ak pwofesè ka konstwi leson sou nenpòt ki sijè. Isit la yo se kèk ide posib pou pwojè:

source: Student written comic books for language arts practice. Students can write their own little "graphic novels" and even print them and take home to share with friends and family.
ht: Liv komik Elèv ekri pou pratik lang e literati. Elèv-yo kapab ekri pwòp ti kras "woman grafik" yo e menm enprime yo epi pran lakay yo nan pataje avèk zanmi ak fanmi.

source: Student produced magazine articles for any topic they and their teachers choose. A single page or two-page "spread" will make it like the ones you see in actual magazines. One or more panes on the page can be used just for text to extend the story. The text could be written in another program and imported as an image or put in a large text box that fills the pane. The advantage of doing it all in FotoToon is that it would be easier to edit and/or change the text there than if it is imported as an image. Some possible ideas for these articles could be:
ht: Elèv pwodwi atik nan magazin pou nenpòt ki sijè yo ak pwofesè yo chwazi. Yon paj yon sèl oswa de-paj "gaye" pral fè li tankou sa yo ou wè nan magazin aktyèl. Youn oswa plis vitraj sou paj la ka itilize sèlman pou tèks pou yon ekstansyon pou istwa a. Te kapab tèks la dwe ekri nan yon lòt pwogram ak enpòte kòm yon imaj oubyen yo mete li nan yon bwat tèks gwo ki plen fenèt la. Avantaj nan fè li tout nan FotoToon se ke li ta pi fasil edite ak / oswa chanje tèks la gen pase si li se enpòte kòm yon imaj. Kèk ide posib pou atik sa yo ta ka:

source: Cooking favorite foods (with recipes)
ht: Kwit manje manje pi renmen (ak resèt)

source: Family pets (pictures and stories)
ht: Bèt kay Fanmi (foto ak istwa)

source: Our neighborhood (pictures and stories of places to see or problems that need to be solved)
ht: Nou katye (foto ak istwa nan kote yo wè oswa pwoblèm ki bezwen yo dwe rezoud)

source: Science articles with photos of plants, animals, rocks, etc. including descriptions and information
ht: Atik Syans ak foto nan plant yo, bèt yo, wòch, elatriye. ki gen ladan deskripsyon ak enfòmasyon

source: Historical articles with photos of people or places imported from the web
ht: Atik Istorik ak foto moun nan pèp oswa kote enpòte soti nan entènèt la

source: "How To" articles on any topic the students or teacher choose
ht: "Kijan Pou" atik sou nenpòt ki sijè elèv yo oswa pwofesè chwazi

source: Modifying FotoToon
ht: Modifye FotoToon

source: FotoToon is free open source software and, as such is available to be modified by the user as they wish as long as they give the original source proper credit. So, if you are a programmer and want to change something to suit your needs, you may do so. Just don't forget to give credit where credit is due.
ht: FotoToon se gratis lojisyèl sous louvri, epi, jan sa yo se disponib nan kapab modifye pa itilizatè a jan yo vle osi lontan ke yo bay orijinal sous apwopriye kredi a. Se konsa, si ou se yon pwogramè epi ou vle chanje yon bagay kostim bezwen ou, ou ka fè sa. Jis pa bliye bay kredi kote kredi se akòz.

source: If you are not a programmer, you can suggest changes or modifications to the Activity to the original programmer at the same place where you would report problems. If it is something that will improve the Activity and not interfere with other parts of it, the programmers will be happy to consider including it in a future update.
ht: Si ou pa yon pwogramè, ou ka sijere chanjman oswa modifikasyon nan aktivite nan pwogramè orijinal la nan plas la menm kote ou ta repòte pwoblèm. Si li se yon bagay ki pral amelyore aktivite a epi yo pa entèfere ak lòt pati nan li, pwogramasyon yo pral gen kè kontan yo konsidere ki gen ladan l 'nan yon aktyalizasyon lavni.

source: Because there are always updates and improvements happening with this program, be sure to always check to be sure you have the latest version.
ht: Paske gen toujou dènye ak amelyorasyon k ap pase ak pwogram sa a, asire w ke ou toujou tcheke asire w ke ou gen vèsyon an dènye.
