Repository: tony37/sledhelp
Catalog: translated_po/ht/fototoon.po
Languages: ht

source: FotoToon
ht: Photo Toon

source: About
ht: Sou

source: The FotoToon Activity will allow you to create everything from a simple "comic" strip to a long elaborate illustrated document. You will be able to import many kinds of images into the panes of your project and add text bubbles to help tell the story. You can use photo images taken with the XO or imported from a camera, drawings made with Activities such as Paint, and images of all kinds downloaded from the web. This could include photos, charts and graphs, maps, and the like.
ht: FotoToon aktivite a pral pèmèt ou yo kreye tout bagay soti nan yon senp "komik" teren nan yon dokiman long elabore ilistre. Ou pral kapab yo enpòte plizyè kalite imaj nan vitraj yo nan pwojè ou epi ajoute bul tèks ede rakonte istwa a. Ou kapab sèvi ak imaj foto pran ak XO a oswa enpòte soti nan yon kamera, desen ki fèt ak Aktivite tankou penti, ak imaj nan tout kalite telechaje soti nan entènèt la. Sa kapab genyen foto, tablo ak graf, kat, ak renmen an.

source: This introduction to FotoToon will show you how to get started with a simple 4 panel project.
ht: Entwodiksyon sa a FotoToon pral montre w kouman jwenn te kòmanse avèk yon senp pwojè 4 panèl.

source: FotoToon, like many other Sugar Activities, is often updated to fix "bugs" that users report. There was one update, from version 15 to version 16 during the time this instruction chapter was written. By the time you use it, there may be others. The changes are usually minor and should not interfere with the usefulness of this information. Always try to be sure you are using the latest version.
ht: FotoToon, tankou anpil lòt Aktivite Sugar, se souvan mete ajou ranje "pinèz" ki itilizatè rapòte. Te gen yon aktyalizasyon, soti nan vèsyon 15 nan vèsyon 16 pandan tan an sa a chapit enstriksyon te ekri. Depi lè a ou sèvi ak li, gen pouvwa pou lòt moun. Chanjman yo yo anjeneral minè epi yo pa ta dwe entèfere ak itilite a nan enfòmasyon sa a. Toujou eseye asire w ke w ap itilize vèsyon an dènye.

source: Using FotoToon
ht: Lè l sèvi avèk FotoToon

source: The Main FotoToon Toolbar
ht: Main FotoToon Toolbar la

source: The FotoToon Toolbar has 9 icons including 3 with pulldown menus. The main FotoToon toolbar allows you to access many features of the Activity. Here is a description of what each of the icons will allow you to do:
ht: FotoToon Toolbar la gen 9 ikon ki gen ladan 3 ak meni deroulan. Prensipal FotoToon toolbar a pèmèt ou jwenn aksè nan karakteristik anpil nan aktivite a. Isit la se yon deskripsyon nan sa ki chak nan ikon yo pral pèmèt ou fè:

source: The FotoToon icon. When you hover your cursor over this icon you will open a small pulldown that allows you to export your work as an image or a book (pdf file). See below for more details.
ht: Icon la FotoToon. Lè ou hover kurseur ou sou icon sa a ou pral louvri yon ti deroulan ki pèmèt ou ekspòtasyon travay ou kòm yon imaj oswa yon liv (pdf dosye). Gade pi ba a pou plis detay.

source: This icon allows you to view the content in full screen or presentation mode.
ht: Icon sa a pèmèt ou wè kontni an nan plen ekran oswa mòd prezantasyon.

source: The **Add Photo** icon. This icon allows you to add an image to your project. It can be a photo you take with the XO or digital camera, or import from the web. It can also be a picture, page, or project you create in another Sugar Activity.
ht: ** Ajoute Photo ** nan icon. Icon sa a pèmèt ou ajoute yon imaj nan pwojè ou. Li kapab yon foto ou pran avèk XO a oswa kamera dijital, oswa enpòte soti nan entènèt la. Li kapab tou yon foto, paj, oswa pwojè ou kreye nan yon lòt aktivite Sugar.

source: The **Add a globe** icon. This allows you to add a globe. It is used to tell what the characters of your image is speaking. This also include some other icons such as whispher and think.
ht: ** Ajoute yon glòb ** nan icon. Sa a pèmèt ou ajoute yon glòb. Li se itilize yo di ki sa karaktè yo nan imaj ou ap pale. Sa a gen ladan l tou kèk lòt ikon tankou whispher ak panse.

source: The **Choose a movement line** icon. This can be used to insert some other icons such as highlight and idea to the image.
ht: ** Chwazi yon liy mouvman ** nan icon. Sa a kapab itilize insert kèk lòt ikon tankou rekò ak lide nan imaj la.

source: The **Rotate** icon. This allows you to rotate the selected object in the clockwise direction in 90 degrees for each click.
ht: ** Wotasyon ** nan icon. Sa a pèmèt ou Thorne objè a chwazi nan yon direksyon ki goch nan 90 degre pou chak klike sou.

source: The **Delete** icon. This allows you to delete the selected object.
ht: ** Efase ** nan icon. Sa a pèmèt ou efase objè a chwazi.

source: This icon allows you to change the text properties of what you have typed. See below for more details.
ht: Icon sa a pèmèt ou chanje pwopriyete yo tèks nan sa ou te tape. Gade pi ba a pou plis detay.

source: The familiar stop-sign icon is one way to stop the FotoToon Activity. You can also use the keyboard shortcut: ctrl-Q.
ht: Icon la abitye sispann-siy se yon fason yo sispann aktivite a FotoToon. Ou kapab tou itilize rakoursi nan klavye: ctrl-Q.

source: **Title:** box allows you to give a name to your project. Click on it and replace the content with the name you wish for your work.
ht: ** Tit: ** bwat pèmèt ou bay yon non pwojè ou. Klike sou li epi ranplase kontni an ak non an ou vle pou travay ou.

source: The Export Pulldown
ht: Export deroulan nan

source: 1a- This little panel allows you to name your project before you export it as an image. If you do nothing, it will appear in the Journal as, "FotoToon as image." If you give it a name, such as "My Project-1" before exporting it will appear in the Journal as "My Project-1 as image". This will make it easier to find later in the Journal. Just erase the FotoToon label and replace it with the title you want to use. If you forget to name it when saving, you can always go to the Journal and select and rename it.
ht: 1a- Sa a panèl ti kras pèmèt ou nan non pwojè ou anvan ou ekspòtasyon li kòm yon imaj. Si ou fè sa pa gen anyen, li pral parèt nan jounal la kòm, "FotoToon kòm imaj. "Si ou ba li yon non, tankou" Pwojè-1 mwen "a anvan yo ekspòte l ap parèt nan jounal la kòm" Pwojè-1 mwen kòm imaj ". Sa a pral fè li pi fasil jwenn apre nan jounal la. Jis efase etikèt la FotoToon ak ranplase li ak tit la ou vle itilize. Si ou bliye non li lè ekonomize, ou ka toujou ale nan Journal a epi chwazi ak chanje non li.

source: 1b- This allows you to add a description to the journal entry.
ht: 1b- sa a pèmèt ou ajoute yon deskripsyon yo antre nan jounal.

source: 1c- This greyed out icon for home view is currently inactive.
ht: 1c- Sa a grize soti icon pou wè kay se kounye a ki inaktif.

source: 1d- Click on this icon to export your project as an image. The export will just show your project. The tool bars and other things on the screen will not be included. If you wish a screen shot of the entire screen, you can make one by using the usual alt-1 (press the alt key and the 1 key at the same time).
ht: 1d- Klike sou icon sa a nan ekspòtasyon pwojè ou kòm yon imaj. Ekspòtasyon an ap jis montre pwojè ou. Ba yo zouti ak lòt bagay sou ekran an pa pral enkli. Si ou ta yon piki ekran nan ekran an tout antye, ou ka fè yon sèl lè l sèvi avèk abityèl alt-1 (laprès la kle a ALT ak kle nan 1 nan menm tan an).

source: 1e- Click this icon to export your project as an book. The export will just show your project. The tool bars and other things on the screen will not be included. The book will be saved in PDF format. It can be viewed from Read Activity.
ht: 1e- Klike sou ikòn sa a nan ekspòtasyon pwojè ou kòm yon liv. Ekspòtasyon an ap jis montre pwojè ou. Ba yo zouti ak lòt bagay sou ekran an pa pral enkli. Pral Liv la ap sove nan fòma PDF. Li kapab wè li nan Li aktivite.

source: The View Pulldown
ht: View deroulan nan

source: 2a- Click this to view your project in slideshow mode. It will allow you to view your project slide by slide. In the slideshow, click on the arrows by the sides to navigate forward and backword in your slides. Click on the **slidshow** icon again to return to edit mode.
ht: 2a- Klike sou sa a sou yo wè pwojè ou nan mòd Slideshow. Li pral pèmèt ou wè glise pwojè ou pa glise. Nan Slideshow a, klike sou flèch yo pa kote sa yo nan navige pou pi devan ak backword nan glisad ou. Klike sou ** slidshow ** icon la ankò pou li retounen nan modifye mòd.

source: 2b - Click this to work in full screen. This will hide the toolbar and thus you will have more space for your design. Once you are in the full screen mode, the same icon will appear on the top right corner of the window. Click that icon to return to the normal edit mode.
ht: 2b - Klike sa a nan travay nan ekran plen. Sa a pral kache ba ikòn nan epi konsa ou pral gen plis espas pou konsepsyon ou. Yon fwa ou yo nan mòd nan ekran plen, icon a menm ap parèt sou kwen an tèt dwat nan fenèt la. Klike sou ki icon pou li retounen nan edit mòd nan nòmal.

source: Add a globe menu
ht: Ajoute yon meni glòb

source: 3a- You can use this to present an expression of exclamation.
ht: 3a- Ou kapab sèvi ak sa a prezante yon ekspresyon de esklamasyon.

source: 3b- You can use this when some one (a character) in your projects whispers someting to another.
ht: 3b- Ou kapab sèvi ak sa a lè yon moun (yon karaktè) nan pwojè ou a whispers someting nan yon lòt.

source: 3c- You can use this to express what the characters of your projects are speaking.
ht: 3c- Ou kapab sèvi ak sa a eksprime sa karaktè yo nan pwojè ou a ap pale.

source: 3d- You can use this to add a box to your project.
ht: 3D- Ou kapab sèvi ak sa a yo ajoute yon bwat nan pwojè ou.

source: 3e- You can use this to express that some character in your project are thinking.
ht: 3e- Ou kapab sèvi ak sa a eksprime ke kèk karaktè nan pwojè ou ap panse.

source: Choose a movement line menu
ht: Chwazi yon meni liy mouvman

source: 4a- You can use this to add a highlight to your project.
ht: 4a- Ou kapab sèvi ak sa a yo ajoute yon rekò nan pwojè ou.

source: 4b- You can use this to add straight lines to your project.
ht: 4b- Ou kapab sèvi ak sa a yo ajoute liy dwat nan pwojè ou.

source: 4c- You can use this to add an idea to your project.
ht: 4c- Ou kapab sèvi ak sa a yo ajoute yon lide nan pwojè ou.

source: 4d- You can use this to add curves to your project.
ht: 4d- Ou kapab sèvi ak sa a yo ajoute koub nan pwojè ou.

source: The Text Pulldown
ht: Deroulan nan Tèks

source: The Text Pulldown menu allows you to control the appearance of the text you add to your project. Generally, they apply to everything in the box or bubble you are currently working on. You do not have to highlight the text to change it.
ht: Deroulan meni an Tèks pèmèt ou kontwole aparans nan tèks la ou ajoute nan pwojè ou. Anjeneral, yo aplike nan tout bagay nan ti bwat la oswa jarèt w ap aktyèlman ap travay sou. Ou pa bezwen mete aksan sou tèks la mande chanje li.

source: 8a- Selecting this icon will change the text you are working on to Bold. Clicking it again reverts back to regular text,
ht: 8a-Chwazi icon sa a pral chanje tèks la ou ap travay sou Bold. Klike l 'ankò Liberasyo ​​tounen nan tèks regilye,

source: 8b- Selecting this icon will change the text your are working on to Italics.
ht: 8b- Chwazi icon sa a pral chanje tèks la ou ap travay sou italik.

source: Note: clicking on both of these icons, in any order, will give you Bold Italic text. Clicking both again, in any order, will get you back to regular text.
ht: Remak: klike sou tou de nan ikon sa yo, nan nenpòt lòd, pral ba ou Bold tèks italik. Klike tou de ankò, nan nenpòt lòd, pral fè ou jwenn tounen nan tèks regilye.

source: 8c- Clicking on this icon will open the Text Color Palette. See below for information on how to use it.
ht: 8c- Klike sou icon sa a pral louvri Tèks la Koulè palèt. Gade pi ba a pou enfòmasyon sou kouman yo sèvi ak li.

source: 8d- Clicking this will reduce the size of the text. The current size will be displayed just next to this icon.
ht: 8d- Klike sa a ap diminye gwosè a nan tèks la. Pral gwosè ki la kounye a ap parèt jis akote icon sa a.

source: 8e - Clicking this will increase the size of the text. The current size will be displayed just before the icon.
ht: 8E - Klike sa a ap ogmante gwosè a nan tèks la. Pral gwosè ki la kounye a ap parèt jis anvan icon nan.

source: 8f- This pull down offers a choice of different fonts, listed in alphabetical order. Some, such as "Ding Bats" don't actually produce anything. Be sure to test the font on your text to see if it looks the way you would like it to.
ht: 8f- Sa a rale desann ofri yon chwa nan polis diferan, ki nan lis nan lòd alfabetik. Gen kèk, tankou "Ding Bats" pa aktyèlman pwodwi anyen. Asire ou ke ou teste font la sou tèks ou a wè si li sanble nan fason ou ta renmen li nan.

source: The Color Palette Pulldown
ht: Koulè palèt deroulan nan

source: The Color Palette Pulldown allows you to choose the color of your font. It will apply to everything in the box or bubble but can vary from one box or bubble to the next as you choose. There are 12 preset colors you can use, or you can create a custom color by selecting one of the preset colors and dragging the sliders to give more or less Red, Green, or Blue in the selected color. The little circle at the top of the Color Palette shows the current color. When you are satisfied with the color you have selected/modified, click on the little circle to accept the chosen color and close the Color Palette. It may take a few seconds for the new color to appear in the text box. But, don't worry, it will!
ht: Koulè palèt deroulan nan pèmèt ou chwazi koulè a ​​nan font ou. Li pral aplike nan tout bagay nan ti bwat la oswa jarèt men yo ka varye soti nan yon bwat oswa ti wonn nan pwochen an kòm ou chwazi pou ou. Genyen 12 koulè prereglaj ou ka itilize, oswa ou kapab kreye yon koulè koutim pa chwazi youn nan koulè yo prereglaj ak trenen koulis yo bay plis oswa mwens wouj, vèt, oswa Blue nan koulè a ​​chwazi. Sèk an ti kras nan tèt la nan palèt an koulè montre koulè aktyèl la. Lè w ap satisfè ak koulè a ​​ou te chwazi / modifye, klike sou ti sèk nan aksepte koulè a ​​chwazi epi fèmen palèt an koulè. Li ka pran yon kèk segond pou koulè a ​​nouvo a parèt nan ti bwat la tèks. Men, pa enkyete, li pral!

source: Learning with FotoToon
ht: Aprann ak FotoToon

source: Plan Ahead
ht: Planifye Anvan

source: FotoToon can be used for a wide variety of learning activities, but the general process is always similar. For the sample project in this section, we will make a 4 panel page using 4 photos. This is a good way to get started since the page can be printed on a single page.
ht: FotoToon kapab itilize pou yon gran varyete aktivite aprantisaj, men pwosesis la an jeneral se toujou menm jan an. Pou pwojè a echantiyon nan seksyon sa a, nou pral fè yon paj 4 panèl lè l sèvi avèk 4 foto. Sa a se yon bon fason jwenn te kòmanse depi ka paj la ap enprime yo sou yon paj yon sèl.

source: Here are the general steps you need to complete before you build your first FotoToon project:
ht: Isit la yo se etap sa yo jeneral ou bezwen ranpli anvan ou bati pwojè premye FotoToon ou:

source: **Step One: Decide what your project will be about.** You can tell a story about anything. For example, it could be about your pets, your home, your family, your town, or, even some photos you took at a party. Any topic is fine for our first project. The sample project will be about "Healthy Snacks" and the photos will be pictures of food.
ht: ** Premye etap: Deside ki sa pwojè ou pral sou. ** Ou ka di yon istwa sou anyen. Pou egzanp, li te kapab fè sou bèt kay ou, lakay ou, fanmi ou, vil ou a, oswa, menm kèk foto ou te pran nan yon pati. Nenpòt sijè se amann pou premye pwojè nou an. Pwojè a echantiyon pral sou "Healthy Ti goute" ak foto yo pral foto nan manje.

source: **Step Two: Make a plan.** Before you begin you should make a plan that will guide you through the construction of your project. Some people like to draw a little sketch of each pane showing what will be in the picture and a suggestion for what words will be added. If you like the panes can each be on a separate small piece of paper so you can re-arrange them easily This is called a **Story Board**. You may have another way you would like to make your plan, just be sure to include information about what pictures you will use, where you will get them, and what text you plan to add.
ht: ** Dezyèm etap: Fè yon plan. ** Anvan ou kòmanse ou ta dwe fè yon plan ki pral gide w nan konstriksyon an nan pwojè ou. Gen kèk moun ki renmen trase yon ti kras trase nan chak fenèt ki montre ki sa yo pral nan foto a ak yon sijesyon pou sa pawòl pral ajoute. Si ou renmen vitraj yo chak ka sou yon ti moso papye apa pou ou kapab re-fè aranjman pou yo byen fasil Se sa yo rele yon ** Istwa Konsèy **. Ou ka gen yon lòt fason ou ta renmen fè plan ou, jis asire w ke ou gen ladan yo enfòmasyon sou sa foto ou pral sèvi, kote ou pral jwenn yo, e ki sa tèks ou fè plan yo ajoute.

source: **Step Three: Gather your images.** For starters, we will use images that were taken either with a camera, or using the **Record Activity** on the XO. Any image that can be imported to the Journal on your XO and viewed in **Image Viewer** can be used. It is a good idea to rename each of the photos you will be using in the Journal. The name can include the number of the pane you plan to use it in so it is easy to find when you begin putting things together.
ht: ** Twazyèm etap: Rasanble imaj ou. ** Pou kòmansè, nou pral sèvi ak imaj ki yo te pran swa ak yon kamera, oswa lè l sèvi avèk ** aktivite nan Dosye ** sou XO a. Nenpòt imaj ki ka enpòte nan Journal la sou XO ou ak wè nan ** Viewer Imaj ** ka itilize. Li se yon bon lide yo chanje non chak nan foto yo ou pral sèvi ak nan jounal la. Non a ka gen ladan yo ki kantite fenèt la ou fè plan yo sèvi ak li nan se konsa li se fasil jwenn lè ou kòmanse mete bagay sa yo ansanm.

source: Place Your Images
ht: Mete Imaj ou

source: Open the Journal and check to be sure your images are there and can be viewed in the Image Viewer (click on the file to open it and check). Be sure the images have names that include the number of the pane you plan to place them (1,2,3, or 4).
ht: Louvri Journal la epi tcheke yo dwe asire imaj ou ki genyen epi yo ka wè nan imaj la Viewer (klike sou dosye a yo louvri li epi tcheke). Asire w ke imaj yo gen non ki gen ladan nimewo a nan fenèt la ou fè plan yo mete yo (1,2,3, oswa 4).

source: Open FotoToon and find the "Add Photo" icon (number 3 in the FotoToon main toolbar shown above). A list of available images will appear. Click on the one you want to put in the first pane. When it has loaded, you can either leave it or remove it with the minus sign icon (number 7 in the main toolbar shown above). Warning: You can only remove the last image entered. That is why it is important to number the images according to the panes you wish to place them in. After the first image has been placed, continue adding images until all four for your first project have been placed. If you decide later that you want to change their order after they have been placed, you will need to delete them and replace them in the new order. It is best to get your final placement before adding any text.
ht: Open FotoToon epi jwenn "Add Photo" icon an (nimewo 3 nan prensipal ba ikòn nan FotoToon montre pi wo a). Yon lis nan imaj ki disponib ap parèt. Klike sou youn nan ou vle mete nan fenèt la premye. Lè li te chaje, ou ka swa kite li oswa retire li ak icon a siy mwens (nimewo 7 nan ba ikòn nan prensipal montre pi wo a). Avètisman: Ou kapab sèlman retire imaj ki sot pase a te antre nan. Se pou rezon sa li enpòtan nan nimewo imaj yo dapre vitraj yo ou ta vle mete yo nan. Apre yo fin imaj la premye te mete, kontinye ajoute imaj jouk tout kat la pou premye pwojè ou yo te mete. Si ou deside pi ta ke ou vle chanje lòd yo, yo apre yo te mete, ou pral bezwen efase yo epi ranplase yo nan lòd nan nouvo. Li pi bon yo ka resevwa plasman final ou a avan ou ajoute nenpòt tèks.

source: If you would like to use the same images that will be used in this sample project, you will find them at these links. Go to each link, upload the photo to a usb drive, plug it into your XO, and open by clicking on the image names. They will open in the Image Viewer and be automatically saved so you can access them for your project.
ht: Si ou ta renmen yo sèvi ak menm imaj yo ke yo pral itilize nan echantiyon pwojè sa a, ou pral jwenn yo nan lyen sa yo. Ale nan chak lyen, Upload foto a nan yon kondwi USB, ploge li nan XO ou, epi yo louvri pa klike sou non yo imaj. Yo pral louvri nan Viewer la Imaj ak ap otomatikman sove pou ou kapab jwenn aksè nan yo pou pwojè ou.

source: Pane-1 http://wiki.laptop.org/go/File:1-Apple-Fries.png
ht: Fenèt-1 http: // wiki. laptop. org / ale / name: 1-Apple-Fries. png

source: Pane-2 http://wiki.laptop.org/go/File:2-Soda-Milk.png
ht: Fenèt-2 http: // wiki. laptop. org / ale / name: 2-Soda-Lèt. png

source: Pane-3 http://wiki.laptop.org/go/File:3-Cookies-Yogurt.png
ht: Fenèt-3 http: // wiki. laptop. org / ale / name: 3-Bonbon-Yogout. png

source: Pane-4 http://wiki.laptop.org/go/File:4-HealthySnacks.png
ht: Fenèt-4 http: // wiki. laptop. org / ale / name: 4-HealthySnacks. png

source: Add Dialog and Titles
ht: Ajoute dyalòg ak tit

source: If you have planned well with your storyboard, you will have a pretty good idea of what you want to put in your dialog balloons and text boxes. You may even have a title in mind for your project. You can actually start this process anywhere in your project. All of the balloons and boxes you will be using to do this will be identified in the first image above, the The Main PhotoToonToolbar.
ht: Si ou te planifye byen ak scénario ou, ou pral gen yon trè bon lide de sa ou vle mete nan balon dyalòg ou ak bwat tèks. Ou ka menm gen yon tit nan tèt ou pou pwojè ou. Ou ka aktyèlman kòmanse pwosesis sa a nan nenpòt kote nan pwojè ou. Tout moun nan balon yo ak bwat ou pral sèvi ak yo fè sa yo pral idantifye nan imaj la premye pi wo a, PhotoToonToolbar nan la Main.
