Repository: tony37/sledhelp
Catalog: translated_po/ht/frame.po
Languages: ht

source: The Frame
ht: Frame nan

source: The Frame is the black border around the screen that holds the View icons, Activity taskbar, clipboard, wireless connections, battery level, incoming invitations and notifications, buddies, and global information that is used across all views.
ht: Frame a se fwontyè a nwa alantou ekran an ki kenbe ikon yo View, ekstrè Aktivite, clipboard, koneksyon san fil, nivo batri, envitasyon fèk ap rantre ak notifikasyon, ami, ak enfòmasyon mondyal ki itilize atravè tout opinyon.

source: Accessing the Frame
ht: Antre nan ankadreman an

source: You can access the frame from any view in 2 ways:
ht: Ou ka jwenn aksè ankadreman an nan nenpòt View nan 2 fason:

source: By using the Frame Key on the keyboard. On XO laptops the Frame key is the square icon on the upper right hand corner of your keyboard, on other laptops you can use the F6 key.
ht: Lè l sèvi avèk kle a Frame sou klavye a. Sou XO laptops kle a Frame se icon a kare nan kwen an men dwat anwo nan klavye ou, sou lòt laptops ou ka itilize kle a F6.

source: By moving the cursor to the edges or corners of your screen. (There are several options you can configure in this area, please refer to the My Settings section for more details.)
ht: Pa deplase kurseur la nan bor yo oswa kwen nan ekran ou. (Gen plizyè opsyon ou ka configured nan zòn sa a, tanpri al gade seksyon nan Anviwònman mwen pou plis detay. )

source: In the XO-4, with touch screen, is possible show the frame sliding a finger, from the top of the screen, a few centimeters. The same gesture will hide the frame too.
ht: Nan XO a-4, ak manyen ekran, se posib montre ankadreman an glisman yon dwèt, ki soti nan tèt la nan ekran an, yon kèk santimèt. Jès la menm pral kache ankadreman an twò.

source: Frame Elements
ht: Eleman Frame

source: The Frame view:
ht: View nan Frame:

source: Zoom menu: The Zoom menu (icons matching the important keyboard shortcuts toward the keyboard top left) appears on the upper-left edge of the Frame. Use it to move between the four Sugar views: Neighborhood, Group, Home, and Activity.
ht: Zoom meni: Meni an Zoom (ikon matche rakoursi yo klavye enpòtan nan direksyon tèt la klavye agòch) parèt sou kwen anwo-kite nan ankadreman an. Sèvi ak li pou avanse pou pi ant kat opinyon yo Sugar: Katye, Gwoup, Kay, ak aktivite.

source: Running Activity list: The sequence of currently started Activities appears on the top edge of the Frame in the order that they were started. The active Activity is highlighted. (The Journal always appears here first.) Here you can see open Activities, save, close or switch between them, and view their source code. Sometimes an unlabeled circle appears here which represents an additional full-screen session started by an Activity whose icon already appears in the top edge of the Frame or an Activity that is having trouble completely starting. Invitations to collaborative Activity sessions also show up on this portion of the Frame. They appear as icons in the color of the person who sent them. Hover and you can see who it is and join in.
ht: Kouri lis aktivite: Sekans an nan Aktivite kounye a te kòmanse parèt sou kwen nan tèt nan ankadreman an nan lòd la yo ke yo te kòmanse. Se aktivite nan aktif make. (Journal la toujou parèt isit la premye. ) Isit la ou ka wè Aktivite louvri, sove, fèmen oswa chanje ant yo, epi wè kòd sous yo. Pafwa yon sèk unlabeled parèt isit la ki reprezante yon lòt sesyon plen ekran-te kòmanse pa yon aktivite ki gen icon deja parèt nan kwen an tèt nan ankadreman an oswa yon aktivite ki gen pwoblèm konplètman kòmanse. Envitasyon sesyon aktivite kolaboratif tou montre moute sou sa a pòsyon nan ankadreman an. Yo parèt kòm ikon nan koulè a ​​nan moun ki te voye yo. Hover epi ou ka wè ki moun li se ak rantre nan nan.

source: Active buddy list: People you are currently collaborating with appear on the right edge of the Frame.
ht: Lis zanmi aktif: Moun w ap kounye a kolabore avèk parèt sou bò dwat nan ankadreman an.

source: Clipboard: The left edge of the Frame serves as a clipboard. You can drag objects such as images and text to and from the clipboard, and from and to Activities. A hover menu also lets you remove them from the clipboard, open them in an Activity, or save (keep) them in your Journal.
ht: Clipboard: kwen an kite nan ankadreman an sèvi kòm yon papye. Ou ka trennen objè tankou imaj, ak tèks pou ale ak pou soti nan clipboard a, epi soti nan ak Aktivite. Yon meni hover tou pèmèt ou retire yo nan clipboard a, louvri yo nan yon aktivite, oswa sove (kenbe) yo nan jounal ou.

source: System status (from left to right): Switch for the two modes of the touchpad (XO-1 only), external storage devices (e.g. thumb and hard drives), network status, text-to-speech, speaker (volume), and battery appear on the lower edge of the Frame.
ht: Sitiyasyon System (de gòch a dwat): switch pou de mòd yo nan touchpad a (XO-1 sèlman), aparèy depo ekstèn (e. g. gwo pous ak kondui difisil), estati rezo a, tèks-a-lapawòl, oratè (volim), ak batri parèt sou kwen ki pi ba nan ankadreman an.
