Repository: tony37/sledhelp
Catalog: translated_po/ht/getbooks.po
Languages: ht

source: Get Books
ht: Jwenn Liv

source: About
ht: Sou

source: Get Books can be used to download your favorite books on Sugar. It helps you download from different places (Internet Archive, Feedbooks, etc) all from one place.
ht: Jwenn Liv ka itilize yo download liv pi renmen ou sou Sugar. Li ede ou download soti nan diferan kote (entènèt Archive, Feedbooks, elatriye) tout soti nan yon sèl kote.

source: Once you have found the book you want to read, you can select the format in which you would like to download it (PDF or EPUB). Click on "Get Book" to start the download. At the top of the screen, a progress bar will appear that shows you the download progress. Once your book is downloaded, you can open it in the Read activity.
ht: Yon fwa ou te jwenn liv la ou vle li, ou ka chwazi fòma a nan kote ou ta renmen download li (PDF oswa èpeub). Klike sou "Jwenn Liv" yo kòmanse download a. Nan tèt la nan ekran an, yon bar pwogrè ap parèt ki montre ou pwogrè nan download. Yon fwa yo liv ou a telechaje, ou ka louvri l nan aktivite a Li.

source: How to find books
ht: Ki jan yo jwenn liv

source: There are two ways in which you can find books:
ht: Gen de fason nan ki ou ka jwenn liv:

source: Using search
ht: Lè l sèvi avèk rechèch

source: Enter the book title in the search bar
ht: Antre nan tit la liv nan ba rechèch la

source: Select from where to search(Feedbooks or My books)
ht: Chwazi soti nan kote nan rechèch (Feedbooks oswa liv mwen)

source: Press Enter
ht: Press Mete

source: Using the catalogs
ht: Lè l sèvi avèk katalòg yo

source: Under the catalogs, you can see different genres of books
ht: Anba katalòg yo, ou ka wè diferan estil nan liv

source: Select the genre of your choice
ht: Chwazi genre nan nan chwa ou

source: You will get a list of books, with it's Title and Author
ht: Ou pral resevwa yon lis liv, ak li nan Tit ak Otè

source: Click on the book you want
ht: Klike sou liv la ou vle

source: Select the format and click "Get Book"
ht: Chwazi fòma a, epi klike "Jwenn Liv"

source: How to change language
ht: Kouman chanje lang

source: To change the language, click on the (settings) |set_ico| icon and from the list you can select:
ht: Pou chanje lang nan, klike sou (anviwònman) | set_ico | icon a ak nan lis la ou ka chwazi:

source: Any language
ht: Nenpòt lang

source: French
ht: Franse

source: English
ht: Angle

source: German
ht: Alman

source: Spanish; Castilian
ht: Panyòl; Castilian

source: How to show/hide catalogs
ht: Ki jan yo montre katalòg / kache

source: To show/hide the catalogs, all you need to do is just press the (catalogs) |cat_ico| button
ht: Pou montre / kache katalòg yo, tout sa ou bezwen fè se jis peze (katalòg yo) | cat_ico | bouton

source: Gallery
ht: Galeri

source: `Activites Download page <http://activities.sugarlabs.org/en-US/sugar/addon/4304>`_
ht: `Activités Download paj <http: // aktivite. sugarlabs. org / en-US / sik / addon / 4304> `_

source: More Info
ht: Plis Enfòmasyon

source: If you never developed a Sugar Activity, `must read <http://www.flossmanuals.net/make-your-own-sugar-activities/>`_.
ht: Si ou pa janm devlope yon sik pou Aktivite, `dwe li <http: // www. flossmanuals. net / fè-ou-pwòp-sik-aktivite /> `_.

source: If you want help us fixing some bugs on activities, and learn a little about how activities work, you can see at this `list of pending tickets <http://dev.laptop.org/~gonzalo/bugs_index.html>`_
ht: Si ou vle ede nou ranje kèk pinèz sou aktivite, epi yo aprann yon ti kras sou ki jan aktivite travay, ou ka wè nan sa a lis `nan annatant tikè <http: // dev. laptop. org / ~ Gonzalo / bugs_index. html> `_
