Repository: tony37/sledhelp
Catalog: translated_po/ht/getting_connected.po
Languages: ht

source: Getting Connected
ht: Pou Konekte

source: A primary goal of the Sugar learning platform is enabling students to learn and work together.
ht: Yon objektif prensipal nan platfòm aprantisaj la Sugar se pèmèt elèv yo aprann ak travay ansanm.

source: In a wireless environment, an access point (AP) is a device that allows your computer to connect to an existing set of communicating devices. The access point usually has a direct connection to the internet, and can relay data between the wireless devices and the devices it can access.
ht: Nan yon anviwònman san fil, yon pwen aksè (AP) se yon aparèy ki pèmèt òdinatè w lan pou konekte avèk yon seri ki deja egziste nan kominike aparèy. Pwen an aksè anjeneral gen yon koneksyon dirèk ak entènèt la, e yo ka relè done ant aparèy yo san fil ak aparèy yo li kapab jwenn aksè nan.

source: Multiple ways to connect to others
ht: Plizyè fason pou konekte avèk lòt moun

source: wireless access point (WiFi hotspot);
ht: san fil pwen aksè (WiFi hotspot);

source: Connecting through an access point
ht: Koneksyon nan yon pwen aksè

source: You can connect from the Neighborhood View. You can see information about the connection on the Frame.
ht: Ou ka konekte soti nan View nan Katye. Ou ka wè enfòmasyon sou koneksyon an sou ankadreman an.

source: **Step 1: Go to the Neighborhood View**
ht: ** Etap 1: Ale nan Katye View la **

source: Go to the Neighborhood View to connect to an access point.
ht: Ale nan View nan Katye pou konekte avèk yon pwen aksè.

source: Tip: To access the Neighborhood View, click on the Neighborhood Icon on the Frame or by pressing the F1 key.
ht: Ide: Pou jwenn aksè a View Katye, klike sou icon nan Katye sou ankadreman an oswa pa peze kle a F1.

source: **Step 2: Choose an access point**
ht: ** Etap 2: Chwazi yon pwen aksè **

source: Networks (access points) are represented by circles on the Neighborhood View. Hover over a circle to see more information about an access point. An access point is identified by the name (ESSID) it broadcasts. An OLPC laptop mesh-point—represented by a series of concentric circles—is identified by its channel number (1, 6, or 11). You can also search for an access point by name in the search bar at the top of the page.
ht: Rezo (pwen aksè) yo reprezante pa ti sèk sou Katye View. Vol sou yon sèk sou yo wè plis enfòmasyon sou yon pwen aksè. Yon pwen aksè idantifye se pa non an (ESSID) li emisyon. Ou kapab tou rechèch pou yon pwen aksè pa non nan ba rechèch la nan tèt la nan paj la.

source: Note: If an access point is not broadcasting its name, the Neighborhood View may show that AP with some other name.
ht: Remak: Si yon pwen aksè se pa sa difize non li, Katye View la pouvwa montre ke AP ak kèk lòt non.

source: Signal strength is indicated by the fill level of the circle. The color of the circle is based upon the name of the access point. A lock icon identifies networks that are secured and require a key (passcode) to use. A star icon identifies access points that have been previously used (favorites).
ht: Se fòs siyal endike nan nivo a ranpli nan sèk la. Se koulè a ​​nan sèk la ki baze sou non an nan pwen an aksè. Yon icon fèmen idantifye rezo ke yo garanti epi mande pou yon kle (paskod) yo sèvi ak. Yon icon zetwal idantifye pwen aksè ki te te sèvi deja (favorites).

source: **Step 3: Activate a connection**
ht: ** Etap 3: Aktive yon koneksyon **

source: To activate a network connection, click once inside the circle that corresponds to your chosen access point (or click on the Connect option in the hover menu).
ht: Yo sa aktive yon koneksyon rezo, klike sou yon fwa andedan sèk la ki koresponn ak pwen aksè chwazi ou (oswa klike sou opsyon nan Connect nan meni an hover).

source: While the connection is being established, the inside of the circle will blink. Once the connection is established, an icon for that connection will be shown on the bottom edge of Frame. If for some reason the connection failed, the circle will stop blinking. Sometimes it is necessary to try several times before the connection is established.
ht: Pandan ke se koneksyon la ke yo te etabli, anndan an nan sèk la pral bat je l. Yon fwa yo koneksyon a te etabli, yo pral yon icon pou ke koneksyon ka montre sou kwen an anba nan Frame. Si pou kèk rezon koneksyon la echwe, sèk la yo ap sispann kliyote. Pafwa li nesesè eseye plizyè fwa anvan se koneksyon a te etabli.

source: If the access point is secured and requires a key, a dialog prompts you for the required information. Different access points may require different types of keys. Before entering the key, be sure to select the correct type from the pull-down menu that is presented.
ht: Si se pwen an aksè garanti ak mande pou yon kle, yon dyalòg envit ou pou enfòmasyon yo mande. Pwen aksè diferan ki ka mande pou diferan kalite kle. Anvan ou antre kle a, asire w ke ou chwazi kalite ki kòrèk la nan meni an rale-desann ki ap prezante.

source: **Step 4: Checking the connection**
ht: ** Etap 4: Lè nap Peye koneksyon la **

source: The connection status is detailed in a hover menu.
ht: A sitiyasyon an koneksyon detaye nan yon meni hover.

source: You can check the status of your connection from the Frame (from any view). By hovering over the circle icon, you will find details about your connection status in a hover menu. OLPC deployments
ht: Ou ka tcheke estati a nan koneksyon ou a soti nan ankadreman an (ki soti nan nenpòt View). Pa elikopte sou icon nan sèk, ou pral jwenn plis detay sou estati koneksyon ou a nan yon meni hover. Deplwaman OLPC

source: OLPC has designed a mesh network that allows XO laptops to communicate without the presence of the Internet and a School Server as a means to make their school network connectivity more efficient. The School Server also provides web and chat services.
ht: OLPC te fèt yon rezo may ki pèmèt laptops XO yo kominike san yo pa nan prezans nan entènèt la ak yon sèvè Lekòl kòm yon mwayen fè koneksyon rezo lekòl yo pi efikas. Sèvè a la tou bay entènèt ak chat sèvis.

source: Note to parents and teachers
ht: Remake byen paran ak pwofesè

source: Collaboration between learners is one of the most important features of Sugar. To enable collaboration in a classroom or home setting, it is necessary to establish the same type of connection for each computer. Computers can be connected through a School Server, a simple mesh if they are OLPC XOs, or an access point.
ht: Kolaborasyon ant elèv k ap aprann se youn nan karakteristik yo ki pi enpòtan nan Sugar. Pou pèmèt kolaborasyon nan yon sal klas oswa lakay anviwònman, li se nesesè yo etabli kalite la menm nan koneksyon pou chak òdinatè. Odinatè kapab konekte nan yon sèvè lekòl la, yon may senp si yo XO OLPC, oswa yon pwen aksè.

source: When using an access point for the connection, the computers must all use the same Jabber server in order to collaborate. Please refer to the Sugar Control Panel discussion in the Personalizing Sugar chapter for details regarding the configuration of Jabber.
ht: Lè w ap itilize yon pwen aksè pou koneksyon an, òdinatè yo dwe tout sèvi ak menm sèvè a Jabber yo nan lòd yo kolabore. Tanpri gade nan diskisyon an Kontwòl Panel Sugar nan chapit la pèsonalizé Sugar pou plis detay konsènan configuration la, te nan Jabber.

source: Additional hints
ht: Sijesyon Lòt

source: You make your connection from the Neighborhood View.
ht: Ou fè koneksyon ou a soti nan Katye View.

source: Your current connection status is shown on the Frame. Also, the hover menu will indicate "Connected". It sometimes takes 2–3 tries to connect. To disconnect, select “Disconnect” from the hover menu that appears in either of the network status menus (See Step 4 above).
ht: Yo montre estati koneksyon ou aktyèl sou ankadreman an. Epitou, meni an hover pral endike "konekte".

source: Access points are represented by circles. The fill level indicates signal strength.
ht: Pwen aksè yo reprezante nan ti sèk. Nivo a ranpli endike fòs siyal.

source: Access points that require keys have a lock icon. The color of the circle is calculated from the ESSID of the access point. The name of the access point is displayed when you hover over it.
ht: Pwen aksè ki mande pou kle gen yon icon seri. Se koulè a ​​nan sèk la kalkile soti nan ESSID a pwen an aksè. Non an nan pwen an aksè se parèt lè ou hover sou li.

source: You connect by “clicking” in the center of the circle. The center of the circle will blink while the laptop is trying to connect.
ht: Sant la nan sèk la pral bat je l pandan y ap konpitè pòtatif li a ap eseye konekte.

source: If you are using an OLPC XO computer, mesh points are represented by a series of concentric circles. The color of a mesh point is the same as your XO color. If your OLPC XO computer is “mesh enabled” and you have not connected to an AP, you will automatically be joined to a simple mesh network, enabling you to collaborate with others in the mesh, but not necessarily to access the Internet.
ht: Si w ap itilize yon òdinatè OLPC XO, may pwen yo reprezante pa yon seri de sèk konsantrik. Koulè a ​​nan yon pwen may se menm bagay la kòm koulè XO ou.

source: You are prompted if the access point requires a key.
ht: Ou ap pouse si pwen an aksè mande pou yon kle.
