Repository: tony37/sledhelp
Catalog: translated_po/ht/getting_support.po
Languages: ht

source: Getting Support
ht: Lè w Sipò

source: One Laptop per Child is an education project, not a laptop project. With connected laptops, learners are liberated to actively engage with others with similar interests in cultures of learning by doing without being limited by time or space. If you are having hardware or software problems with your XO, remember that its design is to encourage you to learn new things by trying to solve problems on your own!
ht: Youn Laptop pou chak timoun se yon pwojè edikasyon, se pa yon pwojè laptop. Avèk laptops konekte, elèv k ap aprann yo libere yo aktivman angaje ak lòt moun ki gen enterè menm jan an nan kilti pou yo aprann pa fè san yo pa limite pa tan oswa espas. Si w gen pyès ki nan konpitè oswa lojisyèl pwoblèm ki genyen ak XO ou, sonje ke desen li yo se pou ankouraje w aprann nouvo bagay pa ap eseye rezoud pwoblèm sou pwòp ou a!

source: That said, an entire community built this XO and everything on it, and we want to help you with it. Our OLPC global community of volunteers provide software and hardware troubleshooting and support. This section will help tell you where to find Support when you are really stuck! OLPC has proven that volunteer-driven support works, often with far more heartfelt caring than any corporate help desk!
ht: Sa te di, yon tout kominote bati sa a XO ak tout bagay sou li, e nou vle ede ou ak li. Kominote OLPC nou mondyal nan volontè bay lojisyèl ak kenkayri depanaj ak sipò. Seksyon sa a ap ede di ou ki kote yo jwenn sipò lè ou se reyèlman kole! OLPC te pwouve ke volontè-kondwi travay sipò, souvan avèk byen lwen plis sensè k ap pran swen pase nenpòt ki ede biwo rèstriktirasyon!

source: If you have questions about the XO, ask a teacher for help, a friend, or search on the Internet. If you have a question about your XO, there is a very good chance it is already answered within our expanding Support FAQ / RTFM knowledge base:
ht: Si w gen kesyon sou XO a, mande yon pwofesè pou èd, yon zanmi, oswa rechèch sou entènèt la. Si ou gen yon kesyon sou XO ou a, gen yon chans trè bon li se deja reponn nan Sipò FAQ / baz konesans RTFM agrandi nou an:

source: http://wiki.laptop.org/go/Support_FAQ
ht: http: // wiki. laptop. org / ale / Support_FAQ

source: Next try looking at http://support.laptop.org extensive helpful guidance for exploring and fixing your XO, allowing you to solve challenging issues right alongside others. Specifically, check out:
ht: Next eseye gade nan http: // sipò. laptop. org vaste konsèy itil pou eksplore ak repare-XO ou, ki pèmèt ou rezoud pwoblèm difisil dwa ansanm ak lòt moun. Espesyalman, tcheke deyò:

source: Getting Started: http://laptop.org/start
ht: Pou kòmanse: http: // laptop. org / kòmansman

source: Email Lists: http://lists.laptop.org
ht: Imèl Lis: http: // lis. laptop. org

source: Live Chat: http://forum.laptop.org/chat
ht: Live Chat: http: // fowòm. laptop. org / chat

source: OLPC Community: Wiki http://wiki.laptop.org
ht: OLPC Kominotè: Wiki http: // wiki. laptop. org

source: If you are still unable to find an answer online, please email help@laptop.org.
ht: Si ou toujou kapab jwenn yon repons sou entènèt, tanpri voye yon imèl èd @ laptop. org.

source: Did you know that our volunteers staff a live Help Chat site 24/7, on the Internet? Click here: http://forum.laptop.org/chat Login with the color-name shown; that's guest ID. Type your question in the chat line at the bottom. You may have to wait for a response as our volunteers come in and out. If you are patient, we can probably help you! To learn more about what Internet Relay Chat (the system that makes this possible) is, click here: http://wiki.laptop.org/go/IRC
ht: Èske w te konnen volontè nou anplwaye yon Ede Chat sit viv 24/7, sou entènèt la? Klike sou isit la: http: // fowòm. laptop. org / chat Connexion ak koulè non an-montre; sa a, se ID envite. Tape kesyon ou nan liy lan chat nan pati anba a. Ou ka gen pou ret tann pou yon repons kòm volontè nou yo rive nan ak soti. Si ou se pasyan, nou ka pwobableman ede w! Pou aprann plis sou sa Relay entènèt Chat (sistèm la ki fè sa a posib) se, klike isit la: http: // wiki. laptop. org / ale / ir

source: We would also like to make special mention of our Support Gang, where an enthusiastic group of volunteers assist XO users all over the world. If you are impressed with the passion and hard work of our volunteers, please consider giving back, by joining our dedicated community. Take a look at the link below. We would welcome your participation! http://wiki.laptop.org/go/Support_Gang http://wiki.laptop.org/go/Support_FAQ Be sure to review the Frequently Asked Questions (FAQ) link above. Many of us join and "learn by doing."
ht: Nou ta renmen tou fè mansyone espesyal nan Gang Sipò nou an, kote yon gwoup antouzyastik nan volontè ede itilizatè XO nan tout mond lan. Si ou se enpresyone ak pasyon a ak travay di nan volontè nou yo, tanpri konsidere bay tounen, pa rantre nan kominote nou an dedye. Pran yon gade nan lyen ki anba a. Nou ta akeyi patisipasyon ou! http: // wiki. laptop. org / ale / Support_Gang http: // wiki. laptop. org / ale / Support_FAQ Asire ou ke ou revize Kesyon yo poze souvan (FAQ) lyen pi wo a. Anpil nan nou rantre nan ak "aprann nan fè. "

source: Thanks very much! OLPC Support Gang
ht: Mèsi anpil! OLPC Sipò Gang
