Repository: tony37/sledhelp
Catalog: translated_po/ht/give_me_the_internet.po
Languages: ht

source: Give Me the Internet
ht: Ban mwen Entènèt la

source: Give Me the Internet, Please
ht: Ban mwen Entènèt la, Tanpri

source: The designers of the XO laptop designed it for primarily wireless access, so it can work well in developing nations, where it is faster and less expensive to introduce wireless connections than wired ones.
ht: Konsèpteur yo nan konpitè pòtatif li a XO fèt li pou gen aksè sitou san fil, se konsa li ka travay byen nan devlope nasyon, kote li se pi vit ak mwens chè prezante koneksyon san fil pase branche moun.

source: XOs are designed to connect to other XOs using a mesh network. A mesh network allows nearby XO laptops to talk to one another directly (wirelessly) without the need for a traditional Internet Service Provider (ISP).
ht: XO yo fèt pou konekte avèk lòt XO lè l sèvi avèk yon rezo may. Yon rezo may pèmèt laptops XO ki tou pre pou pale ak youn lòt dirèkteman (wirelessly) san yo pa bezwen an pou yon Founisè Sèvis Entènèt tradisyonèl (ISP).

source: The XO also supports wireless connections for direct Internet connection. Collaboration with others on Activities does not require an Internet connection.
ht: XO a sipòte tou koneksyon san fil pou dirèk koneksyon entènèt. Kolaborasyon avèk lòt moun sou Aktivite pa mande pou yon koneksyon entènèt.

source: There are different ways to connect to the Internet:
ht: Gen diferan fason pou konekte avèk entènèt la:

source: using a wireless access point such as a WiFi hotspot at a library or coffee shop, or a location that has a wireless router such as your house
ht: lè l sèvi avèk yon pwen aksè san fil tankou yon otspo fil nan yon boutik bibliyotèk oswa kafe, oswa yon kote ki gen yon routeur fil tankou kay ou

source: using a "School Server" provided by your school system
ht: lè l sèvi avèk yon "lavil la sèvè" ki ofri pa sistèm lekòl ou

source: using a USB-to-Ethernet cable that plugs into a cable modem, DSL modem, or local network such as those offered at a home or workplace
ht: lè l sèvi avèk yon kab USB-a-Ethernet ki ploge nan yon modèm kab, DSL modem, oswa rezo lokal tankou sa yo ki ofri nan yon kay oswa yon espas travay

source: Before you connect
ht: Anvan ou konekte

source: If you are going to connect at school or at home, check with your ISP to find out if the network is protected with a password. Your router also has a password which can be found in its documentation. Become familiar with your wireless router settings so that you can troubleshoot the connection if needed. The Troubleshooting chapter offers some assistance.
ht: Si ou yo ale nan konekte nan lekòl la oswa nan kay la, tcheke avèk ISP ou yo chèche konnen si se rezo a pwoteje ak yon modpas. Routeur ou tou te gen yon modpas ki ka jwenn nan dokiman li yo. Familyarize w avèk anviwònman san fil routeur ou pou ke ou ka rézoudr koneksyon an si sa nesesè. Chapit la depanaj ofri kèk asistans.

source: Check your current connection status as shown in the lower right area on the Frame. If you have connected successfully in the past, the XO "remembers" the connection and will connect again in the future.
ht: Tcheke estati aktyèl koneksyon ou menm jan yo montre nan zòn nan pi ba dwa sou ankadreman an. Si ou te konekte avèk siksè nan tan lontan an, XO a "sonje" koneksyon a epi yo pral konekte ankò nan tan kap vini an.

source: Go to a location with your XO where you know there is a Wireless Access Point (WAP) nearby.
ht: Ale nan yon kote ki gen XO ou kote ou konnen gen yon Pwen Aksè san fil (WAP) ki tou pre.

source: Find out the network name (or SSID) and its password, if it is secured with a password. The XO refers to this as the Wireless Key.
ht: Chèche konnen ki nan rezo (oswa ssid) ak modpas li yo, si li se garanti ak yon modpas. XO a refere a sa a kòm Wireless kle a.

source: Connecting
ht: Koneksyon

source: Go to the Neighborhood View.
ht: Ale nan Katye View.

source: In the Search field, enter the name of the network to which you want to connect.
ht: Nan jaden an Search, antre nan non an nan rezo a yo ki ou vle konekte.

source: Or roll the pointer over one of the network access circles until you recognize the name of the wireless network.
ht: Oswa woule konsèy la sou youn nan ti sèk yo rezo aksè jiskaske ou rekonèt non an nan rezo a san fil.

source: Checking name of an AP
ht: Lè nap Peye non yon kou avanse AP

source: Connect by clicking the center of the circle.
ht: Konekte pa klike sant la nan sèk la.

source: Wireless access points are represented by circles. The fill level indicates signal strength.
ht: Pwen aksè san fil yo reprezante nan ti sèk. Nivo a ranpli endike fòs siyal.

source: Access points that require keys have a "locked" icon.
ht: Pwen aksè ki mande pou kle gen yon "fèmen" icon.

source: Access points that you have successfully connected to become "Favorites" as indicated by a star icon.
ht: Pwen aksè ke ou te avèk siksè konekte nan vin "Favorites" jan sa endike nan yon icon zetwal.

source: TODO: Picture_49.png need a new screen shot for the new mesh network
ht: Todo: Picture_49. png bezwen yon nouvo piki ekran pou rezo a may nouvo

source: Access points that represent the Mesh network are indicated with a target icon, with one for channel 1, one for channel 6, and one for channel 11. Hover your pointer over the access point to see if you're already connected or if you need to click to connect.
ht: Pwen aksè ki reprezante rezo a may yo endike ak yon icon sib, ak yon sèl pou chanèl 1, yonn pou kanal 6, ak yonn pou kanal 11. Hover konsèy ou sou pwen an aksè nan wè si w ap deja konekte oswa si ou bezwen klike sou yo konekte.

source: Connected
ht: Konekte

source: Not yet connected
ht: Pa ankò konekte

source: The name of the access point is displayed when you hover over it.
ht: Non an nan pwen an aksè se parèt lè ou hover sou li.

source: The center of the circle blinks while the laptop is trying to connect.
ht: Sant la nan sèk la pandan y ap flache konpitè pòtatif li a ap eseye konekte.

source: Enter the wireless key if prompted. You might need to ask your teacher or parent for the wireless key.
ht: Antre kle a san fil si pouse. Ou ta ka bezwen mande pwofesè ou oswa paran pou kle a san fil.

source: Entering wireless encryption (WEP) password
ht: K ap antre nan san fil chifreman (WEP) modpas

source: While the XO is connecting to the network, the Access Point blinks.
ht: Pandan ke XO a ap konekte nan rezo a, li bat je yo Pwen Aksè.

source: Once you are connected, the menu on the circle in the Neighborhood View changes, and you can see a circle in the lower right area of the Frame.
ht: Yon fwa ou yo ki konekte, meni an sou sèk la nan Katye View a chanje, epi ou ka wè yon sèk nan zòn nan pi ba dwa nan ankadreman an.

source: if the attempt to connect fails, the circle stops blinking, but the access point icon does not appear in the Frame. Click the circle in the Neighborhood View to try again—it sometimes takes 2–3 tries to connect.
ht: si tantativ la konekte echwe, sèk la sispann kliyote, men icon nan pwen aksè pa parèt nan ankadreman an.

source: To disconnect from the network, hover the pointer over the access point and click Disconnect on the menu.
ht: Dekonekte soti nan rezo a, hover konsèy la sou pwen an aksè, epi klike Dekonekte sou menu an.

source: Once your XO is connected, you can return back to the Home View and launch the Browse Activity.
ht: Yon fwa yo XO ou konekte, ou ka retounen tounen nan View nan Kay ak lanse Browse aktivite a.

source: If you have not yet added the Browse Activity to your favorites, click the List View (left) and scroll to Browse. Add the Activity to your favorites list by clicking the star next to it (1). Launch Browse for the first time by clicking the globe icon (2). Next time, you can use the freeform view to launch it (as is done in the next step).
ht: Si ou pa gen ankò te ajoute Browse aktivite a sou favori yo ou a, klike Lis View (agòch) ak woulo liv nan Browse. Ajoute aktivite a nan lis favorites ou pa klike zetwal la akote l (1). Lanse Browse pou premye fwa a pa klike icon a glòb (2). Pwochen fwa, ou ka itilize gade nan freeform yo lanse li (kòm se fè nan pwochen etap la).

source: If you have added the Browse Activity to your favorites list, you can click the globe icon to open the Browse Activity and test your access to the Internet.
ht: Si ou gen te ajoute Browse aktivite a nan lis favorites ou, ou ka klike sou ikòn nan glòb yo louvri Browse aktivite a ak tès aksè ou a entènèt la.

source: Click the globe icon to launch the Browse Activity.
ht: Klike sou ikòn nan glòb yo lanse Browse aktivite a.

source: If you cannot see an Access Point with a name that you recognize, the wireless antenna might be too far away, or the Access Point might not be working properly. For more information, or if you have difficulties getting a network connection, refer to the Troubleshooting chapter.
ht: Si ou pa ka wè yon pwen aksè ak yon non ke ou rekonèt, antèn la san fil ta ka twò lwen, oswa pwen an aksè pa ta ka travay byen. Pou plis enfòmasyon, oswa si w gen difikilte pou jwenn yon koneksyon rezo, al gade nan chapit la depanaj.

source: More information about your XO's connection:
ht: Plis enfòmasyon sou koneksyon XO a ou:

source: Your Wireless Access Point has a network name, also called an SSID, that displays in the Neighborhood View. The XO cannot recognize SSIDs that are hidden, which is configured on the access point. Refer to the Troubleshooting chapter for more information about hidden SSIDs.
ht: Wireless Aksè Point ou gen yon non rezo a, yo te rele tou yon ssid, ki montre nan gade nan Katye. XO a pa ka rekonèt SSIDs ke yo kache, ki se configuré sou pwen an aksè. Gade nan chapit la depanaj pou plis enfòmasyon sou SSIDs kache.

source: If you are connected to the Internet, your XO laptop cannot be on the mesh network, and if your XO is on a mesh network, it cannot simultaneously connect wirelessly to the Internet.
ht: Si w ap konekte ak entènèt la, ordinateur XO ou pa kapab sou rezo a may, epi si XO ou se sou yon rezo may, li pa ka ansanm konekte wirelessly nan entènèt la.

source: Mesh or AP
ht: May oswa AP

source: If the XO cannot find an available Internet network point after five minutes of searching, it defaults to Mesh Network 1, which enables your XO laptop to connect to other nearby XO laptops.
ht: Si XO a pa ka jwenn yon pwen rezo Entènèt disponib apre senk minit nan chache, li défaut may Rezo 1, ki pèmèt konpitè pòtatif XO ou pou konekte avèk lòt laptops XO ki tou pre.

source: Please be patient; it can take your XO up to a minute to find newly visible networks.
ht: Tanpri pran pasyans; li ka pran ou moute XO yon minit jwenn rezo fèk vizib.

source: Sometimes you'll be asked to enter the "Wireless Key" again. Enter it again and repeat until your connection is complete.
ht: Pafwa ou pral mande yo antre nan "Wireless kle a" ankò. Antre nan l 'ankò epi repete jiskaske koneksyon ou se konplè.

source: For more information about connecting, please see the Support FAQ online.
ht: Pou plis enfòmasyon sou konekte, tanpri al gade FAQ a Sipò sou entènèt.
