Repository: tony37/sledhelp
Catalog: translated_po/ht/glossary.po
Languages: ht

source: Activity
ht: Aktivite

source: Sugar education software module. In other contexts these might be called programs, but we prefer to emphasize what the students can do with them, not where they came from.
ht: Sugar lojisyèl edikasyon modil. Nan lòt kontèks sa ta ka rele pwogram yo, men nou prefere mete aksan sou sa elèv yo ka fè ak yo, yo pa kote yo te soti nan.

source: Definition
ht: Definisyon

source: An association between a name which may mean nothing by itself and a description intended to convey an important idea. Frequently we need a different kind of association between names and ideas, such as pictures, animations, or actual experience. The most important purpose of definitions is to explain what the thing named does; another is to describe its uses, or as we often say its purposes; a third is to describe the appearance of something, so that we can recognize it when we see it; a fourth is to enable us to talk about the thing conveniently with those who already have some idea of it. Usually the order of importance of these purposes is entirely misunderstood.
ht: Yon asosyasyon ant yon non ki ka vle di pa gen anyen pou kont li ak yon deskripsyon gen entansyon transmèt yon lide enpòtan. Souvan nou bezwen yon lòt kalite diferan nan asosyasyon ant non ak lide, tankou foto, Animations, oswa eksperyans aktyèl. Rezon ki pi enpòtan nan definisyon se a esplike kisa bagay la yo te rele fè; yon lòt se a dekri itilizasyon li yo, oswa kòm nou souvan di rezon li yo; yon twazyèm se a dekri aparans nan yon bagay, pou nou ka rekonèt li lè nou wè li; yon katriyèm se pou pèmèt nou pale sou bagay la bon ak moun ki deja gen kèk lide sou li. Jeneralman sa yo se lòd la enpòtans nan rezon sa yo antyèman konpwann.

source: Activity that shows in the Home view icon ring. A user can mark an Activity as a Favorite in the List view by clicking the star outline next to the Activity name.
ht: Aktivite ki montre nan icon bag la View Kay. Yon itilizatè ka make yon aktivite kòm yon pi renmen nan gade nan Lis pa klike deskripsyon an etwal akote non an aktivite.

source: Popup rectangular border in Sugar showing View icons and active Activities on the top; friend icons on the right; hardware icons on the bottom; and icons for open documents on the left. The frame is activated by putting the mouse cursor into a corner of the screen, or optionally the side (see My Settings), or by pressing the Frame button on the top right of an XO keyboard. Moving the mouse cursor away from the activation area or pressing the Frame button while the Frame is active dismisses the Frame.
ht: Popup fwontyè rektangilè nan Sugar montre View ikon ak Aktivite aktif sou tèt la; zanmi ikon sou bò dwat la; ikon kenkayri sou anba a; ak ikon pou dokiman ouvè sou bò gòch la. Se ankadreman a aktive pa mete kurseur an sourit nan yon kwen nan ekran an, oswa opsyonèlman bò la (gade Anviwònman mwen), oswa pa peze bouton an Frame sou bò dwat la anwo nan yon klavye XO. Botwe kurseur an sourit kite zòn nan deklanchman oswa peze bouton an Frame pandan y ap ankadreman an se aktif konjedi Frame nan.

source: Group view
ht: View Group

source: View showing colored XO icons of the user's friends who are connected, and grayed-out icons for those who are not.
ht: View montre ikon koulè XO nan zanmi itilizatè a ki moun ki yo ki konekte, ak grize-soti ikon pou moun ki pa.

source: Home view
ht: View Kay

source: View showing XO icon, an icon for the current Activity (or journal if no Activity has been started), and a ring or other arrangement of available Activity icons.
ht: View montre icon XO, yon icon pou aktivite aktyèl la (oswa jounal si pa gen okenn aktivite te kòmanse), ak yon bag oswa lòt aranjman nan ikon aktivite disponib.

source: A menu that pops up when the mouse cursor is held over an icon for one second, and expands further after one more second. A feature that many users cannot discover without being told about it.
ht: Yon meni ki Pops leve lè se kurseur an sourit ki te fèt sou yon icon pou yon dezyèm fwa, epi etann plis apre yon sèl plis dezyèm. Ke yo te yon karakteristik ki anpil divinò pa ka dekouvri san yo pa te di sou li.

source: Synonym for Glossary.
ht: Synonym pou Glossary.

source: A browser for saved software sessions and documents, allowing sorting, searching, and access to metadata.
ht: Yon navigatè pou sesyon sove lojisyèl ak dokiman, sa ki pèmèt klasman, chache, ak aksè nan Metadata.

source: Menu Bar
ht: Bar Menu

source: A rectangular area at the top of the screen containing text labels or icons, where clicking with the mouse results in the appearance of a drop-down menu containing further labels or icons for Activity functions available to the user.
ht: Yon zòn rektangilè nan tèt la nan ekran an ki gen etikèt tèks oswa ikon, kote klike ak rezilta yo sourit nan aparans nan yon meni drop-desann ki gen etikèt plis oswa ikon pou fonksyon aktivite disponib nan itilizatè a.

source: Information about a file, such as file type, software used to create it, description, tags, a screen shot, date and time, and more. The Journal maintains metadata about saved documents and software sessions.
ht: Enfòmasyon sou yon dosye, tankou dosye kalite, lojisyèl itilize yo kreye li, deskripsyon, Tags, yon piki ekran, dat ak lè, ak plis ankò. Journal la kenbe Metadata sou dokiman sove ak nan sesyon lojisyèl.

source: Neighborhood view
ht: Katye vi

source: View showing wireless mesh and access points, connected XOs, and shared Activities.
ht: View montre fil may ak aksè pwen, XO konekte, ak Aktivite pataje.

source: Operating System. This describes the Software that runs on your XO laptop.
ht: Sistèm operasyon. Sa a dekri lojisyèl an ki kouri sou laptop XO ou.

source: School server (XS)
ht: Sèvè Lekòl la (X)

source: A computer designed by OLPC for use in schools to hold student backups and content, and to provide school administration server software such as Moodle.
ht: Yon òdinatè ki fèt nan OLPC pou itilize nan lekòl yo kenbe sovgad ak kontni elèv, ak bay administrasyon lekòl sèvè lojisyèl tankou moodl.

source: Education software for the One Laptop Per Child project, designed to run on the XO and on other computers running the Linux operating system.
ht: Lojisyèl Edikasyon pou Youn Laptop la Per pwojè Timoun, ki fèt yo kouri sou XO a, epi sou lòt òdinatè kouri sistèm nan fonksyone Linux.

source: A rectangular area of the screen, usually at the top, containing icons representing Activity functions available to the user.
ht: Yon zòn rektangilè nan ekran an, anjeneral, nan tèt la, ki gen ikon reprezante fonksyon aktivite disponib nan itilizatè a.
