Repository: tony37/sledhelp
Catalog: translated_po/ht/group_view.po
Languages: ht

source: Group View
ht: Gwoup View

source: The Group View shows you, your friends and allows you to easily interact with them.
ht: View nan Group montre ou, zanmi ou yo ak pèmèt ou fasil kominike avèk yo.

source: Accessing the Group View
ht: Antre nan Group View

source: To show the Group View, click the Group icon on the Frame or press the F2 key.
ht: Pou montre Group View a, klike sou ikòn nan Group sou ankadreman an oswa peze kle a F2.

source: The Group View shows you and your friends. XO icons that are dimmed represent friends who are currently offline.
ht: View nan Group montre ou ak zanmi ou. Ikon XO ke yo grize reprezante zanmi ki se kounye a offline.

source: Adding a friend
ht: Ajoute yon zanmi

source: You add friends to the Group View from the Neighborhood View.
ht: Ou ajoute zanmi Group View nan soti nan View nan Katye.

source: When you hover over an XO icon, the Make friend menu option appears. Click this option to add that person as a friend.
ht: Lè ou hover sou yon icon XO, opsyon nan meni Fè zanmi parèt. Klike sou opsyon sa a yo ajoute moun sa a kòm yon zanmi.

source: Your new friend's icon then appears in the Group View.
ht: Icon nouvo zanmi ou a Lè sa a, parèt nan Gwoup View.

source: Inviting a friend
ht: Envite yon zanmi

source: From the hover menu, you can also invite friends to join your current Activity. There is more information about invitations and sharing in the Collaborating chapter.
ht: Soti nan meni an hover, ou ka tou envite zanmi rantre nan aktivite ou ye kounye a. Gen plis enfòmasyon sou envitasyon ak pataje nan chapit la Kolabore.

source: Removing a friend
ht: Retire yon zanmi

source: You can remove a friend from the Group View using the hover menu. Click Remove friend. That person's icon disappears from the Group View.
ht: Ou ka retire yon zanmi ki sòti nan gwoup View lè l sèvi avèk meni an hover. Klike sou Retire zanmi. Icon moun sa a disparèt soti nan Gwoup View.
