Repository: tony37/sledhelp
Catalog: translated_po/ht/hardware_evolution.po
Languages: ht

source: Hardware evolution
ht: Evolisyon Materyèl

source: Hardware Evolution 2008 - 2012
ht: Materyèl Evolisyon 2008 - 2012

source: Although the XO has continued to look pretty much the same on the outside, the electronics inside have been changing. For details of the differences, refer to:
ht: Malgre ke gen XO a kontinye ap gade bèl anpil menm bagay la sou deyò a, elektwonik yo andedan yo te chanje. Pou detay sou diferans ki genyen, al gade nan:

source: http://wiki.laptop.org/go/Hardware_specification for the XO 1.0
ht: http: // wiki. laptop. org / ale / Hardware_specification pou XO a 1. 0

source: http://wiki.laptop.org/go/Hardware_specification_1.5
ht: http: // wiki. laptop. org / ale / Hardware_specification_1. 5

source: http://wiki.laptop.org/go/XO-1.75
ht: http: // wiki. laptop. org / ale / XO-1. 75

source: http://wiki.laptop.org/go/XO-4
ht: http: // wiki. laptop. org / ale / XO-4

source: To some extent, the changes were made to keep using high volume parts, and improve performance. The change from 1.5 to 1.75 involved a change of the processor from x86 to arm, and a reduction in power consumption of about 50%. With power management improvements, this permits the XO to last more than 3.5 hours.
ht: Nan yon sèten mezi, chanjman sa yo yo te fè lè l sèvi avèk yo kenbe segondè pati volim, ak amelyore pèfòmans. Chanjman nan soti nan 1. 5 a 1. 75 ki enplike yon chanjman nan processeur a soti nan x86 nan bra, ak yon rediksyon nan pouvwa konsomasyon nan sou 50%. Avèk amelyorasyon jesyon pouvwa, sa a pèmèt XO a dire plis pase 3. 5 èdtan.

source: XO-4 is available in two models, XO-4 and XO-4 Touch. XO-4 provides multi touch input on the display.
ht: XO-4 se disponib nan de modèl, XO-4 ak XO-4 Touch. XO-4 bay milti D 'manyen nan ekspozisyon an.

source: As you can see from the "boot time" comparison, lower power has not been at the expense of decreased performance.
ht: Kòm ou ka wè ki soti nan "bòt tan" konparezon an, pi ba pouvwa pa te nan depans lan nan diminye pèfòmans.

source: Hard Disk
ht: Difisil Disk

source: Memory
ht: Memwa

source: Boot Time
ht: Bòt Tan

source: 76 s
ht: 76 a

source: 54 s
ht: 54 a

source: 47 s
ht: 47 a

source: 4 or 8 GB
ht: 4 oswa 8 GB

source: 1 or 2 GB
ht: 1 oswa 2 GB

source: 38 s
ht: 38 a
