Repository: tony37/sledhelp
Catalog: translated_po/ht/help.po
Languages: ht

source: Help
ht: Ede

source: Help displays documentation for Sugar and the XO laptop.
ht: Ede montre dokiman pou Sik ak konpitè pòtatif li a XO.

source: The image above is of the top of the screen, when the Activity Help is running. There is a simple range of tabs and buttons on the top row of the toolbar. Starting from the left, they are:
ht: Imaj la pi wo a se nan tèt la nan ekran an, lè Ede nan aktivite ap kouri. Gen yon seri senp nan onglè ak bouton sou ranje nan tèt nan ba ikòn nan. Kòmanse nan bò gòch la, yo yo se:

source: Activity tab or toolbar button.
ht: Tab aktivite oswa bouton ba ikòn.

source: View toolbar button.
ht: View toolbar bouton.

source: Home button, brings you back to the index, or contents page.
ht: Bouton Kay, pote ou tounen nan endèks la, oswa sa paj.

source: Back button.
ht: Retounen bouton.

source: Forward button.
ht: Bouton Forward.

source: Stop, or close the Activity, on the far right of the toolbar.
ht: One Stop, oswa fèmen aktivite a, sou bò dwat la byen lwen nan ba ikòn nan.

source: Tour of Help
ht: Tour nan Èd

source: We see, working clockwise from top left:
ht: Nou wè, k ap travay soti nan goch gòch anwo:

source: Activity tab, here you can enter a name for the page or project. The "pencil and book" icon the Description button allows you to add a description to the :doc:`/journal` entry.
ht: Tab pou Aktivite, isit la ou ka antre nan yon non pou paj la oswa pwojè. "Kreyon ak liv" icon bouton an nan Deskripsyon pèmèt ou ajoute yon deskripsyon nan: doc la: `/ antre journal`.

source: The :doc:`/collaborating`, or sharing, icon is grayed out and not available.
ht: : Doc la: `/ collaborating`, oswa pataje, icon se grize deyò epi yo pa disponib.

source: In Help you do not really need to provide a name for the page you are researching, but it allows you to get back to it easily from the :doc:`/journal`.
ht: Nan ede w pa vrèman bezwen bay yon non pou paj la w ap fè rechèch sou, men li pèmèt ou jwenn tounen nan li fasil nan: doc la: `/ journal`.

source: View toolbar button. The buttons are zoom in, zoom out, and enlarge page to *Full screen*.
ht: View toolbar bouton. Bouton yo se rale nan, rale soti, ak elaji paj * Plein écran *.

source: *Next* button, top right of every page, takes you to the next page of Help.
ht: * Next * bouton, tèt dwat nan chak paj, pran ou nan pwochen paj la pou jwenn èd.

source: Follow links in the index to jump to that page. Here the Activity FotoToon is being selected.
ht: Swiv lyen nan endèks la Ale nan paj ki. Isit la FotoToon nan aktivite se ke yo te chwazi.

source: Forward and Back buttons help you navigate.
ht: Forward ak Retounen bouton ede w navige.

source: Use this small red icon, only showing when you hover the cursor over it, at the end of a paragraph heading, to place the paragraph well on your screen.
ht: Sèvi ak sa a ti icon wouj, sèlman montre lè ou hover kurseur a sou li, nan fen a nan yon tit paragraf, yo mete paragraf nan byen sou ekran ou.

source: Here we see a link to the OLPC getting started page. Within Help you can follow links, which take you onto the internet, when you are online.
ht: Isit la nou wè yon lyen nan OLPC la trape te kòmanse paj. Nan Ede ou kapab swiv lyen yo, ki pran ou sou entènèt la, lè ou se sou entènèt.

source: The Home button brings you back to the index, or contents page.
ht: Bouton an Kay pote ou tounen nan endèks la, oswa sa paj.

source: Stop, or close the Activity.
ht: One Stop, oswa fèmen aktivite a.

source: Help read aloud
ht: Ede li awotvwa

source: In Help, and other text based Activities, you can have robot Alice (the page :doc:`/speak` introduces Alice) read the page aloud in the background, while you explore the Activity. See :ref:`say_selected_text`
ht: Nan èd, ak lòt aktivite tèks ki baze, ou ka gen robo Alice (paj an: doc: `/ speak` entwodui Alice) li paj la byen fò nan background nan, pandan y ap ou eksplore aktivite a. Al gade nan: ref: `say_selected_text`

source: |more| The underlying software used to display Help, and for the user to edit within Help, is Sphinx. To explore the possibilities of documentation made using this software, please follow the link to *Sphinx* in the footnote below.
ht: | Plis | Lojisyèl an kache itilize yo montre èd, ak pou itilizatè a edite nan èd, se sfenks. Yo eksplore posiblite yo nan dokiman te fè lè l sèvi avèk lojisyèl sa a, tanpri swiv lyen ki nan * sfenks * nan nòt anba paj ki anba la a.
