Repository: tony37/sledhelp
Catalog: translated_po/ht/home_view.po
Languages: ht

source: Home View
ht: Kay View

source: Use the Home View to begin new Activities.
ht: Sèvi ak View la Kay yo kòmanse Aktivite nouvo.

source: Note: When you have clicked on an Activity's icon, please wait for that Activity to start. If you get impatient and happen to click again on the Activity's icon, you may end up with that Activity being started twice. When you click on an Activity's icon, you will see a start-up view while that Activity initializes. Once the Activity is running, you will be placed into its Activity View. If the Activity fails to start, you will instead be returned to Home View.
ht: Remak: Lè w klike sou icon yon aktivite a, tanpri, tann pou sa aktivite yo kòmanse. Si w ap resevwa enpasyan ak rive klike ankò sou icon Aktivite a, ou ka fini ak ke yo te ki te kòmanse aktivite de fwa. Lè ou klike sou icon yon aktivite a, ou pral wè yon View kòmanse-up pandan y ap ki aktivite inisyalizasyon. Yon fwa aktivite a ap kouri, ou pral mete nan Wè aktivite li yo. Si aktivite a echwe yo kòmanse, ou pral olye dwe retounen nan Kay View.

source: To get to the Home View, click the Home icon on the Frame or press the F3 key.
ht: Pou jwenn yo wè a Kay, klike sou ikòn la Kay sou ankadreman an oswa peze kle a F3.

source: The Home View has several modes. Each mode has a different arrangement of Activities:
ht: View nan Kay gen mòd plizyè. Chak mòd gen yon aranjman diferan nan Aktivite:

source: Your favorite Activities in a ring (Ring mode)
ht: Aktivite pi renmen ou nan yon bag (mòd Ring)

source: Your installed Activities in a list (List view)
ht: Aktivite ou enstale nan yon lis (lis View)

source: Your favorite Activities arranged freeform (Freeform mode)
ht: Aktivite pi renmen ou ranje freeform (mòd Freeform)

source: Favorites View
ht: Favoris View

source: Search box: Use the search box to find Activities. Note: If in List view you see fewer Activities than expected, you may need to click on the small X at the right end of the search box to undo an unintended search request.
ht: Bwat Search: Sèvi ak bwat rechèch la jwenn Aktivite. Remak: Si nan Lis View ou wè mwens Aktivite pase espere, ou ka bezwen klike sou ti X la nan fen a dwa a bwat rechèch la defèt yon demann rechèch entansyonel.

source: Favorites modes: Click an icon to switch to a different view. Hover over the Favorites icon to see a menu that lets you pick Ring mode or Freeform mode.
ht: Favoris mòd: Klike sou yon icon pou chanje an yon View diferan. Vol sou icon nan Favorites yo wè yon meni ki pèmèt ou chwazi mòd Ring oswa mòd Freeform.

source: List view: Click the icon to switch over to the List view.
ht: Lis vi: Klike sou ikòn nan chanje sou nan gade nan Lis.

source: Activity icon: Click an Activity icon to launch that Activity. Its icon is colored if the Activity has been used before and clicking on it will resume its last session. (Please see the Activity Menu section below for further information.) Only Activities that have been “starred” as favorites in the List View appear in this view.
ht: Icon Aktivite: Klike yon icon Aktivite yo lanse ki aktivite. Se icon li yo ki gen koulè pal si gen aktivite a te itilize anvan ak klike sou li pral rezime sesyon dènye li yo. (Tanpri gade nan seksyon Menu aktivite pi ba a pou plis enfòmasyon.

source: Active Activity icon: The icon of the currently active Activity appears under the XO icon.
ht: Aktif icon Aktivite: icon a nan aktivite a kounye a aktif parèt anba icon la XO.

source: XO icon: Hover the pointer over the "XO" in the center of the Home View to bring up a menu and to access the Sugar Control Panel (Please see the chapter on Customizing Sugar).
ht: XO icon: Hover konsèy la sou "XO a" nan sant la nan View a Kay yo pote moute yon meni ak jwenn aksè nan panèl la kontwòl Sugar (Tanpri gade chapit la sou Pèrsonalizasyon Sugar).

source: When a search is started the Activities which don't correspond to the result are greyed out.
ht: Lè yo bay yon rechèch te kòmanse Aktivite yo ki pa koresponn ak rezilta a yo grize soti.

source: List View
ht: Lis View

source: Use the List view to manage all of your Activities and to choose which Activity icons will appear on the Favorites view.
ht: Sèvi ak gade nan lis nan jere tout aktivite ou ak yo chwazi ki aktivite ikon ap parèt sou favori yo wè.

source: Activity favorite icon: A star, which is colored for favorite Activities, which appear in the Ring mode or Freeform mode. Click a star to color or clear it.
ht: Aktivite pi renmen icon: Yon etwal, ki se ki gen koulè pal pou Aktivite pi renmen, ki parèt nan mòd nan Ring oswa mòd Freeform. Klike sou yon etwal koulè oswa klè li.

source: Activity icon: Click the icon to launch the Activity or hover over it to see the corresponding menu.
ht: Icon Aktivite: Klike sou ikòn a lanse aktivite a oswa hover sou li yo wè meni an ki koresponn.

source: Hover menu: In this menu you can also launch, favorite and un-favorite Activities and erase them.
ht: Hover meni: Nan meni sa a ou ka lanse tou, Aktivite pi renmen ak un-pi renmen ak efase yo.

source: Version number: Here you can see which version of the Activity is currently installed. For more information about updating your Activities to the latest version please refer to the How to Install and Update Activities section.
ht: Nimewo Version: Isit la ou ka wè ki vèsyon an aktivite a se kounye a enstale. Pou plis enfòmasyon sou à Aktivite ou a vèsyon an dènye tanpri al gade seksyon an Ki jan yo Enstale ak ajou Aktivite.

source: Favorites View in Freeform Mode
ht: Favoris View nan Mode Freeform

source: The Freeform mode of the Home View works the same as the Ring mode, but the icons are arranged arbitrarily instead of in a circle. You can drag the icons in this View to visually group them in a way that makes sense to you.
ht: Mòd nan Freeform nan View a Kay travay menm bagay la kòm mòd la Ring, men ikon yo yo ranje abitrèman olye pou yo nan yon sèk. Ou ka trennen ikon yo nan View sa a vizyèlman gwoup yo nan yon fason ki fè sans nan ou.

source: Activity Menu
ht: Menu aktivite

source: When hovering over an Activity icon a corresponding menu appears. From there you can directly resume the last few Activity sessions or choose to start a new one.
ht: Lè plan sou yon icon Aktivite yon meni ki koresponn parèt. Soti nan gen ou ka dirèkteman rezime dènye sesyon yo aktivite kèk oswa chwazi yo kòmanse yon nouvo.

source: Use the hover menu that appears over the XO icon to access the Sugar Control Panel and to shutdown or restart the computer.
ht: Sèvi ak meni an ki parèt sou hover icon la XO jwenn aksè nan panèl la kontwòl Sik ak are oswa rekòmanse òdinatè a.
