Repository: tony37/sledhelp
Catalog: translated_po/ht/how_to_help.po
Languages: ht

source: First of all you might briefly contact gonzalo at laptop dot org by e-mail to tell him what you would like to contribute. If you write a new page , you can send him the page (as my_page.rst) as an attachment to an e-mail explaining briefly what is attached. If new images are linked into the page, send them too.
ht: Premye a tout ou ta ka yon ti tan kontakte Gonzalo a laptop dot org pa e-mail di l 'sa ou ta renmen kontribye. Si ou ekri yon paj nouvo, ou ka voye l 'paj la (kòm my_page. RST) kòm yon atachman nan yon e-mail eksplike yon ti tan ki sa ki tache. Si imaj nouvo yo lye nan paj la, voye yo tou.

source: If you have improved a page, the preferred method is to submit it as a "patch".
ht: Si ou yo te amelyore yon paj, metòd la pi pito a se yo soumèt li kòm yon "plak".

source: Tutorial 5 - generate a patch
ht: Tutorial 5 - jenere yon patch

source: Let's say you decide to work on the Help page, "Switching Activities". You might back up that page before you start. Open Terminal Activity (or any terminal emulator) and type,
ht: Se pou nou di ou deside travay sou paj la Ede, "Oblije chanje Aktivite". Ou ta ka tounen moute paj ki anvan ou kòmanse. Open aktivite Tèminal (oswa nenpòt Emulation tèminal) ak kalite,

source: Above, we have changed directory into help-activity, changed directory into source, and copied ``switching_activities.rst`` to a new file named ``switching_activities.rst.ori``
ht: Pi wo pase, nou te chanje anyè nan èd-aktivite, chanje anyè nan sous, ak kopye `` switching_activities. rst`` nan yon dosye nouvo rele `` switching_activities. RST. ori``

source: Make your changes to ``switching_activities.rst``. Save your changes regularly, and check by running the ``make html`` command that the page displays nicely. Once you are happy with your work, you can generate a patch like this:
ht: Fè chanjman ou a `` switching_activities. rst``. Sove chanjman ou regilyèman, epi tcheke pa kouri `` fè nan lòd html`` ki montre yo paj joliman. Yon fwa ou yo kontan ak travay ou, ou ka jenere yon patch tankou sa a:

source: The patch can now be sent as an e-mail attachment.
ht: Ka plak an kounye a ap voye kòm yon atachman e-mail.

source: For more information, in Terminal Activity (or any terminal emulator) type,
ht: Pou plis enfòmasyon, nan Aktivite Tèminal (oswa nenpòt Emulation tèminal) tape,

source: and
ht: ak

source: Further reading
ht: Pli lwen lekti

source: |more| For more complete help on reStructuredText:
ht: | Plis | Pou pi konplè èd sou reStructuredText:

source: Quick reStructuredText, http://docutils.sourceforge.net/docs/user/rst/quickref.html, is a cheat-sheet for reStructuredText.
ht: Quick reStructuredText, http: // docutils. SourceForge. net / Doc / itilizatè / RST / quickref. html, se yon tronpe-fèy pou reStructuredText.

source: "reStructuredText Directives" http://docutils.sourceforge.net/docs/ref/rst/directives.html by David Goodger, March 2013.
ht: Http "reStructuredText Enstriksyon": // docutils. SourceForge. net / Doc / ref / RST / direktiv. html pa David Goodger, mas 2013.

source: Sphinx reStructuredText Primer, http://sphinx-doc.org/rest.html, a brief introduction to reStructuredText concepts and syntax.
ht: Sfenks reStructuredText Manyèl, http: // sfenks-doc. org / rès. html, yon entwodiksyon kout reStructuredText konsèp ak sentaks.

source: Sphinx home page, http://sphinx-doc.org/index.html.
ht: Paj lakay sfenks, http: // sfenks-doc. org / endèks. html.

source: Another tutorial, http://matplotlib.org/sampledoc/.
ht: Yon lòt leson patikilye, http: // matplotlib. org / sampledoc /.
