Repository: tony37/sledhelp
Catalog: translated_po/ht/how_to_help.po
Languages: ht

source: How to edit Help and contribute
ht: Ki jan yo edit Ede ak kontribye

source: Page version for review.
ht: Page vèsyon pou revizyon.

source: Corrections, omissions, and feedback most welcome, iain at browndouglas dot plus dot com. 28 November 2013.
ht: Koreksyon, omisyon, ak remak ki pi akeyi yo, Iain nan browndouglas dot plis dot com. 28 Novanm 2013.

source: Help displays documentation for Sugar and the XO laptop.
ht: Ede montre dokiman pou Sik ak konpitè pòtatif li a XO.

source: This version of Help contains all the source files and images, and now a :ref:`View source` button. These files can be edited within Help, and displayed. Help is now capable of producing new pages for Help, or making completely fresh documentation.
ht: Sa a vèsyon nan Ede gen tout dosye yo sous ak imaj, e kounye a, yon: ref: `View source` bouton. Dosye sa yo ka edited nan èd, ak parèt. Ede se kounye a kapab pwodwi paj nouvo pou èd, oswa fè dokiman konplètman fre.

source: This page aims to show how to write attractive documentation, which, if users share their work, could be used to improve Help. To contribute you only need to:
ht: Paj sa a gen pou objaktif pou montre ki jan yo ekri dokiman atire, ki, si itilizatè pataje travay yo, yo ka itilize amelyore Ede. Pou kontribye ou sèlman bezwen:

source: Create a development environment
ht: Kreye yon anviwònman devlopman

source: Make changes
ht: Fè chanjman

source: Contribute the changes
ht: Kontribye chanjman yo

source: XO Help.xo 17 already includes the source files ready to use.
ht: XO Ede. xo 17 deja gen ladan sous la depoze pare yo itilize.

source: Alternatively, you can use git to get Help Activity with the most recent sources included. If you have the Activity Help already installed, uninstall it first. Generally an Activity is uninstalled from the F3, Home View, List, by selecting the Activity, and press Erase. Where Erase is not available, you need to delete ``Help.activity`` from the folder ``~/Activities``.
ht: Altènativman, ou ka sèvi ak git jwenn Ede aktivite ak sous yo ki pi resan enkli. Si ou gen èd nan aktivite deja enstale, unenstal li premye. Anjeneral se yon aktivite dezenstalasyon soti nan F3 a, Kay View, Lis, pa chwazi aktivite a, ak laprès Erase. Ki kote Erase a pa disponib, ou bezwen efase `` Ede. activity`` soti nan folder nan `` ~ / Activities``.

source: The following guide assumes you ``git clone`` from your home directory. This command will collect all the required resources.
ht: Gid sa a pansé ké ou `` clone`` git nan anyè lakay ou. Kòmandman sa a pral kolekte tout resous ki nesesè yo.

source: You can install it in your Sugar development environment doing: ::
ht: Ou ka enstale li nan anviwònman devlopman Sugar ou fè: ::

source: You need have a complete sugar environment to run "setup.py dev" if you have a error in your system, try run it in the Terminal Activity.
ht: Ou bezwen gen yon anviwònman sik konplè nan kouri "konfigirasyon. d dev "si ou gen yon erè nan sistèm ou a, eseye kouri li nan aktivite nan Tèminal.

source: and, when you are ready, to populate your Help pages ::
ht: epi, lè ou pare, peple Ede paj ou ::

source: You can modify any .rst file in ~/help-activity/source/ directory or the images in the ~/help-activity/source/images/ directory.
ht: Ou ka modifye nenpòt. dosye RST nan ~ / èd-aktivite / sous / anyè oswa imaj yo nan ~ / èd-aktivite / sous / images / anyè a.

source: To create the new HTML files you only need do: ::
ht: Pou kreye dosye yo HTML nouvo ou sèlman bezwen fè: ::

source: If you see an error indicating that HTML cannot be built, the most likely cause is that ``python-sphinx`` is missing.
ht: Si ou wè yon erè ki endike ke HTML pa ka bati, kòz la gen plis chans se ke `` piton-sphinx`` ki manke.

source: To fix this, in Terminal Activity (or any terminal emulator) as root, ::
ht: Pou repare sa a, nan aktivite Tèminal (oswa nenpòt Emulation tèminal) kòm rasin, ::

source: or in Debian or Ubuntu derivatives, ::
ht: oswa nan dbyan oswa Ubuntu dérivés, ::

source: In **Sugar** you don't need restart Help to see the changes after running ``make html``, you just click with the secondary mouse button, and select reload.
ht: Nan ** Sugar ** ou pa bezwen rekòmanse Ede wè chanjman yo apre kouri `` fè html``, ou jis klike ak bouton an sourit segondè, epi chwazi Reload.

source: In any other, non-Sugar, Linux environment the command ``git clone git@github.com:godiard/help-activity.git`` works to download the sources, ``./setup.py dev`` should be omitted, and the output of ``make html`` is in ``~/help-activity/html``, and is displayed by opening ``~/help-activity/html/index.html`` in a browser.
ht: Nan nenpòt ki lòt, ki pa Peye-Sugar, Linux anviwònman yo lòd, ki `` git git script @ GitHub. com: godiard / èd-aktivite. git`` travay nan download sous yo, ``. / Konfigirasyon. d dev`` ta dwe omisyon, ak pwodiksyon an nan `` fè html`` se nan `` ~ / èd-aktivite / html``, epi li se parèt pa ouvèti `` ~ / èd-aktivite / html / endèks. html`` nan yon navigatè.

source: What if I break Help?
ht: E si mwen kraze Ede?

source: In Sugar you cannot break Help. If you start to follow these instructions and get lost or make a mistake, and Help will not display correctly, you should not worry.
ht: Nan Sugar ou pa ka kraze Ede. Si ou kòmanse swiv enstriksyon sa yo epi pou yo jwenn pèdi oswa fè yon erè, epi ede pa pral montre kòrèkteman, ou pa ta dwe enkyete.

source: First back up any files.rst you have already made, then visit `ASLO <http://activities.sugarlabs.org>`_ with Browse. Search for Help, and download and install a new copy of XO Help.
ht: Premye do moute nenpòt ki dosye. RST ou te deja fè a, Lè sa a, vizite `aslo <http: // aktivite. sugarlabs. org> `_ ak Browse. Search pou èd, ak download yo ak enstale yon kopi nouvo nan XO Ede.

source: Alternatively, experienced users might make a backup .xo before starting to work by doing: ::
ht: Altènativman, ki gen eksperyans itilizatè ta ka fè yon backup. xo anvan yo kòmanse nan travay pa fè: ::

source: This will create a directory dist and inside, an .xo file.
ht: Sa a pral kreye yon dist anyè ak andedan, yon. xo dosye.

source: Tutorial 0 - Browse filesystem
ht: Tutorial 0 - Browse filèsistèm

source: In Browse and some other browsers if you type ::
ht: Nan Browse ak kèk lòt navigatè si ou tape ::

source: in the address bar, you will be browsing the root of your file system.
ht: nan ba a adrès, ou pral Navigasyon rasin lan nan sistèm dosye ou.

source: Now move progressively through ::
ht: Koulye a, deplase progresivman a ::

source: You are now able to open and inspect any of the *source_files.rst* safely.
ht: Ou se kounye a kapab louvri ak enspekte nenpòt nan source_files yo *. RST * san danje.

source: We can back off again and reach ::
ht: Nou ka tounen nan ankò, epi rive nan ::

source: and then select and display any of the output HTML files.
ht: ak Lè sa a chwazi epi montre nenpòt nan dosye yo HTML pwodiksyon.

source: In this page we use the convention of calling ``/home/your-username/help-activity/source`` by the shorter, ``~/help-activity/source``.
ht: Nan paj sa a nou itilize konvansyon an pou rezidan yo rele `` / Home /-non itilizatè ou an / èd-aktivite / source`` pa pi kout, `` ~ / èd-aktivite / source`` la.

source: Orientation
ht: Oryantasyon

source: **Source**
ht: ** Sous **

source: The two source folders we look at are filled initially by the download of Help.
ht: De dosye yo sous nou gade nan ki plen okòmansman pa download nan Èd.

source: The directory ``~/help-activity/source/`` contains the text files we will be altering in this guide.
ht: Anyè a `` ~ / èd-aktivite / sous / `` gen dosye yo tèks nou pral chanje nan gid sa a.

source: The directory ``~/help-activity/images/`` contains all the images that are used on the various pages of Help. You can add image files to this folder, and if they are linked into documents, they will display in the *output* of the command ``make html``.
ht: Anyè a `` ~ / èd-aktivite / images / `` gen tout imaj yo ke yo te itilize nan paj sa yo divès kalite nan Èd. Ou kapab ajoute dosye imaj nan sa a folder, e si yo te yo lye nan dokiman yo, yo pral montre nan pwodiksyon * * nan yo lòd, ki `` fè html``.

source: In Sugar you have the ability to inspect the source files safely, using the :ref:`View source` button on the Help icon in the Frame.
ht: Nan Sugar ou gen kapasite nan yo enspekte dosye yo sous san danje, lè l sèvi avèk: ref la: `View source` bouton sou èd icon a nan ankadreman an.

source: The key page in navigating Help is the Index or contents page. In the ``~/help-activity/source/`` folder, `index.rst` is the text document which automatically provides links to all other pages in the source folder.
ht: Paj la kle nan navige Gen èd ki Index oswa sa paj la. Nan `` ~ / èd-aktivite / sous la / `` katab, `endèks. rst` se dokiman la tèks ki otomatikman bay lyen ki mennen nan tout lòt paj nan dosye a sous.

source: **Output**
ht: ** Sòti **

source: The pages displayed in Help are the output of the command ``make html``. The files are in the folder ``~/help-activity/html/``.
ht: Paj sa parèt nan Ede yo pwodiksyon an nan yo lòd, ki `` fè html``. Dosye yo se nan dosye a `` ~ / èd-aktivite / html / ``.

source: Also part of the output of the command ``make html`` are the files in ``~/help-activity/doctrees/``. The role of the ``all_files.doctree`` is to interlink all the HTML pages within the rules of the underlying software.
ht: Epitou yon pati nan pwodiksyon an nan yo lòd, ki `` fè html`` yo dosye yo nan `` ~ / èd-aktivite / doctrees / ``. Wòl nan `` all_files yo. doctree`` se Interlink tout paj yo HTML ki nan règleman yo nan lojisyèl an kache.

source: Depending on the setup of your installation there may be a number of other folders present in the ``~/help-activity/html/`` folder (for instance ``_sources``, ``_static``, and ``_images``). These are also *output files*, they could be regarded as hidden folders, and should not be edited.
ht: Tou depan de konfigirasyon an nan enstalasyon ou ka gen yon nimewo nan lòt dosye prezan nan `` ~ / èd-aktivite / html / `` folder (pou egzanp `` _sources`` a, `` _static``, ak `` _images ``). Sa yo se tou * dosye pwodiksyon *, yo te kapab dwe konsidere kòm dosye kache, epi yo pa ta dwe edited.

source: You can just write a page in simple text, perhaps with some explanatory pictures or screen-shots. Screen-shots are made in Sugar from the keyboard, by pressing the "Alt" key and 1.
ht: Ou ka jis ekri yon paj nan tèks ki senp, petèt ak kèk foto eksplikasyon oswa ekran-vaksen. Screen-vaksen yo te fè nan Sugar soti nan klavye a, pa peze "Alt" kle a ak 1.

source: The page :doc:`/restructuredtext` gives some guidance on the features of the markup language we use. Do not be concerned with complex features, plain, simply written text will be of most use to new learners.
ht: Paj: doc la: `/ restructuredtext` bay kèk konsèy sou karakteristik yo ki nan lang nan baliz nou itilize. pa dwe konsène ak karakteristik konplèks, plenn, tèks tou senpleman ekri yo pral nan pi itilize nan nouvo elèv k ap aprann.

source: You will have your own ideas about what you would like to change and contribute. When you explain anything, which you have struggled to learn, it is likely to be of use to others. Seeing your work published gives quite a buzz!
ht: Ou pral gen pwòp ide ou sou sa ou ta renmen chanje ak kontribye. Lè ou eksplike anyen, ki ou te plede pou aprann, pou li se chans yo dwe nan sèvi ak bay lòt moun. Wè travay ou pibliye bay byen yon Buzz!

source: Here are a few exercises, which demonstrate making changes, and making pages.
ht: Isit la se yon egzèsis kèk, ki demontre fè chanjman, ak fè paj.

source: Tutorial 1 - Make a page
ht: Tutorial 1 - Fè yon paj

source: We are going to make a fresh page in reStructuredText. It will not at first be connected to the index, or contents page, of Help.
ht: Nou pral fè yon paj fre nan reStructuredText. Li pa pral nan premye dwe konekte nan endèks la, oswa sa paj, nan Èd.

source: Open a new file in any text editor.
ht: Louvri yon dosye nouvo nan nenpòt editè tèks.

source: Save the file with the name ``my_first.rst`` in ``~/help-activity/source``. Type some text onto the page. In order to give the page a title we put a line of "=" "equal" signs above and below the title like this. Leave a line of white space, then type some text. This is an example:
ht: Sove dosye a ak non an `` my_first. rst`` nan `` ~ / èd-aktivite / source``. Tape kèk tèks sou paj la. Yo nan lòd yo bay paj la yon tit nou mete yon liy nan "=" "egal" siy pi wo a ak anba a tit la tankou sa a. Kite yon liy nan espas blan, Lè sa a, tape kèk tèks. Sa a se yon egzanp:

source: Now we want to convert our little page of text into an attractive page of Help. Open Terminal Activity (or any terminal emulator) and type,
ht: Koulye a, nou vle konvèti ti kras paj nou an nan tèks nan yon paj atire nan Èd. Open aktivite Tèminal (oswa nenpòt Emulation tèminal) ak kalite,

source: There will be about ten lines of output, there will be mention of errors. Read the error trace, expect to see an error line like the one below, but the final two lines here report a success.
ht: Li pral fè sou dis liy nan pwodiksyon, pral gen mansyone nan erè. Li tras la erè, espere wè yon liy erè tankou yonn ki anba la a, men de liy yo final isit la rapòte yon siksè.

source: The warning, "WARNING: document isn't included in any toctree" is telling us the document is not linked into the Help index yet.
ht: Avètisman an, "AVÈTISMAN: dokiman pa enkli nan nenpòt ki toctree" ap di nou dokiman an se pa sa lye nan endèks la Ede ankò.

source: Tutorial 2 will fix this. It does exist and you could see what it looks like if you can find it as described above with a browser in ``~/help-activity/html``.
ht: Tutorial 2 pral ranje sa a. Li egziste ak ou te kapab wè sa li sanble si ou ka jwenn li jan sa dekri pi wo a ak yon navigatè nan `` ~ / èd-aktivite / html``.

source: Tutorial 2 - Link page to index
ht: Tutorial 2 - paj Link to endèks

source: Backup your index file. Open Terminal Activity (or any terminal emulator) and type,
ht: Backup dosye endèks ou. Open aktivite Tèminal (oswa nenpòt Emulation tèminal) ak kalite,

source: Above, we have changed directory into help-activity, changed directory into source, and copied ``index.rst`` to a new file named ``index.rst.ori``
ht: Pi wo pase, nou te chanje anyè nan èd-aktivite, chanje anyè nan sous, ak kopye `` endèks. rst`` nan yon dosye nouvo rele `` endèks. RST. ori``

source: Before proceeding make sure you are familiar with how to restore your index from the backup, in case you damage your Help index.
ht: Anvan pwosedi asire w ke ou yo abitye avèk ki jan retabli endèks ou a soti nan backup la, nan ka ou fè dega nan endèks èd ou.

source: Open ``~/help-activity/source/index.rst`` with a text editor. Notice the line spacing (lines of white space especially) and indents. They are very important to maintain.
ht: Open `` ~ / èd-aktivite / sous / endèks. rst`` ak yon editè tèks. Avi espas la liy (liy nan espas blan sitou) ak tire. Yo se trè enpòtan yo kenbe.

source: Scroll down ``index.rst`` right to the bottom of the page. Put the cursor at the front of the last line. Using the arrow keys you will see that the indent is 4 "spaces", it is not "Tab".
ht: Scroll down `` endèks. rst`` dwa anba a nan paj la. Mete kurseur la an de sou devan liy ki sot pase. Lè l sèvi avèk kle yo flèch ou pral wè ke indent a se 4 "espas", li se pa "Tab".

source: Put the cursor at the end of the last line. Press *Enter*, press space bar 4 times, and enter the file name you used above ``my_page.rst``. Use "Enter" and the space bar so that you exactly copy the indentation, and line spacing as used in the other entries.
ht: Mete kurseur la nan fen liy ki sot pase. Press * Antre *, peze espas bar 4 fwa, ak antre nan non an dosye ou te itilize pi wo a `` my_page. rst``. Sèvi ak "Antre nan" ak bar nan espas pou ke ou egzakteman kopi dekoupaj an, ak espas liy kòm yo itilize nan lòt antre yo.

source: Double check your changes to ``index.rst`` and save your changes.
ht: Double tcheke chanjman ou a `` endèks. rst`` epi sove chanjman ou.

source: Now we want to convert our index into HTML. Open Terminal Activity (or any terminal emulator) and type,
ht: Koulye a, nou vle konvèti endèks nou an, nan HTML. Open aktivite Tèminal (oswa nenpòt Emulation tèminal) ak kalite,

source: The newly changed index page will now display in Help, or in your browser, once you reload the page. In Sugar you click with the secondary button, and select reload, or in a browser pointing to ``~/help-activity/html/index.html`` press the reload button. In the index, or contents page, the link to your new page can be clicked to open your page "my_page.html"
ht: Paj la endèks ki fèk chanje pral kounye a montre nan èd, oswa nan navigatè ou a, yon fwa ou Reload paj la. Nan Sugar ou klike ak bouton an segondè, epi chwazi Reload, oswa nan yon navigatè montre nan `` ~ / èd-aktivite / html / endèks. html`` peze bouton an Reload. Nan endèks la, oswa sa paj, ka lyen ki nan nouvo paj ou dwe klike yo louvri paj ou "my_page. html "

source: Tutorial 3 - Adding an image
ht: Tutorial 3 - Ajoute yon imaj

source: Open your existing page in any text editor, or create and "Title" a new page, and add it to the bottom of the index.
ht: Louvri paj ki egziste deja ou nan nenpòt editè tèks, oswa kreye ak "Tit" yon paj nouvo, epi ajoute li sou anba a nan endèks la.

source: An image which is already in ``~/help-activity/images/`` can be included by typing this on to your page.
ht: Yon imaj ki se deja nan `` ~ / èd-aktivite / images / `` ka enkli pa sezisman sa a sou paj ou.

source: The "reference line" above needs a line of white space, above and below it.
ht: "Liy nan referans" pi wo a bezwen yon liy nan espas blan, pi wo a ak anba a li.

source: You can add an image file in .jpg or .png format to ``~/help-activity/images/``. It is best if the image does not exceed 800 pixels in width. It can be difficult to read around tall images. For this reason screen-shots 600 pixels in width may be a good compromise if the content is simple.
ht: Ou kapab ajoute yon dosye imaj nan. jpg oswa. fòma png `` ~ / èd-aktivite / images / ``. Li pi bon si imaj la pa gen dwa depase 800 piksèl nan lajè. Li ka difisil li imaj alantou wotè. Pou rezon sa a ekran-vaksen 600 piksèl nan lajè pouvwa gen yon konpwomi bon si kontni an se senp.

source: If you add an image file ``my_image.png``, made in, say, Paint to ``~/help-activity/images/``, then you link it into your page with:
ht: Si ou ajoute yon dosye imaj `` my_image. png``, te fè nan, di, Penti `` ~ / èd-aktivite / images / ``, lè sa a ou konekte li nan paj ou ak:

source: Now we want to convert our page with an image into HTML. Open Terminal Activity (or any terminal emulator) and type,
ht: Koulye a, nou vle konvèti paj nou an ak yon imaj nan HTML. Open aktivite Tèminal (oswa nenpòt Emulation tèminal) ak kalite,

source: The newly changed page will now display in Help, or in your browser, once you reload the page.
ht: Paj la ki fèk chanje pral kounye a montre nan èd, oswa nan navigatè ou a, yon fwa ou Reload paj la.

source: Tutorial 4 - Write or improve a Help page
ht: Tutorial 4 - Ekri oswa amelyore yon paj Èd

source: Decide whether you want to make a page from a fresh start, you could just start writing on a subject you know about. Alternatively experiment with improving an existing page. You could work from the text of an existing page (it might be this page) or a more simple page.
ht: Deside si ou vle fè yon paj soti nan yon kòmanse fre, ou ta ka jis kòmanse ekri sou yon sijè ou konnen sou. Altènativman eksperyans ak amelyore yon paj ki deja egziste. Ou te kapab travay nan tèks la nan yon paj ki deja egziste (li ta kapab paj sa a) oswa yon paj plis senp.

source: Open ``~/help-activity/source/index.rst``.
ht: Open `` ~ / èd-aktivite / sous / endèks. rst``.

source: Put the cursor at the end of the last line. Press *Enter*, press space bar 4 times, and enter a new file name, perhaps, ``my_second.rst``. Use "Enter" and the space bar so that you exactly copy the indentation, and line spacing as used in the other entries.
ht: Mete kurseur la nan fen liy ki sot pase. Press * Antre *, peze espas bar 4 fwa, ak antre nan yon nouvo non dosye, petèt, `` my_second. rst``. Sèvi ak "Antre nan" ak bar nan espas pou ke ou egzakteman kopi dekoupaj an, ak espas liy kòm yo itilize nan lòt antre yo.

source: Save the page as the new file name chosen above, perhaps, ``my_second.rst``.
ht: Save paj an kòm non an dosye nouvo chwazi pi wo a, petèt, `` my_second. rst``.

source: Type in a title like this:
ht: Tape nan yon tit tankou sa a:

source: Enter your text, and save your changes.
ht: Antre nan tèks ou a, epi sove chanjman ou.

source: Now we want to convert our page into HTML. Open Terminal Activity (or any terminal emulator) and type,
ht: Koulye a, nou vle konvèti paj nou an, nan HTML. Open aktivite Tèminal (oswa nenpòt Emulation tèminal) ak kalite,

source: The newly generated page will now display in Help, or in your browser, once you reload the page.
ht: Paj la ki fèk pwodwi pral kounye a montre nan èd, oswa nan navigatè ou a, yon fwa ou Reload paj la.

source: You can now go back to your page, and improve it.
ht: Ou kapab kounye a ale tounen nan paj ou a, ak amelyore li.

source: Again, write the changes to HTML version, with:
ht: Yon fwa ankò, ekri chanjman yo nan HTML vèsyon, ak:

source: You have now written your first improved page for the Activity Help. We would love it if you could share it with the Sugar community!
ht: Ou gen kounye a ekri amelyore premye paj ou pou Èd nan aktivite. Nou ta renmen li si ou ta ka pataje li avèk kominote a Sugar!

source: Contribute
ht: Kontribye

source: Once you are familiar with editing, adding a page, and making or improving a Help page, you could make a page with the intention of having it published in the next version of Help.
ht: Yon fwa ou yo abitye avèk koreksyon, pandan l ajoute yon paj, ak fè oswa amelyore yon paj èd, ou te kapab fè yon paj ak entansyon an nan gen li ki te pibliye nan vèsyon an pwochen nan Èd.

source: You might write a tutorial on a subject you know about.
ht: Ou ta ka ekri yon leson patikilye sou yon sijè ou konnen sou.

source: In the next version of Activity Help, better "New to Sugar" pages might be included at the beginning of Help, as a quick introduction for new Sugar learners. Contributions to be considered would be welcome.
ht: Nan vèsyon an pwochen nan Èd pou Aktivite, pi bon "Nouvo nan Sugar" paj ta ka enkli nan kòmansman an nan èd, kòm yon entwodiksyon rapid pou nouvo elèv k ap aprann Sugar. Kontribisyon yo dwe konsidere kòm ta dwe akeyi.

source: Some Activities have no easy to find instructions. If you can write even a very short introduction, it could be very useful for other Sugar learners.
ht: Gen kèk Aktivite pa gen okenn fasil jwenn enstriksyon. Si ou ka ekri menm yon entwodiksyon trè kout, li te kapab fè trè itil pou lòt Sugar elèv k ap aprann.

source: The Sugarlabs wiki page http://wiki.sugarlabs.org/go/Activities/Help/Contribute might have some ideas on pages, which have been requested, or which others are working on and might appreciate collaboration.
ht: Http la Sugarlabs paj wiki: // wiki. sugarlabs. org / ale / Aktivite / Èd / Kontribye ka gen kèk ide nan paj, ki te mande, oswa ki lòt moun yo ap travay sou yo ak sou ta ka apresye kolaborasyon.

source: What to do with your finished work
ht: Ki sa ki fè ak travay ou fini
