Repository: tony37/sledhelp
Catalog: translated_po/ht/how_to_volunteer.po
Languages: ht

source: How to volunteer
ht: Ki jan yo sèvi kòm volontè

source: Volunteers Change the World
ht: Volontè chanje mond lan

source: Join us in our global mission to improve education for the world's children! Volunteer contribution is central to the educational spirit of OLPC. The ways to volunteer are as varied as your interests. The sections that follow provide information to learn how to become a volunteer, based on your interests and background.
ht: Join nou nan misyon mondyal nou an amelyore edikasyon pou timoun nan mond lan! Kontribisyon volontè se pwen santral nan Lespri Bondye a edikasyon nan OLPC. Fason yo volontè yo jan varye kòm enterè ou. Seksyon yo ki swiv bay enfòmasyon pou aprann kijan pou vin yon volontè, ki baze sou enterè ou ak background.

source: If learning matters to you, you will be welcome. To directly get involved, visit the web site http://olpcMAP.net or email volunteer@laptop.org.
ht: Si zafè ou aprann, ou yo pral akeyi. Dirèkteman patisipe, vizite http sit entènèt la: // olpcMAP. net oswa voye yon imèl volontè @ laptop. org.

source: Finally, know that there are LOTS of fun, cool people out in the world who'd like to work and play together with you as contributors, to help spread our mission and to improve children's lives.
ht: Finalman, konnen ke gen anpil plezi, moun fre soti nan mond lan ki ta renmen travay ak jwe ansanm avèk ou kòm kontribye, ede gaye misyon nou ak amelyore lavi timoun yo.

source: Kids, siblings, and parents
ht: Kids, frè ak sè, ak paran

source: The XO is meant for the entire family to use, so learning as much as you can to help each other learn is one way to volunteer with (and for) other OLPC learners worldwide.
ht: Se XO a vle di pou tout fanmi an yo sèvi ak, se konsa aprann kòm anpil jan ou kapab ede chak lòt aprann se yon fason yo sèvi kòm volontè ak (ak pou) lòt elèv k ap aprann OLPC atravè lemond.

source: You can contribute to the wiki, a web site that you can edit, at http://wiki.laptop.org to share your knowledge and XO laptop experience.
ht: Ou ka kontribye nan wiki a, yon sit entènèt ki ou ka edit, nan http: // wiki. laptop. org nan pataje eksperyans konesans ak XO laptop ou.

source: You can tell others about your projects and recruit others to join your efforts. To understand how easy it is to edit the wiki, go to http://wiki.laptop.org/go/Wiki_getting_started.
ht: Ou ka di lòt moun sou pwojè ou ak rekrite lòt moun yo rantre nan efò ou. Pou konprann ki jan li fasil se edite wiki a, ale nan http: // wiki. laptop. org / ale / Wiki_getting_started.

source: You might want to get involved in a regional group with other XO owners in your area. You can find many such vibrant communities at http://wiki.laptop.org/go/Regional_community_groups.
ht: Ou ta ka vle patisipe nan yon gwoup rejyonal ak mèt pwopriyete lòt XO nan zòn ou an. Ou ka jwenn anpil kominote sa yo vanyan nan http: // wiki. laptop. org / ale / Regional_community_groups.

source: Teachers, students, and educators
ht: Pwofesè, elèv, ak edikatè

source: The OLPC project is an education project above all else, so your contributions are highly valued. You can contribute by testing, developing content, mentoring, or running group activities. You can start a University chapter of OLPC users -- both formal Community Service Learning and great informal clubs exist. Details may be found at wiki.laptop.org/go/University_program.
ht: Pwojè a OLPC se yon pwojè edikasyon pi wo a tout lòt bagay, se konsa kontribisyon ou yo bay plis enpòtans. Ou kapab kontribye pa tès, devlope kontni, mentoring, oswa kouri aktivite an gwoup. Ou ka kòmanse yon chapit University of itilizatè OLPC - tou de aprantisaj sèvis fòmèl Kominote ak gwo klib enfòmèl egziste. Detay yo ka jwenn nan wiki. laptop. org / ale / University_program.

source: You can try to meet with other teachers and students within your geographic region, or look up pre-existing groups within the list of regional groups here: http://wiki.laptop.org/go/Groups.
ht: Ou ka eseye rankontre ak lòt pwofesè yo ak elèv yo nan rejyon jeyografik ou a, oswa gade moute pre-egziste ki gwoup nan lis la nan gwoup rejyonal la a: http: // wiki. laptop. org / ale / Gwoup.

source: Support Gang
ht: Gang Sipò

source: If you enjoy personally helping others, and the challenge of solving problems with learners worldwide, you would be a perfect fit for the Support Gang. We work together answering all kinds of questions about the XO, peripherals, software, volunteering, deployment, organizational development and anything else OLPC users ask about.
ht: Si ou jwi pèsonèlman ede lòt moun, ak defi a nan rezoud pwoblèm ak elèv k ap aprann atravè lemond, ou ta dwe yon anfòm pafè pou gang nan Sipò. Nou travay ansanm reponn tout kalite kesyon sou XO a, periferik, lojisyèl, Volontè, deplwaman, devlopman òganizasyonèl ak nenpòt lòt bagay itilizatè OLPC mande enfòmasyon sou.

source: Community Support Volunteers are an extremely friendly and supportive group, who came together from all around the world, and work together closely online. We also meet weekly with invited guest speakers by phone, and in person whenever possible.
ht: Kominote Volontè Sipò se yon gwoup trè zanmitay ak sipò, ki moun ki te vin ansanm ki sòti nan tout atravè mond lan, e travay ansanm byen sou entènèt. Nou menm tou nou rankontre chak semèn ak envite oratè envite pa telefòn, ak nan moun nenpòt lè li posib.

source: When you volunteer, fellow volunteers and OLPC will help you get started and assist you in finding answers to difficult or unusual technical questions. Bilingual volunteers are most especially welcome. Please join us at http://wiki.laptop.org/go/Support_Gang.
ht: Lè ou sèvi kòm volontè, volontè parèy ak OLPC pral ede w jwenn te kòmanse ak ede w nan jwenn repons a kesyon teknik difisil oswa etranj. Volontè Bileng yo ki pi espesyalman akeyi. Souple jwenn nou nan http: // wiki. laptop. org / ale / Support_Gang.

source: Documentation
ht: Dokimantasyon

source: If you would like to help others learn about the XO then you can help with the documentation. We have a dedicated team and we eagerly welcome new contributors! You don't need to be a expert on the technology to participate - you may wish to just spell check or check images. You may also be inspired to write a chapter or improve existing chapters. You can learn more on how to contribute by joining the OLPC Library mailing list http://lists.laptop.org/listinfo/library
ht: Si ou ta renmen ede lòt moun aprann sou XO a lè sa a ou ka ede ak dokiman an. Nou gen yon ekip dedye ak nou prese akeyi nouvo kontribye! Ou pa bezwen yo dwe yon ekspè sou teknoloji a yo patisipe - ou ka vle jis eple tcheke oswa tcheke imaj. Ou kapab tou gen pou enspire yo ekri yon chapit oswa amelyore ki deja egziste chapit. Ou ka aprann plis sou kòman yo kontribye nan vini patisipe nan OLPC Bibliyotèk poste http a lis: // lis. laptop. org / listenfo / bibliyotèk

source: Existing XO and Sugar manuals are written and hosted at FLOSS Manuals.
ht: Ki deja egziste XO ak Sugar manyèl yo ekri ak anime nan Manuals itilize fil dantè.

source: Translators
ht: Tradiktè

source: OLPC is a world-wide program that tries to reach people in many countries, who speak many different languages. You can get an idea of the program and look for your languages on the Sugar Labs translation server. If you speak and write more than one language, you can help translate the wiki or the software. If you can help, please see http://wiki.laptop.org/go/Translation.
ht: OLPC se yon pwogram mond-lajè ki ap eseye rive jwenn moun nan anpil peyi, ki pale plizyè lang diferan. Ou ka jwenn yon lide sou pwogram nan epi gade pou lang ou sou sèvè a tradiksyon Sugar Labs. Si ou pale ak ekri plis pase yon lang, ou ka ede tradui wiki a oswa lojisyèl an. Si ou ka ede, tanpri al gade http: // wiki. laptop. org / ale / Tradiksyon.

source: Content creators, writers, artists, photographers, videographers
ht: Content créateur, ekriven, atis, fotogwaf, videyografè

source: Everyone is a creator: by creating and sharing something, you inevitably understand it better. Writing about the XO can also be one of the greatest contributions to helping others.
ht: Tout moun se yon kreyatè: pa kreye ak pataje yon bagay, ou inevitableman konprann li pi byen. Ekri sou XO a kapab tou gen pou youn nan pi gwo kontribisyon yo nan ede lòt moun.

source: Please consider offering your communications or media talents on the OLPC Wiki - whether by writing, designing, editing, storytelling or simply organizing - anywhere within http://wiki.laptop.org.
ht: Tanpri konsidere ofri kominikasyon ou a oswa medya talan sou OLPC Wiki a - si wi ou non pa ekri, desine, koreksyon, rakonte istwa oswa tou senpleman òganize - nenpòt kote nan http: // wiki. laptop. org.

source: If you want to create art for the XO, you can join other artists at the Art Community page at http://wiki.laptop.org/go/Community:Art.
ht: Si ou vle kreye atizay pou XO a, ou ka rantre nan lòt atis nan paj la Atizay Kominote nan http: // wiki. laptop. org / ale / Kominote: Art.

source: You can upload photos to a great, growing worldwide archive at http://www.flickr.com/groups/olpc. One group of photos even shows those specially taken by XO laptops themselves, using the Record Activity. Hardware designers and testers
ht: Ou ka Upload foto nan yon gwo, k ap grandi atravè lemond achiv nan http: // www. flickr. com / gwoup / OLPC. Yon gwoup nan foto menm montre moun espesyalman pran pa XO laptops tèt yo, lè l sèvi avèk aktivite nan Dosye. Konsèpteur Materyèl ak Tester

source: There are lots of volunteer hardware opportunities, from brainstorming about alternative power to developing peripherals to repairing XOs. You may want to develop peripherals for the XO that use its USB ports or other inputs, for health applications or beyond: http://wiki.laptop.org/go/Health.
ht: Gen anpil bagay nan opòtinite kenkayri volontè, ki soti nan brase lide sou pouvwa altènativ a devlope periferik repare XO. Ou ka vle devlope periferik pou XO a ki itilize pò USB li yo oswa lòt entrain, pou aplikasyon pou sante oswa pi lwen pase: http: // wiki. laptop. org / ale / Sante.

source: You can get involved with community repair centers or start your own, with volunteers or as a business: http://wiki.laptop.org/go/Repair_center_locations.
ht: Ou ka jwenn ki patisipe nan sant reparasyon kominote oswa kòmanse pwòp ou a, ak volontè oswa kòm yon biznis: http: // wiki. laptop. org / ale / Repair_center_locations.

source: You may want to work on power generation: http://lists.laptop.org/listinfo/power. Or firmware coding: http://wiki.laptop.org/go/OFW. To find out more about all of these types of hardware projects search for those keywords at: http://wiki.laptop.org/go/Category:Hardware.
ht: Ou ka vle travay sou pouvwa jenerasyon: http: // lis. laptop. org / listenfo / pouvwa. Oswa firmwèr kodaj: http: // wiki. laptop. com / ale / OFW. Pou chèche konnen plis sou tout nan sa yo kalite pwojè kenkayri rechèch pou mo kle sa yo ki nan: http: // wiki. laptop. org / ale / Kategori: Materyèl.

source: Software Developers especially should connect with Sugar Labs: http://join.sugarlabs.org
ht: Software Devlopè espesyalman ta dwe konekte ak Sugar Labs: http: // rantre nan. sugarlabs. org

source: The XO's software is designed to be malleable because we want the help of all the people in the world who are capable of writing free software to help other people learn. To get involved, you can:
ht: Se lojisyèl XO a fèt yo dwe pèrmeabl paske nou vle èd nan tout moun ki nan mond lan ki gen kapasite pou ekri lojisyèl gratis yo ede lòt moun aprann. Pou jwenn patisipe, ou kapab:

source: Write activities http://wiki.sugarlabs.org/go/Activity_Team.
ht: Ekri aktivite http: // wiki. sugarlabs. org / ale / Activity_Team.

source: Fix, report, or triage bugs http://bugs.sugarlabs.org and http://dev.laptop.org.
ht: Ranje, pinèz rapò, oswa triyaj http: // pinèz. sugarlabs. org ak http: // dev. laptop. org.

source: Help test http://wiki.laptop.org/go/Friends_in_testing.
ht: Ede http tès: // wiki. laptop. org / ale / Friends_in_testing.

source: Hack Sugar and our OS http://wiki.laptop.org/go/Developers_manual.
ht: Hack Sik ak http OS nou an: // wiki. laptop. org / ale / Developers_manual.

source: In short: "patches are welcome".
ht: Nan ti bout tan: "plak yo se akeyi".

source: Local opportunities
ht: Opòtinite lokal

source: Help create changes in the community you live in - as well as ones you'd like to visit. Start or join a grassroots group: http://wiki.laptop.org/go/Groups.
ht: Ede kreye chanjman ki fèt nan kominote a ou ap viv nan - kòm byen ke yo menm ou ta renmen vizite. Kòmanse oswa rantre nan yon gwoup de baz: http: // wiki. laptop. org / ale / Gwoup.

source: Create a Community Repair Center: http://wiki.laptop.org/go/Repair_center_locations.
ht: Kreye yon Kominote Reparasyon Sant: http: // wiki. laptop. org / ale / Repair_center_locations.

source: Help out at a nearby Pilot deployment: http://planet.laptop.org.
ht: Ede soti nan yon ki tou pre deplwaman Pilot: http: // planèt. laptop. org.

source: Run, host, or attend an Event or Jam: http://olpcMAP.net.
ht: Kouri, lame, oswa ale nan yon evènman oswa JAS: http: // olpcMAP. net.

source: Deployment
ht: Deplwaman

source: Volunteering at an OLPC deployment or school of any size is sometimes possible, in exceptional cases: http://wiki.laptop.org/go/ClassActs/Resources
ht: Ofri sèvis kòm volontè nan yon deplwaman OLPC oswa lekòl nan nenpòt ki gwosè se pafwa posib, nan ka eksepsyonèl: http: // wiki. laptop. org / ale / ClassActs / Resous

source: Volunteers working on their own much smaller deployments, work together leveraging their mutual insights: http://wiki.laptop.org/go/ALEARN_Network
ht: Volontè ap travay sou pwòp pi piti anpil deplwaman yo, travay ansanm pou jwenn Sur mityèl yo: http: // wiki. laptop. org / ale / ALEARN_Network

source: A great way to get started is to explore others' work at http://planet.laptop.org and then email your specific interests and qualifications to: mailto:volunteer@laptop.org
ht: Yon bon fason jwenn te kòmanse se yo eksplore travay lòt moun nan http: // planèt. laptop. org ak Lè sa a voye yon imèl ba enterè espesifik ou ak kalifikasyon nan: mailto: volontè @ laptop. org

source: Annual Community Summits
ht: Anyèl Somè Kominote

source: Nothing beats meeting in person, and the OLPC community's biggest annual summit occurs in October in San Francisco, thanks to: http://olpcSF.org.
ht: Pa gen anyen bat reyinyon nan moun, ak pi gwo somè anyèl kominote a OLPC a rive nan mwa Oktòb nan San Francisco, gras a: http: // olpcSF. org.

source: Similarly a more technical spring summit generally takes plan around May in Montevideo, Uruguay: http://ceibalJAM.org.
ht: Menm jan an tou yon somè sezon prentan plis teknik jeneralman pran plan alantou Me nan Montevideo, Irigwe: http: // ceibalJAM. org.

source: Conclusions
ht: Konklizyon

source: We weren't kidding when we told you that we accept volunteer contributions of all shapes, sizes, and kinds. Would you enjoy making presents for millions of children every day? Can you help?
ht: Nou pa te plèzantri lè nou di ou ke nou aksepte kontribisyon volontè nan tout fòm, gwosè, ak kalite. Èske ou ta renmen fè kado pou dè milyon de timoun chak jou? Èske ou ka ede?
