Repository: tony37/sledhelp
Catalog: translated_po/ht/index.po
Languages: ht

source: Welcome to Sugar's documentation!
ht: Byenveni nan dokiman Sugar a!

source: Using Sugar
ht: Lè l sèvi avèk sik

source: Using Activities
ht: Lè l sèvi avèk Aktivite

source: Activities
ht: Aktivite

source: Network
ht: Rezo

source: The XO hardware
ht: Pyès ki nan konpitè XO

source: About this manual
ht: Sou manyèl sa a

source: Contribute to this manual
ht: Kontribye nan manyèl sa a

source: Support
ht: Sipò

source: Appendices
ht: Dokiman Siplemantè
