Repository: tony37/sledhelp
Catalog: translated_po/ht/intro17.po
Languages: ht

source: Introduction to XO Help 17
ht: Entwodiksyon nan XO Ede 17

source: Welcome to a new look in XO Help 17.
ht: Byenveni nan yon gade nouvo nan XO Ede 17.

source: If you are starting with an XO laptop you might jump straight to the top of the "Hardware section" :doc:`/getting_started`.
ht: Si w ap kòmanse ak yon laptop XO ou ta ka sote dwat nan tèt la nan "seksyon an Materyèl": doc: `/ getting_started`.

source: When you press the "next" link at the top right of this page you will move on to the page, The Sugar User Interface. To a new user this is a somethat theoretical page, but the **following** few pages covering navigation are more new user friendly and important for all new users.
ht: Lè ou peze "Next" lyen ki sou bò dwat nan tèt nan paj sa aw ap deplase sou li nan paj la, Itilizatè Entèfas a Sugar. Nan yon itilizatè nouvo sa a se yon paj teyorik somethat, men ** yo ** paj sa yo kèk ki kouvri navigasyon yo gen plis nouvo itilizatè zanmitay ak enpòtan pou tout nouvo itilizatè.

source: The Activity you are using, Help, has its own :doc:`/help` page. Help will display, the pages in the index, plus (when you are online) pages linked to the internet.
ht: Aktivite an w ap itilize, èd, gen pwòp li yo: doc: `/ paj help`. Ede ap montre, paj sa yo nan endèks la, plis (lè ou se sou entènèt) paj lye nan entènèt la.

source: In Help use the "Back" button |Back| to return to the previous page, and the "Home" button |Home| to return to :doc:`/index`
ht: Nan Èd sèvi ak bouton an "Retounen" | Retounen | pou li retounen nan paj anvan-an, ak "Kay" bouton | Kay la | pou li retounen nan: doc: `/ index`

source: Activities are listed in alphabetical order, starting with :doc:`/browse`.
ht: Aktivite yo ki nan lis nan lòd alfabetik, kòmanse ak: doc: `/ browse`.

source: The section of the table of Contents, Network, starts with the page :doc:`/give_me_the_internet`
ht: Seksyon an nan tablo a of Contents, Rezo, kòmanse ak paj: doc la: `/ give_me_the_internet`

source: In Help pages, the green arrow |more| is used to signify moving to material at a deeper level.
ht: Nan Ede paj, flèch la vèt | plis | se sèvi ak siyifi deplase ou nan materyèl nan yon nivo pi fon.

source: This is an experimental new page. You can improve it yourself by following :doc:`/how_to_help`.
ht: Sa a se yon paj nouvo eksperimantal. Ou ka amelyore li tèt ou pa yo: doc: `/ how_to_help`.
