Repository: tony37/sledhelp
Catalog: translated_po/ht/irc.po
Languages: ht

source: IRC
ht: Ir

source: About
ht: Sou

source: |IRC_icon| The IRC activity allows you to chat with other Sugar/OLPC users and enthusiasts on the Internet via Internet Relay Chat (IRC).
ht: | IRC_icon | Aktivite a ir pèmèt ou chat ak lòt / itilizatè OLPC Sugar ak amater sou entènèt la sou Entènèt Relay Chat (ir).

source: The activity defaults to a "channel" (akin to a "room") called #sugar on the Freenode network, but you can join one of the many channels available by typing /join #channel, where #channel is the channel name. Like many Free/Open Source projects, Sugar developers frequent this channel, and are happy to help with any Sugar questions and suggestions you may have.
ht: Défaut yo aktivite nan yon "channel" (analogue nan yon "sal") rele #sugar sou rezo a frinod, men ou ka rantre nan youn nan kanal yo anpil ki disponib pa sezisman / rantre nan #channel, kote #channel se non an chanèl. Tankou anpil gratis pwojè Sous / Open, devlopè Sugar souvan sa a chanèl, epi yo kontan ede avèk nenpòt kesyon Sugar ak sijesyon ou ka genyen.

source: See the Internet Relay Chat page on `this wiki <http://wiki.sugarlabs.org/go/Internet_Relay_Chat>`_ for a list of Sugar-related channels you can join.
ht: Wè paj la Chat entènèt Relay sou `wiki sa a <http: // wiki. sugarlabs. org / ale / Internet_Relay_Chat> `_ pou yon lis chanèl ki gen rapò ak Sugar ou ka rantre nan.

source: Using IRC
ht: Lè l sèvi avèk ir

source: IRC Commands
ht: Ir Kòmand

source: The following commands can be typed into the input box, all preceded by a slash (/):
ht: Kòmandman sa yo ka tape nan ti bwat la opinyon yo, tout anvan pa yon koupe (/):

source: /join #channel - join a channel
ht: / Rantre nan #channel - rantre nan yon kanal

source: /server irc.example.org - connect to a different network
ht: / Sèvè ir. egzanp. org - konekte nan yon rezo diferan

source: /query user - open up a private chat window with another user
ht: / Query itilizatè - louvri moute yon fenèt chat prive ak yon lòt itilizatè

source: /msg user message - privately message another user without opening a new window
ht: / Msg itilizatè mesaj - prive mesaj yon lòt itilizatè san yo pa louvri yon lòt fenèt

source: /nick new_name - change your nickname away from the default
ht: / Nick new_name - chanje tinon ou lwen default la

source: Many other commands are available, and you can create and administer your own channels as well: see the `IRC FAQ <http://www.irchelp.org/irchelp/altircfaq.html>`_ for more information.
ht: Anpil lòt kòmandman ki disponib, epi ou ka kreye epi administre chanèl pwòp ou a kòm byen: wè `ir FAQ la <http: // www. irchelp. org / irchelp / altircfaq. html> `_ pou plis enfòmasyon.

source: `ASLO IRC <http://activities.sugarlabs.org/sugar/addon/4029>`_
ht: `Aslo ir <http: // aktivite. sugarlabs. org / sik / addon / 4029> `_

source: Development
ht: Devlopman

source: `Git Repository <http://git.sugarlabs.org/projects/irc>`_
ht: `Ale referansyèl <http: // Ale. sugarlabs. org / pwojè / ir> `_

source: References
ht: Referans

source: `Wiki Page <http://wiki.sugarlabs.org/go/Activities/IRC>`_
ht: `Wiki Page <http: // wiki. sugarlabs. org / ale / Aktivite / ir> `_
