Repository: tony37/sledhelp
Catalog: translated_po/ht/journal.po
Languages: ht

source: The Journal Activity is an automated diary of everything you do within Sugar. Sugar Activities use the Journal as a place to save your work. You can use the Journal as a place to revisit old work, to resume incomplete work, to organize your completed work, and to reflect upon your progress as a learner.
ht: Journal aktivite a se yon jounal pèsonèl otomatik nan tout sa ou fè nan Sugar. Sugar Aktivite itilize jounal la kòm yon plas pou konsève pou travay ou. Ou kapab sèvi ak jounal la kòm yon kote yo revize travay fin vye granmoun, reprann travay enkonplè, yo òganize ranpli travay ou a, ansanm ak reflechi sou pwogrè ou kòm yon elèv k ap aprann.

source: The Journal keeps a record of what you do and the things your create such as photos, drawings, and writings. You can search for items in the Journal or sort entries by type or date. You can also click an entry to get a detailed view. You can resume an activity by clicking on the icon for that entry.
ht: Journal la kenbe yon dosye sou sa ou fè ak bagay sa yo ou kreye tankou foto, desen, ak ekri. Ou kapab fè rechèch pou atik nan jounal la oswa sòt antre pa tip oswa dat. Ou kapab tou klike sou yon antre yo ka resevwa yon View detaye. Ou ka rezime yon aktivite pa klike sou icon nan pou ke antre.

source: The Journal also supports external storage media such as a USB device or a SD card. When you plug a USB device into the XO, you can access the contents of the USB device using the Journal. Click the USB icon to see the content on an attached USB storage device. You can also copy information from the Journal onto removable media—such as a USB device—as a means of backing it up. If you are connected to a school server, you can access its backup system.
ht: Jounal nan sipòte tou medya depo ekstèn tankou yon aparèy USB oswa yon kat SD. Lè ou ploge yon aparèy USB nan XO a, ou kapab jwenn aksè nan sa ki nan aparèy la lè l sèvi avèk USB Journal la. Klike sou ikòn nan USB yo wè kontni an sou yon aparèy depo USB tache. Si ou yo ki konekte nan yon sèvè lekòl la, ou kapab jwenn aksè nan sistèm backup li yo.

source: Accessing the Journal
ht: Antre nan Journal la

source: To show the Journal, click the Journal icon on the Frame.
ht: Pou montre Journal la, klike sou ikòn a Journal sou ankadreman an.

source: On an XO laptop, you can press the magnifying glass key in the top row of the keyboard to immediately open the Journal and search.
ht: Sou yon laptop XO, ou ka peze kle a loup nan ranje nan tèt nan klavye la imedyatman louvri Journal la ak rechèch.

source: |journal| **Seen in an Activity**, this icon on the Activity toolbar (or Activity tab) allows quick access to the Journal, to add a description, or further notes to yourself about what you are going to do, or have done in that session of the Activity.
ht: | Jounal | ** Wè nan yon aktivite **, icon sa a sou ba zouti a (aktivite oswa tab aktivite) pèmèt aksè rapid nan Journal la, yo ajoute yon deskripsyon, oswa plis nòt nan tèt ou sou sa w ap pral fè, oswa ki gen fè nan ki sesyon nan aktivite a.

source: Journal features
ht: Journal karakteristik

source: The Journal View contains a menu and a list of journal entries:
ht: Journal View la gen yon meni ak yon lis antre jounal:

source: 1 - Favorite star: You can mark important entries by clicking on the star icon for that entry. When you click the star icon, the star is colored in.
ht: 1 - Favorite zetwal: Ou ka make antre enpòtan pa klike sou icon nan zetwal pou sa antre. Lè ou klike sou ikòn etwal, se zetwal la ki gen koulè nan.

source: 2 - Entry icon: Each Journal entry has an icon. The color of the icon shows who created the entry. For example, if you copy a photo from a friend, the photo's icon has your friend's colors. You can launch the Activity for the entry by clicking on the icon. A hover menu may reveal additional options. In particular, "Erase" deletes that entry from your Journal. Caution: "Erase" deletes any data associated with the entry shown. For example, if you delete an entry that shows that you installed an Activity, you delete the Activity as well.
ht: 2 - icon Entry: Chak antre Journal gen yon icon. Koulè a ​​nan icon a montre ki te kreye antre nan. Pou egzanp, si ou kopye yon foto nan men yon zanmi, icon foto a la gen koulè zanmi ou a. Ou ka lanse aktivite a pou antre a pa klike sou icon nan. Yon meni hover ka revele opsyon anplis. An patikilye, "Erase" supresyon ki antre nan jounal ou. Atansyon: "Efase" supresyon nenpòt done ki asosye ak antre a montre. Pou egzanp, si ou efase yon antre ki montre ke ou enstale yon aktivite, ou efase aktivite a kòm byen.

source: 3 - Entry name: Each entry has a name. You can edit the name by clicking it. If the Journal view is showing the contents of a removable storage device, the Linux file name is shown here, with the path and the file name extension stripped off.
ht: 3 - Non Entry: Chak antre gen yon non. Ou ka edite non an pa klike li. Si gade nan Journal se ki montre sa ki nan yon aparèy depo detachable, se dosye non an Linux montre la a, ak chemen an ak ekstansyon an non dosye wete tout.

source: 4 - Search box: Type words in the box to search for entries that match those words. Entries are displayed when they contain all of the typed words. Comparison will be against all of: the entry name field, the description field (see "Journal detail view"), the comments field and the tag field (see "Journal detail view"). Note: A small x button at the right of the box shows that searching is being applied. To cancel your search, click on that x.
ht: Bwat Search - 4: Kalite mo nan ti bwat la pou fè rechèch pou antre ki koresponn ak mo sa yo. Entries yo ap parèt lè yo gen ladan tout nan mo sa yo tape. Konparezon yo pral kont tout nan: jaden an Non antre, jaden an deskripsyon (al gade "Journal detay View"), jaden an kòmantè ak jaden an tag (al gade "Journal detay View"). Remak: Yon bouton x ti sou bò dwat la nan bwat la montre ke se ke yo te aplike rechèch. Pou anile rechèch ou a, klike sou ki x.

source: 5 - Favorites view: Only shows the entries which have been marked as favorites.
ht: 5 - Favoris wè: Se sèlman montre antre yo ki te make kòm favorites.

source: 6 - Type filter: You can select to have the Journal only show certain types of entries, e.g. only images or only entries associated with a specific Activity.
ht: 6 - Kalite Filter: Ou ka chwazi yo gen jounal la sèlman montre sèten kalite antre, e. g. imaj sèlman oswa sèlman antre ki asosye avèk yon aktivite espesifik.

source: 7 - Date filter: Contains option to only show Journal entries modified within the past day, week, or month.
ht: 7 - Dat filtre: Gen opsyon yo sèlman montre Journal antre modifye nan jou ki sot pase a, semèn, oswa mwa.

source: 8 - Sorting options: You can order Journal entries by their size, creation date and modification date.
ht: 8 - Fouye opsyon: Ou kapab mande Journal antre pa gwosè, dat kreyasyon ak modifikasyon dat yo.

source: 9 - Documents folder: To exchange files between the Journal and the underlying file system the $HOME/DOCUMENTS folder is available in the Journal. For example: If you have created an image in GIMP under GNOME and want to open it in the Paint Activity you can place it in the $HOME/DOCUMENTS folder and then can access it in the Journal.
ht: 9 - Dokiman folder: Pou echanj dosye ant jounal la ak sistèm nan dosye kache $ HOME a / DOKIMAN folder a disponib nan Journal la. Pou egzanp: Si ou te kreye yon imaj nan bwateu anba luten epi ou vle louvri l 'nan aktivite nan penti ou ka mete l' nan $ HOME / DOKIMAN folder nan ak Lè sa a ka jwenn aksè li nan jounal la.

source: 10 - Buddy icons: If other participants joined you in this Activity, icons in their colors appear here.
ht: 10 - Buddy ikon: Si lòt patisipan ansanm ou nan aktivite sa a, ikon nan koulè yo parèt isit la.

source: 11 - Elapsed time: Displays the time since the most recent change to the entry.
ht: 11 - tan ki pase: Montre fwa depi chanjman an ki pi resan yo antre nan.

source: 12 - Detail view: Click this button to see detailed information about the entry. See "Journal detail view", below.
ht: 12 - Detay View: Klike sou bouton sa a yo wè enfòmasyon detaye sou antre nan. Al gade "Journal detay vi", pi ba a.

source: Journal Detail view
ht: Journal Detay View

source: The Detail view appears when you click the Detail view button for an entry. This view lets you examine and annotate the entry.
ht: View nan Detay parèt lè ou klike sou bouton an Detay View pou yon antre. Sa a wè pèmèt ou analize ak anot antre nan.

source: 1 - Back Icon: You can click anywhere in this line to return to the main Journal View.
ht: 1 - Retounen Icône: Ou kapab klike sou nenpòt kote nan liy sa a pou li retounen nan prensipal Journal View.

source: 2 - Resume Button: You can click the Resume button to resume an Activity. A hover menu may show additional options. For example, you can resume working with an image using either the Browser or the Paint Activity.
ht: 2 - Kourikouloum-vite Button: Ou ka klike sou bouton an Kourikouloum-vite kourikouloum-vite yon aktivite. Yon meni hover ka montre opsyon anplis. Pou egzanp, ou ka reprann travay ak yon imaj lè l sèvi avèk swa navigatè a oswa aktivite a Penti.

source: 3 - Copy button: You can copy a Journal entry to the clipboard (or to a removable storage device shown on the bottom edge of the Journal screen) by clicking on the Copy button.
ht: 3 - Kopi bouton: Ou ka kopye yon antre Journal nan papye a (oswa nan yon aparèy depo detachable montre sou kwen anba a nan ekran an Journal) pa klike sou bouton an Kopi.

source: 4 - Duplicate button: You can duplicate a Journal entry by clicking on the Duplicate button.
ht: 4 - Kopi bouton: Ou ka kopi yon antre Journal pa klike sou bouton an Kopi.

source: 5 - Erase button: You can erase an entry by clicking the Erase button. Caution: Once you erase an entry, it cannot be restored unless you have backed up your Journal.
ht: 5 - Efase bouton: Ou ka efase yon antre, klike sou bouton an Erase. Atansyon: Yon fwa ou efase yon antre, li pa ka dwe retabli sof si ou te apiye moute jounal ou.

source: 6 - Entry name: You can change the name of the entry by clicking it and typing in a new name.
ht: 6 - Non Entry: Ou ka chanje non an nan antre a pa klike li epi li sezisman nan yon nouvo non.

source: 7 - Elapsed time: Displays the time since the most recent change to the entry.
ht: 7 - tan ki pase: Montre fwa depi chanjman an ki pi resan yo antre nan.

source: 8 - Favorites Icon: This icon indicates whether an entry has been starred as a favorite which can be done by clicking it.
ht: 8 - Favorites Icon: icon Sa a endike si gen yon antre te joue kòm yon pi renmen ki ka fè pa klike li.

source: 9 - Thumbnail image: Each entry has a thumbnail image that is created automatically. The image show the Activity screen when the last change to the Journal entry was saved.
ht: 9 - Thumbnail imaj: Chak antre gen yon imaj thumbnail ki kreye otomatikman. Imaj la montre ekran an aktivite lè yo te chanjman ki sot pase a yo antre nan Journal sove.

source: 10 - Participants: Displays the XO icons of each person who participated in a shared Activity.
ht: 10 - Patisipan yo: Montre ikon yo XO nan chak moun ki te patisipe nan yon aktivite Pataje.

source: 11 - Comments: Comments by the joiners will be displayed here. The comments will be from Portfolio activity and from journal share.
ht: 11 - Kòmantè: Kòmantè pa menwizye yo yo pral parèt isit la. Tout kòmantè yo pral soti nan aktivite Portfolio ak pou soti nan jounal pati.

source: 12 - Tags field: You can enter search tags. Tags are keywords used to describe a journal entry so that you can find it later using the Search box. For example, if your project is for school, maybe science class, and it is a report about local flowers, you could put "science" and "flowers" as the tags. You can write as many tags as you wish. You can also use keywords to help you "group" this entry, for instance by origin or context.
ht: 12 - Tags jaden: Ou ka antre nan tags rechèch. Tags yo mo kle yo itilize a dekri yon antre jounal pou ke ou ka jwenn li pita lè l sèvi avèk ti bwat la Search. Pou egzanp, si pwojè ou a se pou lekòl, petèt klas syans, epi li se yon rapò sou flè lokal yo, ou ta ka mete "syans" ak "flè" kòm etikèt yo. Ou ka ekri kòm anpil jan ou vle Tags. Ou kapab tou itilize mo kle yo ede w "gwoup" sa a antre, pou egzanp pa orijin oswa kontèks.

source: 13 - Description field: You can type a description of the entry, which you can find later using the Search box. Use a description to remind you of what you did. For example: "Flowers I saw on the hike to the waterfall". Or you can reflect on your work and process: what I have done; how I have done it; and how successful these efforts have been. "This was not easy, but I learned a lot about different types of flowers in my community by speaking with my family". This is important because these description can be shown in the reflection Activity called "Portfolio".
ht: 13 - Deskripsyon jaden: Ou ka tape yon deskripsyon nan antre a, ki ou ka jwenn lè l sèvi avèk ti bwat la pita Search. Sèvi ak yon deskripsyon fè ou sonje nan sa ou te fè. Pou egzanp: "Flè mwen te wè sou vwayaje nan kaskad a". Oswa ou ka reflechi sou travay ou ak pwosesis: sa mwen te fè; ki jan mwen te fè li; ak ki jan siksè efò sa yo te. "Sa a te pa fasil, men mwen te aprann anpil bagay sou diferan kalite flè nan kominote mwen pa pale ak fanmi mwen". Sa a se enpòtan paske ka sa yo deskripsyon ka montre nan Aktivite nan refleksyon yo rele "Portfolio".

source: When resuming from the Detail View, you can choose among different Activities.
ht: Lè reprenan nan View Detay, ou ka chwazi nan mitan aktivite diferan.

source: Using removable media
ht: Lè l sèvi avèk medya detachable

source: Journal: Click the Journal icon to shows the Journal View.
ht: Journal: Klike sou ikòn a Journal montre Journal View.

source: Documents folder: Click the Documents icon to show the contents of
ht: Dokiman folder: Klike sou ikòn nan Dokiman yo montre sa ki nan

source: USB device: Click the USB icon (or SD icon) to show the removable-media file system.
ht: Aparèy USB: Klike sou ikòn nan USB (oswa SD icon) montre sistèm nan dosye detachable-medya.

source: You can drag entries from the Journal onto the Documents folder or removable media (and vice-versa)
ht: Ou ka trennen antre soti nan Journal la sou katab la Dokiman oswa detachable medya (ak vis-vèrsa)

source: To remove (unmount) the external file system, choose Remove on the hover menu.
ht: Pou retire (demontra) sistèm nan dosye ekstèn, chwazi Retire sou menu an hover.

source: Caution: It may take time for the hover menu to appear. It is easy to make a mistake and click the icon itself when you intended to click Unmount.
ht: Atansyon: Li ka pran tan pou meni an hover a parèt. Li se fasil fè yon erè ak klike sou ikòn nan tèt li lè ou gen entansyon klike demontra.

source: Caution: If you have a Terminal running you may inadvertently have your removable media locked. The safest way to remove media is after powering off your computer.
ht: Atansyon: Si ou gen yon Tèminal kouri ou ka inadvèrtans te medya detachable ou fèmen. Fason ki pi bon yo retire medya se apre alimante nan òdinatè w lan.

source: Sending Journal Entries via a Network
ht: Voye Journal Entries atravè yon rezo

source: The Journal allows you to send entries to other people who are using Sugar via a network. In order to do this the receiving user has to be registered as a friend in the Neighborhood View and be online. It does not matter whether the laptops are connected via the Mesh-network, an Ad-Hoc network, an access point, or a server.
ht: Journal la pèmèt ou voye antre lòt moun ki ap itilize Sugar via yon rezo. Yo nan lòd yo fè sa itilizatè k ap resevwa a gen yo dwe anrejistre kòm yon zanmi nan gade nan Katye yo epi yo dwe sou entènèt. Li pa enpòtan si laptops yo yo ki konekte via may-rezo a, yon rezo anons-tanporè, yon pwen aksè, oswa yon sèvè.

source: Note to parents and teachers
ht: Remake byen paran ak pwofesè

source: The Journal keeps a record of everything a child does within Sugar: which Activities they use and what content they create. It also keeps a record of group Activities, such as participation in a shared Write or Browse session. The Journal encourages reflection. You can refer to it to assess a child's progress, much in the spirit of "portfolio" assessment. In order to further support this reflection, Sugar offers a Portfolio Activity, an assessment tool that utilizes the journal content. You can reflect on you work: what I have done; how I have done it; and how successful these efforts have been. Then you can create a multimedia presentation to share with your peers, teachers, and parents who can also reflect in return.
ht: Journal la kenbe yon dosye sou tout bagay yon timoun fè nan sik: ki Aktivite yo itilize ak sa ki kontni yo kreye. Li te tou kenbe yon dosye sou Aktivite gwoup, tankou patisipasyon nan yon Ekri pataje oswa Browse sesyon. Journal la ankouraje refleksyon. Ou ka al gade nan li nan evalye pwogrè yon timoun, anpil nan Lespri Bondye a nan "dosye" evalyasyon. Yo nan lòd yo pi lwen sipòte refleksyon sa a, Sugar ofri yon aktivite Portfolio, yon zouti evalyasyon ki itilize kontni an jounal. Ou ka reflechi sou ou ap travay: sa mwen te fè; ki jan mwen te fè li; ak ki jan siksè efò sa yo te. Lè sa a, ou kapab kreye yon prezantasyon miltimedya yo pral pataje avèk kamarad klas ou, pwofesè, ak paran ki kapab tou reflete nan retounen.

source: You can also use it as a catalyst for discussion with your child or student. We encourage the use of the description field within the detail view of Journal entries as a place to annotate or comment up entries.
ht: Ou kapab tou sèvi ak li kòm yon katalis pou diskisyon ak pitit ou a oswa elèv. Nou ankouraje itilize nan jaden an deskripsyon nan gade nan detay nan Journal antre kòm yon kote yo anot oswa kòmantè moute antre.
