Repository: tony37/sledhelp
Catalog: translated_po/ht/jukebox.po
Languages: ht

source: About
ht: Sou

source: Jukebox is the media player to play different kinds of audio and video files including online streams. It also supports playlists like .m3u and .pls.
ht: Jukebox se jwè a medya yo jwe diferan kalite odyo ak dosye videyo ki gen ladan sous dlo sou entènèt. Li sipòte tou Playlists tankou. M3U ak. pls.

source: Where to get Jukebox
ht: Ki kote yo ka resevwa Jukebox

source: Jukebox is included in the standard releases of the OLPC software. If for some reason Jukebox is not installed, it can be downloaded from its `Activity page <http://activities.sugarlabs.org/en-US/sugar/addon/4045>`_
ht: Se Jukebox enkli nan degaje yo estanda nan lojisyèl an OLPC. Si pou kèk rezon Jukebox se pa sa enstale, li ka telechaje soti nan `paj aktivite li yo <http: // aktivite. sugarlabs. org / en-US / sik / addon / 4045> `_

source: Using
ht: Lè l sèvi avèk

source: Across the lower area, you can see the videos and if being the corresponding option checked will also appreciate the playlist, and at the top, there are options to control the flow, and how to view the current track
ht: Tou patou nan zòn nan pi ba, ou ka wè videyo yo epi si yo te opsyon nan korespondan tcheke ap apresye tou playlist la, ak nan tèt la, gen opsyon a kontwole koule nan, ak ki jan yo wè tras aktyèl la

source: The Toolbars
ht: D yo

source: Expand visual options.
ht: Elaji opsyon vizyèl.

source: Load news tracks.
ht: Tren nouvèl chaj.

source: Remove actual track.
ht: Retire aktyèl track.

source: Previous track.
ht: Previous tras.

source: Play/Pause actual track.
ht: Jwe / Pòz aktyèl track.

source: Next track.
ht: Next tras.

source: Control the track progress
ht: Kontwole pwogrè nan tras

source: The Toolbar Sub Menus
ht: Sub nan Toolbar Meni

source: Show/Hide the playlist
ht: Show / Hide playlist la

source: Fullscreen mode/Normal mode
ht: Mòd foulskrin / mòd nòmal

source: More about Jukebox
ht: Plis enfòmasyon sou Jukebox

source: If you open more than one media file, Jukebox will save a "play list" with all the files you selected. Then you can create list by topics, and open all the files later just selecting the list saved in your Journal.
ht: Si ou louvri plis pase yon dosye medya, Jukebox pral delivre yon "lis jwe" ak tout dosye yo ou chwazi. Lè sa a, ou kapab kreye lis pa sijè, ak louvri tout dosye yo pita jis chwazi lis la sove nan jounal ou.

source: You can open files located in external devices like a usb device, from Jukebox, without copying them in the Journal, that is really useful if the files are too big.
ht: Ou kapab louvri dosye sitiye nan aparèy ekstèn tankou yon aparèy USB, ki soti nan Jukebox, san yo pa kopye yo nan jounal la, ki se reyèlman itil si dosye yo yo se twò gwo.
