Repository: tony37/sledhelp
Catalog: translated_po/ht/keyboard.po
Languages: ht

source: Keyboard
ht: Klavye

source: The Keyboard and Touchpad
ht: Klavye a ak touchpad

source: TODO: <We should have a picture of 1.5 rather than 1.0>
ht: Todo: <Nou ta dwe gen yon foto nan 1. 5 olye ke 1. 0>

source: The keyboard and touchpad—which are dust and water resistant—have special keys for additional functionality. Keyboards are designed for each country, so your keyboard may not look exactly like the one in this figure. Keys outlined in yellow are reserved for future features (such as the "grab" keys and the "slider bar").
ht: Keyboards yo fèt pou chak peyi, se konsa klavye ou pa ka gade egzakteman menm jan ak yon sèl la nan figi sa a. Keys endike nan jòn yo rezève pou karakteristik lavni (tankou "gen tan pwan" kle yo ak "kurseur ba a").

source: Escape key -- The escape key is labeled with an × symbol on a black circle. The escape key is most commonly used in combination with the control key to quit activities (ctrl + esc).
ht: Se kle nan chape pi souvan itilize nan konbinezon ak kle nan kontwòl kite fimen aktivite (ctrl + ESC).

source: Tab key -- The tab key is labeled with arrows pointing right and left. The tab key—in addition to its standard use—is used in combination with the control, shift and alt keys to cycle through open Activities. For example, alt + tab cycles forward through running Activities.
ht: Kle Tab - se kle nan tab ki make ak flèch montre dwa ak bò gòch. Pou egzanp, alt + tab sik pou pi devan nan Aktivite kouri.

source: Control key -- The control key is used in combination with other keys to issue commands. For example, ctrl + c is used to copy to the clipboard; ctrl + v is used to paste from the clipboard.
ht: Kontwòl kle - se kle nan kontwòl yo itilize nan konbinezon ak lòt kle bay desizyon kòmandman. Pou egzanp, ctrl + c se sèvi ak kopi nan papye a; se ctrl + v itilize kole soti nan papye a.

source: Shift key -- The shift key is used in combination with other keys as a modifier, most commonly to shift between lowercase and uppercase in Latin-based alphabets.
ht: Shift kle - se kle nan chanjman yo itilize nan konbinezon ak lòt kle kòm yon Modifier, pi souvan chanjman ant miniskil ak majuskul nan alfabè Latin ki baze sou.

source: Fn key -- The function key is used in combination with other keys as a modifier. For example, fn + erase is delete; fn + up arrow is page up.
ht: Fn kle - se kle nan fonksyon yo itilize nan konbinezon ak lòt kle kòm yon Modifier. Pou egzanp, FN + efase se efase; FN + moute flèch se paj moute.

source: Alt key -- The alt key is used in combination with other keys to issue commands. For example, alt + enter toggles full-screen mode; alt + spacebar toggles the tray visibility. This example works in the Browse Activity but not in the Record Activity.
ht: Alt kle - se kle nan alt itilize nan konbinezon ak lòt kle bay desizyon kòmandman. Pou egzanp, alt + antre nan baskile mòd plen ekran-; alt + bar baskile vizibilite a plato. Egzanp sa a ap travay nan Browse aktivite a, men se pa nan aktivite nan Dosye.

source: Spacebar -- The spacebar key types a space. In the future, when used in conjunction with the function key (fn), it will eventually view the source code for the currently running Activity.
ht: Bar - bar Kalite ki kle yon espas. Nan lavni a, lè yo itilize nan konjonksyon avèk kle a fonksyon (FN), li pral evantyèlman wè kòd la sous pou aktivite a kounye a kouri.

source: Alt Gr key -- The alt graphics key is used in combination with other keys as a modifier, most commonly to select an alternative letter or generate an accented character. The details of this functionality vary from keyboard layout to keyboard layout: for example, on the US keyboard, alt gr + j generates a € (euro sign); typing the character "a" followed by alt gr + 4 generates á.
ht: Alt Gr kle - se kle nan alt grafik yo itilize nan konbinezon ak lòt kle kòm yon Modifier, pi souvan yo chwazi yon lèt altènatif oswa jenere yon karaktè aksan.

source: Arrow keys -- The arrow keys are used for navigation; combined with the function key (fn), they are used for page up, page down, home, and end.
ht: Kle flèch - flèch la kle yo itilize pou Navigasyon; konbine avèk kle a fonksyon (FN) yo, yo yo te itilize pou paj moute, paj desann, kay la, ak nan fen.

source: Language key -- The language key is found on keyboard layouts that combine Latin and non-Latin scripts. It toggles between scripts, so, for example, one can switch between typing in English and Hindi with a single keystroke. (On Latin-only keyboards, the language key has been replaced by a × and ÷ key.)
ht: Kle Lang - se jwenn kle a lang sou kouman klavye ki konbine Latin ak ki pa Peye-Latin Scripts. Li baskile ant Scripts, se konsa, pou egzanp, yon moun ka chanje ant sezisman nan lang angle ak Hindi ak yon touch sèl. )

source: Enter key -- The enter key—in addition to its standard use—is used in combination with modifier keys. For example, alt + enter toggles full-screen mode.
ht: Pou egzanp, alt + antre nan baskile mòd plen ekran-.

source: Erase key -- The erase key deletes the character behind the cursor (backspace). fn + erase deletes the key in front of (or on) the cursor.
ht: Efase kle - kle a efase supresyon pèsonaj la dèyè kurseur a (RETOUR). FN + efase supresyon kle a nan devan (oswa sou) kurseur a.

source: Frame key -- The Frame key toggles the presence of the Frame on the screen. The Frame is the black border around the screen that holds the Activity taskbar, clipboard, wireless connections, battery level, and so on.
ht: Kle Frame - kle nan Frame baskile nan prezans nan ankadreman an sou ekran an. Frame a se fwontyè a nwa alantou ekran an ki kenbe aktivite a ekstrè, clipboard, koneksyon san fil, nivo batri, ak sou sa.

source: Volume controls -- The volume keys lower and raise the audio level.
ht: Kontwòl Volim - kle yo volim pi ba ak ogmante nivo a odyo.

source: Brightness controls -- The brightness keys lower and raise the brightness of the screen backlight. To turn the backlight off completely may take 7-8 button presses.
ht: Kontwòl Luminozite - kle yo klète pi ba ak ogmante limyè nan ekleraj la ekran. Yo vire ekleraj la fèmen nèt ka pran 7-8 bouton près.

source: View keys -- The four view keys, from left to right, take you to the Neighborhood view, the Group view, the Home view, and the Activity view.
ht: View kle - kat Kle yo vi, de gòch a dwat, pran ou nan gade nan Katye, gade nan Group, gade nan Kay, ak gade nan aktivite.

source: Search key -- The search key takes you directly to the Journal and places the text cursor in the search box.
ht: Search kle - kle nan rechèch pran ou dirèkteman nan jounal la ak kote kurseur a tèks nan bwat rechèch la.
