Repository: tony37/sledhelp
Catalog: translated_po/ht/labyrinth.po
Languages: ht

source: Labyrinth
ht: Labirent

source: About
ht: Sou

source: |Laby_ico| Labyrinth is a lightweight mind-mapping activity based on an Open Source project called Labyrinth. It allows creating mind maps from a mixture of text, freehand drawings, and images from your Journal. There is an infinite sized canvas for your map that can be panned and zoomed while you work. Maps can be "Kept to PDF" for uploading to web sites, sharing, and printing by others who may not be using Sugar.
ht: | Laby_ico | labirent se yon aktivite lide-kat ki lejè ki baze sou yon labirent Open Sous pwojè rele. Li pèmèt kreye kat lide soti nan yon melanj nan tèks, desen freehand, ak imaj ki soti nan jounal ou. Gen yon enfini twal gwosè pou kat jeyografik ou ki ka panned ak agrandi pandan ou ap travay. Maps ka "kenbe yo nan PDF" pou uploading nan sit entènèt, pataje, ak enprime pa lòt moun ki pa ka lè l sèvi avèk sik.

source: Gallery
ht: Galeri

source: Keyboard Shortcuts
ht: Rakoursi klavye

source: Esc deselects thought, stops editing current text though
ht: Kompitè deselects panse, sispann koreksyon tèks aktyèl menm si

source: Ctrl + A select all thoughts
ht: Ctrl + Yon chwazi tout panse

source: Ctrl + E for Edit mode (bounding box selections, and allows editing of existing thoughts)
ht: Ctrl + E pou Edit mòd (espasyal seleksyon bwat, ak pèmèt koreksyon nan panse ki egziste deja)

source: Ctrl + T for text thought mode (click canvas, or click and drag, to add new thoughts)
ht: Ctrl + T pou mòd panse tèks (klike twal, ou Sur Et faites, nan ajoute nouvo panse)

source: Ctrl + D for drawing mode (click canvas, or click and drag, then draw inside thought boundary)
ht: Ctrl + D pou fè desen mòd (klike twal, ou Sur Et faites, lè sa a trase anndan fwontyè panse)

source: Ctrl + I for image add mode (click canvas, or click and drag, use Journal object picker to select image)
ht: Ctrl + mwen pou imaj ajoute mòd (klike twal, ou Sur Et faites, sèvi ak Journal objè piker yo chwazi imaj)

source: Ctrl + L to link two or more selected thoughts
ht: Ctrl + L ap mennen de panse oswa plis chwazi

source: ERASE to erase one or more selected thoughts
ht: Efase ou efase yon sèl panse oswa plis chwazi

source: Ctrl + + to zoom in
ht: Ctrl + + rale nan

source: Ctrl + - to zoom out
ht: Ctrl + - yo rale soti

source: Ctrl + 9 zoom to fit window
ht: Ctrl + 9 rale nan anfòm fenèt

source: Ctrl + 0 for original zoom size
ht: Ctrl + 0 pou orijinal gwosè rale

source: Alt + Enter to toggle full screen
ht: Alt + Antre aktive ekran plen

source: Ctrl + Q or Alt + Esc to stop the activity
ht: Ctrl + K oswa Alt + ESC yo sispann aktivite a

source: Mouse/Trackpad shortcuts
ht: Mouse / trakpad rakoursi

source: Single click on the canvas with left button in text/drawing/image mode to create a thought
ht: Sèl klike sou sou twal la ak bouton gòch nan tèks / desen / mòd imaj yo kreye yon panse

source: Drag with left button in text/drawing/image mode to create a thought of a specific size
ht: Drag ak bouton gòch nan tèks / desen / mòd imaj yo kreye yon panse ki gen yon gwosè espesifik

source: Single click left button to select an existing thought (typing will append to the thought text)
ht: Single Sur GÒCH bouton yo chwazi yon te panse ki deja egziste (sezisman pral kole nan tèks la te panse)

source: Double click left button to select a thought and begin editing the text content (all thought text starts selected)
ht: Double klike kite bouton yo chwazi yon panse epi kòmanse koreksyon kontni an tèks (kòmanse tout tèks panse chwazi)

source: Hold shift and left click thoughts to make multiple selections
ht: Kenbe TOUCHE Et GÒCH SUR panse fè miltip seleksyon

source: Hold 'hand' key on XO keyboard and use left button to drag the canvas to pan/scroll
ht: Kenbe kle 'men' sou XO klavye epi sèvi ak bouton gòch a trennen twal la Pan / woulo liv

source: Hold right button to drag individual thoughts
ht: Kenbe bouton dwa trennen panse moun

source: When in drawing mode, hold Shift and draw to erase
ht: Lè nan desen mòd, kenbe Shift epi trase ou efase

source: Review
ht: Revizyon

source: `Video Review <http://www.youtube.com/watch?v=h8Mcc0toS0M>`_
ht: `Videyo Revizyon <http: // www. youtube. com / gade? v = h8Mcc0toS0M> `_

source: Resources
ht: Resous

source: `Activity Library Page <http://activities.sugarlabs.org/en-US/sugar/addon/4078>`_
ht: `Aktivite Bibliyotèk Page <http: // aktivite. sugarlabs. org / en-US / sik / addon / 4078> `_

source: `Source <http://git.sugarlabs.org/projects/labyrinth>`_
ht: `Sous <http: // git. sugarlabs. org / pwojè / labirent> `_

source: `Source tarball <http://download.sugarlabs.org/sources/honey/Labyrinth/>`_
ht: `Sous tar <http: // download. sugarlabs. org / sous / siwo myèl / labirent /> `_

source: References
ht: Referans

source: `Wiki page <http://wiki.sugarlabs.org/go/Activities/Labyrinth>`_
ht: `Paj Wiki <http: // wiki. sugarlabs. org / ale / Aktivite / labirent> `_
