Repository: tony37/sledhelp
Catalog: translated_po/ht/launching_activities.po
Languages: ht

source: Launching Activities
ht: Lanse Aktivite

source: You can launch an Activity in four different ways:
ht: Ou ka lanse yon Aktivite nan kat fason diferan:

source: Click the Activity icon in the Home View.
ht: Klike sou ikòn nan Aktivite nan View a Kay.

source: Resume your previous work with an Activity from the Journal.
ht: Kourikouloum-vite travay anvan ou a ak yon aktivite soti nan Journal la.

source: Join a shared Activity from the Neighborhood View.
ht: Rantre nan yon aktivite pataje soti nan View nan Katye.

source: Accept an invitation by clicking the invitation icon on the Frame.
ht: Aksepte yon envitasyon pa klike icon nan envitasyon sou ankadreman an.

source: When you launch an Activity, its icon flashes in the middle of the screen while it loads.
ht: Lè ou lanse yon aktivite, icon kliyot li yo nan mitan an nan ekran an pandan y ap li charges.

source: Once the Activity is running, you will be placed into its Activity View.
ht: Yon fwa aktivite a ap kouri, ou pral mete nan Wè aktivite li yo.

source: Launching Activities from the Home view
ht: Lanse Aktivite soti nan gade nan Kay

source: To get to the Home View,
ht: Pou jwenn yo wè nan Kay,

source: click the Home icon on the Frame |frame|
ht: klike sou ikòn la Kay sou ankadreman an | ankadreman |

source: or press the F3 key. On the XO keyboard this key has a single dot |home_key|, and is one of the view keys |nav_buttons|.
ht: oswa peze kle a F3. Sou klavye a XO kle sa a te gen yon dot sèl | home_key |, epi se youn nan kle View | nav_buttons yo |.

source: Then click on the icon of the activity you want to start. If you aren't sure you have the right activity, hover your cursor over the icon for a few seconds and a label will appear with the activity name.
ht: Lè sa a, klike sou icon nan nan aktivite a ou vle kòmanse. Si ou pa w ke ou gen aktivite nan dwa, hover kurseur ou sou icon nan pou yon kèk segond ak yon etikèt sou ap parèt ak non an aktivite.

source: If you've run the Activity before, clicking the icon will resume with your last Journal entry. If you click the right menu button or hover the cursor over the icon for several seconds, a menu appears with other Journal entries you made with the activity, and an option to "Start new".
ht: Si ou te kouri aktivite a anvan, klike icon la pral rezime ak dènye Journal antre ou. Si ou klike sou bouton an meni dwa oswa hover kurseur a sou icon nan pou plizyè segond, yon meni parèt ak lòt antre Journal ou te fè ak aktivite a, ak yon opsyon yo "Kòmanse nouvo".

source: If you don't see the Activity's icon, click the menu icons (2) (3) to change how the Home view displays activities. Or type part of the Activity's name in the search box (1).
ht: Si w pa wè icon Aktivite a, klike sou ikon yo meni (2) (3) chanje ki jan gade nan Kay montre aktivite. Oswa kalite yon pati nan non aktivite a nan bwat rechèch la (1).

source: In list view mode (3) you can click the star (4) next to an Activity's name to add/remove it as a favorite. Favorite Activities appear in color in the favorites view
ht: Nan View lis mòd (3) ou ka klike sou zetwal la (4) akote non yon aktivite nan ajoute / retire li kòm yon pi renmen. Aktivite Favorite parèt nan koulè nan favorites yo wè

source: If the Activity fails to start, you will be returned to Home View.
ht: Si aktivite a echwe yo kòmanse, ou pral dwe retounen nan Kay View.

source: Resuming from the Journal
ht: Reprenan nan Journal la

source: Click the activity's icon or click Resume on its hover menu.
ht: Klike sou ikòn aktivite a oswa klike sou menu Kourikouloum-vite hover li yo.

source: You can also launch some journal entries in a different activity using the hover menu. For example, you can resume an image you made in the Paint activity in Etoys or Browse.
ht: Ou kapab tou lanse kèk antre jounal nan yon aktivite diferan lè l sèvi avèk meni an hover. Pou egzanp, ou ka reprann yon imaj ou te fè nan aktivite a nan penti Etoys oswa browse.

source: You can click the first drop-down menu in the Journal to only show certain kinds of entries or those made with a particular activity.
ht: Ou kapab klike sou premye meni an gout-desann nan jounal la sèlman montre sèten kalite antre oswa moun te fè ak yon aktivite an patikilye.

source: Joining a shared Activity
ht: Rantre nan yon aktivite pataje

source: Click the icon or click an option on the hover menu.
ht: Klike sou ikòn a oswa klike yon opsyon sou meni an hover.

source: Joining an Activity by accepting an invitation
ht: Rantre nan yon aktivite pa aksepte yon envitasyon

source: Click Join in the hover menu on the Frame.
ht: Sur Join nan meni an hover sou ankadreman an.

source: For users
ht: Pou moun ki itilize

source: Try not to open more than three Activities at one time or your speed may be reduced.
ht: Eseye pa louvri plis pase twa Aktivite an yon sèl fwa oswa li ka vitès ou ap redwi.
