Repository: tony37/sledhelp
Catalog: translated_po/ht/log.po
Languages: ht

source: About
ht: Sou

source: The Log Activity allows you to troubleshoot problems with your computer. You can view the log files of Sugar and your Activities. Log files contain errors, warnings and debugging information to help you fix problems.
ht: Log Aktivite a pèmèt ou rézoudr pwoblèm ak òdinatè w lan. Ou kapab wè dosye yo louvri sesyon nan sik ak aktivite ou. Log dosye gen erè, avètisman ak debogaj enfòmasyon yo ede w ranje pwoblèm.

source: Using Log
ht: Lè l sèvi avèk Log

source: When you open Log, there are 2 panels. On the left is a list of log files. On the right, the contents of the selected file is displayed.
ht: Lè ou louvri Log, gen 2 panno. Sou bò gòch la se yon lis nan dosye boutèy demi lit. Sou bò dwat la, sa ki nan dosye a chwazi se parèt.

source: The list of log files is divided into sections, each representing a folder. Pressing the arrow icon a to the folder name will hide or show its contents. Items without arrows are log files. Pressing an item that does not have an arrow will display the contents of that file in the right panel.
ht: Se lis la nan dosye log divize an seksyon, chak reprezante yon katab. Peze flèch icon yon nan non an folder pral kache oswa montre sa li yo. Atik san yo pa flèch yo se dosye boutèy demi lit. Peze yon atik ki pa gen yon flèch ap montre sa ki nan ke dosye nan panèl la dwa.

source: There are 3 main folders in the log file list. The first is the ``.sugar`` or ``dotsugar`` folder. This contains the log files of Sugar and your Activities. The sub-folders contain backups of older logs (log files in ``.sugar`` are deleted on shutdown). The second main folder ``/var/log``. This contains system log files. These are helpful for troubleshooting issues related to your computer hardware. The last main folder is ``Other``, and contains miscellaneous log files.
ht: Genyen 3 dosye prensipal nan lis nan dosye boutèy demi lit. Premye a se `` yo. sugar`` oswa `` folder dotsugar``. Sa a gen dosye yo louvri sesyon nan sik ak aktivite ou. Sub-dosye yo gen sovgad nan ki pi gran mòso bwa (boutèy demi lit dosye nan ``. sugar`` yo efase sou are). Dezyèm katab nan prensipal `` / var / log``. Sa a gen dosye log sistèm. Sa yo se itil pou pwoblèm ki gen rapò ak depanaj kenkayri òdinatè w lan. Dènye katab la prensipal se `` Other``, epi li gen dosye log divès.

source: The ``.sugar`` folder is the first folder you should look at when troubleshooting Sugar and your Activities. The ``shell.log`` file contains errors, warnings and debugging information for the Sugar Shell. The Sugar Shell covers the home and neighborhood views, journal, frame, web services and control panel. Each activity has its own log file, named using its bundle ID. You can find an activity's bundle ID by opening view source while using the activity, clicking the ``activity`` folder and opening the ``activity.info`` file. If you open an activity for a 2nd time, a separate log file will be created, with ``-2`` added to the end of the file name. This pattern continues if you run the activity more than 2 times.
ht: `` Yo. folder sugar`` se premye folder nan ou ta dwe gade nan lè depanaj Sugar ak Aktivite ou. `` Koki a. dosye log`` gen erè, avètisman ak debogaj enfòmasyon pou Sugar Shell nan. Sugar Shell a kouvri kay ak katye opinyon, jounal, ankadreman, sèvis entènèt ak kontwòl panèl la. Chak aktivite gen pwòp dosye log li yo, yo te rele lè l sèvi avèk ID pake li yo. Ou ka jwenn pake ID yon aktivite nan pa louvri sous vi pandan w ap itilize aktivite a, klike `` folder nan activity`` ak ouvèti `aktivite a`. info`` dosye. Si ou louvri yon aktivite pou yon tan 2nd, y ap fè yon dosye log separe dwe kreye, ak `` -2`` ajoute nan fen a nan non an dosye. Modèl sa a ap kontinye si ou kouri aktivite a pi plis pase 2 fwa.

source: The Toolbars
ht: D yo

source: Activity Toolbar
ht: Aktivite Toolbar

source: Hide/Show the list of files
ht: Kache / Montre lis la nan dosye

source: Copy the log file
ht: Kopi dosye a boutèy demi lit

source: Enable/Disable word wrap. When word wrap is disabled, there is a horizontal scroll bar. When word wrap is enabled, the lines of text too long to fit on the screen are broken up.
ht: Pèmèt / enfim vlope mo. Lè vlope mo ki andikape, gen yon woulo liv bar orizontal. Lè yo vlope mo pèmèt, liy ki nan tèks twò lontan nan anfòm sou ekran an yo kase moute.

source: Find and highlight text in the log file
ht: Jwenn ak mete aksan sou tèks nan dosye a louvri sesyon

source: Previous matching text
ht: Previous tèks matche

source: Next matching text
ht: Next tèks matche

source: Delete current log file
ht: Efase aktyèl dosye log

source: Stop activity
ht: Aktivite Stop

source: Activity Name
ht: Non Aktivite

source: Activity Description
ht: Aktivite:

source: Save log files to Journal. This packages the log files in a format that you can send over the internet. If you find a bug, you can email this package to the activity's developers so they can fix this bug. If you are filing a support ticket or bug report, you should attach this file, so the problem can be more easily diagnosed and fixed.
ht: Save dosye boutèy demi lit Journal. Sa a pakè dosye yo louvri sesyon nan yon fòma ke ou ka voye sou entènèt la. Si ou jwenn yon ensèk, ou ka voye yon imèl ba pake sa a nan devlopè aktivite a nan pou yo ka ranje ensèk sa a. Si w ap ranpli yon tikè sipò oswa ensèk rapò, ou ta dwe tache sa a ranpli, se konsa ka pwoblèm lan dwe pi fasil dyagnostike ak fiks.
