Repository: tony37/sledhelp
Catalog: translated_po/ht/maintaining.po
Languages: ht

source: Maintenance
ht: Antretyen

source: Maintaining your XO
ht: Kenbe XO ou

source: Although your XO is tough, try to keep it dry and clean. Here are some tips for taking care of it:
ht: Malgre ke XO ou se difisil, eseye kenbe li sèk ak pwòp. Men kèk konsèy pou pran swen l ':

source: Carry it carefully to avoid dropping it.
ht: Pote li ak anpil atansyon pou fè pou evite jete li.

source: Don't step on it or sit on it.
ht: pa etap sou li oswa chita sou li.

source: If it gets dirty, wipe it with a damp cloth and dry it.
ht: Si li vin sal, siye li ak yon twal mouye ak sèk li.

source: Do not dip it into water. If it gets wet, such as from rain, let it dry completely before using it.
ht: Piga tranpe l 'nan dlo. Si li vin mouye, tankou soti nan lapli, kite l seche konplètman anvan ou sèvi ak li.

source: The XO laptop has no hard drive and only two internal cables. With care it can be disassembled for repair. For added robustness, the XO's plastic walls are thicker than other laptops. Its green mesh network antennae give a better wireless connection than typical laptops. Plus, they double as external covers for the USB ports, which are protected internally as well. Internal bumpers protect the screen display by cushioning it.
ht: Laptop XO a pa gen okenn kondwi difisil ak sèlman de câbles entèn. Avèk swen li kapab demonte pou reparasyon. Pou ajoute fyabilite, mi plastik XO a yo pi epè pase lòt laptops. Antèn rezo may vèt li yo bay yon koneksyon pi bon san fil pase laptops tipik. Plus, yo double kòm kouvri ekstèn pou pò yo USB, ki yo pwoteje intern kòm byen. Chok Entèn pwoteje ekspozisyon an ekran pa kalaj li.

source: Sometimes, It happens that the keys you are pressing appear somewhat dark shade of green or somewhat blackish. Remember, don't keep your hand on a single key for long. And wipe it with clean cloth to clean it.
ht: Pafwa, li k ap pase ki kle yo w ap peze yon ti jan fè nwa parèt lonbraj nan vèt, oubyen yon ti jan nwaratr. Sonje byen, pa kenbe men ou sou yon kle sèl pou lontan. Ak siye l 'ak twal pwòp netwaye li.

source: Maintenance of the XO hardware involves updating the software and firmware and keeping the case in working order. Please refer to the Support section below for information on reflashing your XO.
ht: Antretyen nan pyès ki nan konpitè XO enplike à lojisyèl an ak firmwèr ak kenbe ka a nan travay lòd. Tanpri gade nan seksyon an sipò pi ba a pou enfòmasyon sou reflashing XO ou.
