Repository: tony37/sledhelp
Catalog: translated_po/ht/measure.po
Languages: ht

source: Measure
ht: Mezi

source: About
ht: Sou

source: This Activity draws a picture of the sound heard by the internal microphone or of the signal present on the microphone socket. More specifically it draws a graph of this input versus time, the input is on the vertical axis and time is on the horizontal axis. That is, the laptop functions like a machine called an oscilloscope.
ht: Aktivite sa a trase yon foto nan son an tande pa mikwofòn la entèn oswa nan prezan an siyal sou priz an mikwofòn. Plis espesyalman li trase yon graf nan opinyon sa a kont tan, D 'a se sou aks vètikal la ak tan se sou aks la orizontal. Sa se, fonksyon yo laptop tankou yon machin rele yon osiloskop.

source: As well as graphing signal as a function of time, Measure can also graph as a function of frequency.
ht: Kòm byen ke grafik siyal kòm yon fonksyon nan tan, Mezi kapab tou graf kòm yon fonksyon nan frekans.

source: The XO-1 laptop is only capable of mono input, the XO-1.5 and XO-1.75 are capable of stereo input on their microphone socket and can graph two signals at once.
ht: Laptop XO a-1 se sèlman ki kapab D 'mono, XO a-1. 5 ak XO-1. 75 yo kapab nan opinyon stereo sou priz mikwofòn yo epi yo ka fè chema de siyal nan yon fwa.

source: Using
ht: Lè l sèvi avèk

source: Select secondary toolbar - allows the Activity's Journal entry to be renamed
ht: Chwazi toolbar segondè - pèmèt Journal antre Aktivite an yo dwe chanje non

source: Select secondary toolbar - measurement settings
ht: Chwazi toolbar segondè - anviwònman mezi

source: The selected input type - Sound (AC voltage), resistance or DC voltage
ht: Kalite a chwazi D '- Son (AC vòltaj), rezistans oswa DC vòltaj

source: The time scale
ht: Echèl la tan

source: Freeze the display
ht: Glase ekspozisyon an

source: Capture sample now - saves an image of the wave in the Journal
ht: Echantiyon Capture kounye a - sove yon imaj de vag nan nan jounal la

source: Stop - exits the Activity
ht: One Stop - sòti aktivite a

source: Invert - invert the display
ht: Invert - Invert ekspozisyon an

source: Use these sliders to control the sensitivity
ht: Sèvi ak koulis sa yo kontwole sansiblite a

source: The settings that are selected
ht: Anviwònman yo ke yo chwazi

source: The secondary toolbar - measurement settings
ht: Ba ikòn nan segondè - anviwònman mezi

source: Sound - use this setting with the internal microphone, external microphone and external AC signals
ht: Son - sèvi ak anviwònman sa a ak mikwofòn la entèn yo, mikwofòn ekstèn ak siyal AC ekstèn

source: Resistance sensor - use with external resistive type transducers
ht: Rezistans Capteur - sèvi ak ak resistive ekstèn traducteurs kalite

source: Voltage sensor - use with external sensors which generate a voltage
ht: Voltage Capteur - sèvi ak ak detèktè ekstèn ki jenere yon vòltaj

source: Time base/frequency - graphs the signal vs. time or graphs amplitude vs. frequency
ht: Tan baz / frekans - graf siyal la vs. tan oswa graf anplitid vs. frekans

source: Sample interval - a text file 'Measure Log' is saved to the journal, it contains one sample per interval
ht: Egzanp entèval - se yon dosye tèks 'Mezire Log' sove nan jounal la, li gen yon sèl echantiyon pou chak entèval

source: Starts/stops saving a text file 'Measure Log' with measured values as readable text
ht: Kòmanse / sispann ekonomize yon dosye tèks 'Mezire Log' ak valè mezire kòm tèks lizib

source: This feature is not working well in version 36, the intention is to synchronize the sample period to the waveform so that the sample will start on a rising edge or falling edge
ht: Karakteristik sa a se pa sa k ap travay byen nan vèsyon 36, entansyon an se nan senkroniz peryòd ki nan egzanp lan ond la pou ke echantiyon an pral kòmanse sou yon kwen rebò rising ou tonbe

source: Applying
ht: Aplike

source: Let the children experiment with the internal microphone, try singing, whistling, musical instruments, the Tam Tam musical Activity. The Turtle Blocks Activity can generate an audio tone, see the Python Block.
ht: Kite timoun yo eksperyans ak mikwofòn la entèn, eseye chante, sifle, enstriman mizik, Tam Tam an aktivite mizik. Aktivite nan Turtle Blòk ka jenere yon ton odyo, wè blòk nan Piton.

source: The children should learn through guided discovery that:
ht: Timoun yo ta dwe aprann nan dekouvèt gide ke:

source: sound is a pressure wave
ht: son se yon vag presyon

source: the pitch of the sound is determined by the frequency or cycles per second (Hz)
ht: se anplasman an nan son an detèmine pa frekans lan oswa sik pou chak dezyèm (Hz)

source: the loudness of a sound is determined by the amplitude
ht: se volim a nan yon son detèmine pa anplitid la

source: sounds contain multiple frequency components or harmonics
ht: son gen konpozan frekans miltip oswa Harmony

source: the more pure sounds have less harmonics
ht: son yo ki pi plis pi bon kalite gen mwens Harmony

source: Sharing
ht: Pataje

source: This Activity does not support sharing.
ht: Aktivite sa a pa sipòte pataje.

source: Extending
ht: Pwolonje

source: Measure is able to take input from a wide range of external sensors including switches, photocells, temperature sensors, inductive loops, hall effect sensors, soil probes and many more.
ht: Mezi ki kapab pran opinyon ki soti nan yon pakèt domèn nan detèktè ekstèn ki gen ladan switch, fotoelèktrik, detèktè tanperati a, pasan endiktif, detèktè efè sal, sond tè ak anpil plis.

source: Care should be taken not to exceed the allowable input voltage:
ht: Swen yo ta dwe pran pa dwe depase vòltaj la opinyon admisib:

source: XO-1 -0.5 V to 5 V
ht: XO-1 -0. 5 V a 5 V

source: XO-1.5 -6 V to +9 V
ht: XO-1. 5 -6 V +9 V

source: XO-1.75 -6 V to +9 V
ht: XO-1. 75 -6 V +9 V

source: It is a good idea, particularly on the XO-1, to put a resistor of 680 ohms in the phono plug, this increases the allowable input voltage range.
ht: Li se yon bon lide, patikilyèman sou XO a-1, yo mete yon rezisteur nan 680 om nan ploge nan fono, sa a ogmante seri a admisib vòltaj opinyon.

source: You can find ideas for fun science experiments at http://wiki.sugarlabs.org/go/Activities/TurtleArt/Using_Turtle_Art_Sensors and http://wiki.laptop.org/go/Measure
ht: Ou ka jwenn ide pou eksperyans syans plezi nan http: // wiki. sugarlabs. org / ale / Aktivite / TurtleArt / Using_Turtle_Art_Sensors ak http: // wiki. laptop. org / ale / Mezi
