Repository: tony37/sledhelp
Catalog: translated_po/ht/memorize.po
Languages: ht

source: About
ht: Sou

source: This Activity allows learners to take the learning process in their own hands, as they play but also create their own games. The game has matching pairs of what are clickable tiles, or blocks. The card pairs are composed of text, sound or images. The children turn over the cards to match words, words and sounds, words and pictures, or pictures and sounds. There are a few default games loaded. These images, sounds and text can be extended to animations or movie snippets. Players of Memorize can play together across multiple machines.
ht: Aktivite sa a pèmèt elèv k ap aprann yo pran pwosesis aprantisaj la nan men pwòp yo, menm jan yo jwe, men tou kreye jwèt pwòp yo. Jwèt la te matche pè ki sa yo mozayik klikabl, oswa blòk. Pè yo kat yo ki konpoze de tèks, son oswa imaj. Timoun yo vire sou kat yo matche ak mo mo, ak son, mo yo ak foto, oswa foto ak son. Gen yon jwèt default kèk chaje. Imaj sa yo, son ak tèks ka pwolonje nan Animations oswa fragman fim. Jwè a Memorize ka jwe ansanm atravè machin miltip.

source: Using Memorize
ht: Lè l sèvi avèk Memorize

source: Memorize comes with two modes, *Play*, and *Edit game*. In *Edit game* you can make a brand new Memorize game, or edit one of the demo games supplied.
ht: Memorize vini ak de mòd, * Jwe *, ak * Edit jwèt *. Nan * Edit jwèt * ou ka fè yon mak nouvo jwèt Memorize, oswa edite youn nan jwèt yo Demo apwovizyone.

source: In *Play* mode the Activity has three sets of tiles for demo games, *Numbers, Letters* and *Sounds*. Memorize supports :ref:`Sharing` so you can play the game with others.
ht: Nan * Jwe * mòd aktivite a gen twa kouche nan mozayik pou jwèt Demo, * Numbers, Lèt * ak * Son *. Memorize sipò: ref: `Sharing` pou ou ka jwe jwèt la ak lòt moun.

source: The image below shows the Letters demo being selected, and play in progress. Notice that the unturned tiles, are in two sets, tiles are numbered with a 1 in the top part of the gameboard, and with a 2 in the lower half. This is called a *Grouped tile game*.
ht: Imaj ki anba a montre Lèt a Demo li chwazi yo, epi jwe nan pwogrè. Avi ke twil yo baryè, yo nan de kouche, mozayik yo nimewote ak yon 1 nan pati a anwo nan gameboard a, epi ki gen yon 2 nan mwatye ki pi ba. Se sa yo rele yon * Gwoupe jwèt mozayik *.

source: (In the Sounds demo, there is an example of an *Ungrouped game*, that is, the tiles are randomly spread over the gameboard.)
ht: (Nan Demo a Son, gen ki se yon egzanp nan yon * An degrennen jwèt *, se sa ki, twil yo yo gaye owaza sou gameboard la. )

source: The player has already matched two pairs, by clicking on the tiles. Matched tiles are highlighted and a score is shown on the left side. If the pair of tiles do not match, they are flipped back over after a short time, in which you try to memorize them.
ht: Te jwè a deja matche de pè, pa klike sou twil yo. Matche mozayik yo make epi li se yon nòt yo montre sou bò gòch la. Si pè a nan mozayik pa matche ak yo, yo yo ranvèrse tounen sou apre yon ti tan, nan ki w ap eseye memorize yo.

source: When you play a *Grouped tile game*, the prompt will be in the top half of the gameboard, and the answer will be hidden under one of the squares in the bottom half. You have to guess where the matching tile might be. Move the cursor down and notice that the bottom rows are now 'live' --each square is highlighted as you cross it. Select your guess. After you have made a few guesses, you will start to remember where the matching tiles might be.
ht: Lè ou jwe yon * Gwoupe mozayik jwèt *, èd memwa a pral nan mwatye nan tèt nan gameboard a, epi yo pral repons lan dwe kache anba youn nan kare yo nan mwatye a anba. Ou gen yo devine ki kote mozayik nan matche ta ka. Deplase kurseur la desann ak remake ke ranje yo anba yo kounye a se 'viv' se kare --each make jan ou travèse li. Chwazi devine ou. Apre ou te fè yon eseye devine kèk, ou pral kòmanse sonje ki kote twil yo matche ta ka.

source: **Toolbar tabs and buttons in Play do the following:**
ht: ** Onglè Toolbar ak bouton an Jwe sa yo: **

source: Activity tab. In the first field name the game. The Description button allows you to add a description to the :doc:`/journal` entry. Thirdly select Private, or My Neighbourhood, see :ref:`Sharing`.
ht: Tab aktivite. Nan jaden an premye non jwèt la. Bouton an Deskripsyon pèmèt ou ajoute yon deskripsyon nan: doc la: `/ antre journal`. Anfen chwazi Prive, oswa Katye mwen, wè: ref: `Sharing`.

source: Load demo game - Select preloaded demo games from list.
ht: Chaj Demo jwèt - Chwazi jwèt Demo precharje nan lis.

source: Select the Grid Size, 4x4, 5x5, or 6x6.
ht: Chwazi Grid Size, 4x4, 5x5, oswa 6x6 la.

source: Restart Game.
ht: Rekòmanse jwèt.

source: This is the switch to *Edit game*. Create a new game or edit the current game.
ht: Sa a se chanjman an * Edit jwèt *. Kreye yon jwèt nouvo oswa edite jwèt la aktyèl.

source: The *Edit game* mode icons are grayed out.
ht: * Edit jwèt * mòd ikon yo yo grize soti.

source: grayed out.
ht: grize soti.

source: Stop, or close the Activity.
ht: One Stop, oswa fèmen aktivite a.

source: Creating a Game
ht: Kreye yon jwèt

source: Pressing the *Edit game* button, results in editing the existing game. If you open Memorize from *Resume*, that is, an existing named file, and press the *Edit game* button, you will change that file, and the older file will be overwritten in the :doc:`/journal`. In this case the older game is lost.
ht: Peze * a Edit jwèt * bouton, rezilta nan koreksyon jwèt la ki deja egziste. Si ou louvri Memorize soti nan * Kourikouloum-vite *, se sa ki, yon rele dosye ki deja egziste, ak laprès bouton an * * Edit jwèt, ou pral chanje ke dosye, epi yo pral dosye a pi gran dwe ranplase nan: doc la: `/ journal`. Nan ka sa a se jwèt la pi gran pèdi.

source: To create a fresh game, open Memorize, from the Home View, *Start new*. Press the Activity tab. Type in a name for the game.
ht: Pou kreye yon jwèt fre, louvri Memorize, ki soti nan View nan Kay, * Kòmanse nouvo *. Peze tab la Aktivite. Tape nan yon non pou jwèt la.

source: Memorize will remind you of this difference in behavior. If you rename an existing game, and then press the *Clear all tiles* button, you will be prompted *Do you want to ...* . If you press *Clear*, this will overwrite the previous game in your Journal. (You cannot overwrite a demo game itself. The demo games will always be there if you choose to edit a demo game, and clear its tiles.)
ht: Memorize pral fè ou sonje nan diferans sa a nan konpòtman. Si ou chanje non yon jwèt ki egziste deja, ak Lè sa a peze * Klè nan tout mozayik * bouton, ou pral mande * ou vle. . . *. Si ou peze * Klè *, sa a pral recouvrir jwèt la anvan nan jounal ou. (Ou pa ka recouvrir yon jwèt Demo tèt li. Jwèt yo Demo ap toujou la si w chwazi edite yon jwèt Demo, epi ki klè mozayik li yo. )

source: It is good if you have some image files in your Journal, or on a USB stick. If none are available you could make some with Paint, see the tutorial below.
ht: Li ta pi bon si ou gen kèk dosye imaj nan jounal ou, oswa sou yon moso bwa USB. Si okenn ki disponib ou te kapab fè kèk nan yo ak penti, gade leson patikilye ki anba la a.

source: This image shows a game being created. The right side, represents the new contents for the gameboard. So far we have Tux and his image. The left side represents the work space. A picture of a sunset has been selected from the Journal, and the text "Sunset" has been entered into the box marked *Text:*. The cursor has selected *Add new pair*, and when pressed, the new pair will transfer to the gameboard section on the right.
ht: Imaj sa a montre yon jwèt yo te kreye. Bò dwat la, reprezante sa ki nouvo pou gameboard la. Se konsa, lwen nou gen Shamokin ak estati li a. Bò gòch la reprezante espas ki la travay. Yon foto nan yon solèy kouche te chwazi soti nan Journal la, e li te tèks la "Sunset" te antre nan ti bwat la make * Tèks: *. Te kurseur la chwazi * Add pè nouvo *, ak ki lè bourade, pè a nouvo yo pral transfere nan seksyon an gameboard sou bò dwat la.

source: **Toolbar tabs and buttons in Edit game do the following:**
ht: ** Onglè Toolbar ak bouton an Edit jwèt bagay sa yo: **

source: Activity tab, name the game, access the Journal, to provide a description, and select Private, or My Neighbourhood, see :ref:`Sharing`.
ht: Tab pou Aktivite, non jwèt la, aksè Journal la, bay yon deskripsyon, epi chwazi Prive, oswa Katye mwen, wè: ref: `Sharing`.

source: *Play* buttons are grayed out while in *Edit game* mode.
ht: * Jwe * bouton yo grize soti pandan ke yo nan * Edit jwèt * mòd.

source: This button is now marked to switch back to *Play* mode.
ht: Se bouton Sa a kounye a make chanje tounen nan * Jwe * mòd.

source: Switch between Match different tiles, and Match identical tiles.
ht: Chanje ant Koresponn ak twil diferan, ak Koresponn ak twil ki idantik.

source: Switch between Grouped tiles game, and Ungrouped game.
ht: Chanje ant Gwoupe mozayik jwèt, ak An degrennen jwèt.

source: Clear all tiles.
ht: Klè tout mozayik.

source: Match different tiles
ht: Koresponn ak twil diferan

source: Match identical tiles
ht: Match mozayik ki idantik

source: Grouped tiles game
ht: Gwoupe mozayik jwèt

source: |icon-gray|
ht: | Icon-gri |

source: Ungrouped game
ht: An degrennen jwèt

source: Clear all tiles
ht: Klè tout mozayik

source: If you look to the top of the toolbar in our example above, you will see this game is a *Match different tiles* and an *Ungrouped game*.
ht: Si ou gade nan tèt la nan ba ikòn nan nan egzanp nou an pi wo a, ou pral wè jwèt sa a se yon * Koresponn ak twil diferan * ak yon jwèt * An degrennen *.

source: Looking at the image below starting from top left, clockwise, shows some of the steps in selecting contents for the game. In the first image **1** within the work space are the *Add item* buttons. The *Insert picture* button has been used to open the Journal, and select a Tux image.
ht: Gade nan imaj ki anba a kòmanse nan gòch anwo, goch, montre kèk nan etap sa yo nan chwazi sa pou jwèt la. Nan imaj la premye ** 1 ** nan espas ki la travay yo se * Add atik * bouton sa yo. Te * Antre foto * Bouton an te itilize yo louvri jounal la, epi chwazi yon imaj Shamokin.

source: Next **2** the text "Tux" was entered in the text box, and also the *Speak text* icon was selected. Now, the two tiles are ready to *Add as new pair* to the gameboard section on the right.
ht: Next ** 2 ** te tèks la "Shamokin" antre nan ti bwat la tèks, epi tou li * Pale tèks * icon te chwazi a. Koulye a, de twil yo yo pare yo * Add pè kòm nouvo * nan seksyon an gameboard sou bò dwat la.

source: With all the images loaded **3** press *Play*, the hovering cursor reveals *Play game*. The final image **4** shows the game in play. Notice that when the *Pronounce text* button has been selected Speak's eyes watch play.
ht: Ak tout imaj yo chaje ** 3 ** laprès * Jwe *, kurseur a elikopte revele * Jwe jwèt *. Imaj la final ** 4 ** montre jwèt la nan jwe. Remake je lè gen bouton an * * pwononse tèks te chwazi Pale nan gade jwe.

source: **The add item buttons, within the work space:**
ht: ** Bouton sa yo atik ajoute, nan espas ki la travay: **

source: This image shows just the left side of the screen, the work space.
ht: Imaj sa a montre jis bò gòch nan ekran an, espas ki la travay.

source: The Preview will show the new tile, like this, with no content, or with whatever has been selected.
ht: Preview a ap montre mozayik nan nouvo, tankou sa a, ki pa gen okenn kontni, oswa ak tou sa te chwazi.

source: Text can be entered directly into the box under *Text:*.
ht: Ka Tèks dwe antre dirèkteman nan ti bwat la anba * Tèks: *.

source: Insert picture, opens Journal or attached media in Image search.
ht: Foto Antre, ouvè Journal oswa medya tache nan rechèch imaj.

source: Insert sound file, opens Journal or attached media in Audio search.
ht: Antre dosye son, ouvè Journal oswa tache medya nan Audio rechèch.

source: Pronounce text during tile flip
ht: Pwononse tèks pandan mozayik baskile

source: Select font.
ht: Chwazi font.

source: *Add:* This will add the current "pair" in the work space, to the gameboard section on the right.
ht: * Add: * Sa a pral ajoute aktyèl "pè a" nan espas travay la, nan seksyon an gameboard sou bò dwat la.

source: *Update:* This will bring a selected pair, from gameboard section on the right, back into the work space, where changes can be made.
ht: * Mete ajou: * sa a pral pote yon pè chwazi, nan seksyon gameboard sou bò dwat la, tounen nan espas travay la, kote chanjman ki kapab fèt.

source: Tutorials
ht: Leson patikilye

source: Create a Color Game
ht: Kreye yon Jwèt Koulè

source: In this tutorial, you will learn how to create and play a Memorize Activity matching colors. This is a *Match identical tiles* game. You will learn how to upload an image and add text.
ht: Nan Tutorial sa a, ou pral aprann ki jan yo kreye ak jwe yon aktivite Memorize matche koulè. Sa a se yon * Koresponn ak twil ki idantik * jwèt. Ou pral aprann ki jan yo Upload yon imaj epi ajoute tèks.

source: Before beginning, save eight color fills using the Paint activity. In Paint, use the Bucket tool to fill the whole space with a color, and name and save the image. The color image saved from the Paint activity is in rectangular in shape. The Memorize activity uses a square picture image aligned from the upper left.
ht: Anvan nan konmansman, sove uit koulè plen lè l sèvi avèk aktivite a Penti. Nan penti, sèvi ak zouti nan bokit yo ranpli espas ki la tout antye ak yon koulè, ak non, epi sove imaj la. Imaj la koulè sove soti nan aktivite a se nan penti rektangilè nan fòm. Aktivite a Memorize sèvi ak yon imaj foto kare ki aliyen soti nan bò gòch a anwo.

source: Open Memorize, from the Home View, *Start new*. (If you open Memorize from *Resume* in your Journal, that is, an existing named file, you will change that file, and the older file will be overwritten in the Journal.)
ht: Open Memorize, ki soti nan View nan Kay, * Kòmanse nouvo *. (Si ou louvri Memorize soti nan * Kourikouloum-vite * nan jounal ou, ki se, se yon rele ki deja egziste dosye, ou pral chanje ke dosye, epi yo pral dosye a pi gran dwe ranplase nan jounal la. )

source: Press the Activity tab.
ht: Peze tab la Aktivite.

source: Type in a name for this game.
ht: Tape nan yon non pou jwèt sa a.

source: Click the *Edit game* button.
ht: Klike sou * a Edit jwèt * bouton.

source: Press *Match identical tiles*.
ht: Press * Koresponn ak twil ki idantik *.

source: Press to choose either a *Grouped tiles game,* or an *Ungrouped game.*
ht: Press yo chwazi swa yon * Gwoupe mozayik jwèt, * oswa yon jwèt * An degrennen. *

source: Insert Pictures and Text like this:
ht: Antre Foto ak tèks tankou sa a:

source: Working in the work space, which will now only have one tile pane,
ht: K ap travay nan espas travay la, ki pral kounye a sèlman gen yon sèl mozayik fenèt,

source: Click *Insert picture*.
ht: Klike sou * Antre foto *.

source: Select and click the image file with your color from the Journal.
ht: Chwazi ak klike sou dosye a imaj ak koulè ou soti nan Journal la.

source: Type in the name of the color you just chose in the *Text:* box.
ht: Kalite nan non la nan koulè a ​​ou jis te chwazi nan tèks la *: * bwat.

source: Click *Add as new pair*. A new pair of tiles are displayed on the right side, the gameboard section.
ht: Klike sou * Add kòm nouvo pè *. Yon pè nouvo sou mozayik parèt sou bò dwat la, seksyon an gameboard.

source: Repeat steps until all pairs are added.
ht: Repete etap jiskaske tout pè yo te ajoute.

source: Now to play the game, click the *Play* button.
ht: Koulye a, yo jwe jwèt la, klike sou bouton an * * Jwe.

source: Create a Sound Game
ht: Kreye yon jwèt Sound

source: In this tutorial, you will learn how to create and play a Memorize Activity matching pictures and sounds. The tiles are grouped meaning all the pictures are numbered '1' tiles while the sounds are numbered '2' tiles. You will learn how to upload an image and upload a sound. Before beginning, save eight pictures using the Browse activity, and eight matching sound files. The files can be on a USB stick or in your Journal.
ht: Nan Tutorial sa a, ou pral aprann ki jan yo kreye ak jwe yon aktivite Memorize matche foto ak son. Twil yo yo gwoupe sa vle di tout foto yo yo nimewote mozayik '1' pandan y ap son yo yo nimewote '2' mozayik. Ou pral aprann ki jan yo Upload yon imaj ak Upload yon son. Anvan nan konmansman, sove lè l sèvi avèk uit foto aktivite a Browse, ak wit matche dosye son. Dosye yo kapab sou yon baton USB oswa nan jounal ou.

source: Open Memorize, from the Home View, *Start new*.
ht: Open Memorize, ki soti nan View nan Kay, * Kòmanse nouvo *.

source: Click on *Grouped tiles game.*
ht: Klike sou * Gwoupe mozayik jwèt. *

source: Click on *Match different tiles*.
ht: Klike sou * Koresponn ak twil diferan *.

source: Working in the work space, now with two tile panes.
ht: K ap travay nan espas travay la, kounye a ak de vitraj mozayik.

source: In the first tile pane:
ht: Nan premye mozayik fenèt la:

source: Insert a picture file as above. If you add text too, it will be printed over your picture.
ht: Antre yon dosye foto kòm pi wo a. Si ou ajoute tèks tou, li ap enprime sou foto ou.

source: In the second tile pane:
ht: Nan dezyèm mozayik fenèt la:

source: Click *Insert sound*. Select either the Journal or the media where you stored your sound files.
ht: Klike sou * Antre son *. Chwazi swa jounal la oswa medya a kote ou estoke dosye son ou.

source: Select and click the file name.
ht: Chwazi ak klike sou non an dosye.

source: Click *Add as new pair*. The new pair of tiles are displayed on the right side.
ht: Klike sou * Add kòm nouvo pè *. Yo pè nan nouvo nan mozayik parèt sou bò dwat la.

source: Create a Spelling Game
ht: Kreye yon jwèt òtograf

source: First create a spelling list.
ht: Premye kreye yon lis òtograf.

source: Open Activity Record.
ht: Louvri Dosye Aktivite.

source: Choose the Audio tab of Record.
ht: Chwazi tab la Audio nan Dosye.

source: Set the duration (upper right corner of the Record interface) to, say, 15 seconds.
ht: Mete dire a (kwen anwo dwa nan koòdone nan Dosye) nan, di, 15 segonn.

source: Click the Record button.
ht: Klike sou bouton an Dosye.

source: Say the first word of your spelling list.
ht: Di mo an premye nan lis òtograf ou.

source: Click the Record button again.
ht: Klike sou bouton an Dosye ankò.

source: Wait, while the Record Activity saves your sound clip.
ht: Rete tann, pandan y ap aktivite nan Dosye sove clip son ou.

source: Say the next word on your list.
ht: Di pawòl Bondye a pwochen sou lis ou a.

source: Click the Record button to save your clip.
ht: Klike sou bouton an Dosye pou konsève pou clip ou.

source: Record and save the rest of the spelling words on your list.
ht: Dosye ak sove rès la nan mo sa yo òtograf sou lis ou a.

source: Now in Memorize.
ht: Koulye a, nan Memorize.

source: Select *Edit game*.
ht: Chwazi * Edit jwèt *.

source: Click on *Ungrouped game.*
ht: Klike sou * jwèt An degrennen. *

source: Use *Insert sound* to add your first recording to the first tile. In the second tile enter the word to match your sound file.
ht: Sèvi ak * Antre son * ajoute premye anrejistreman ou a mozayik nan premye. Nan dezyèm mozayik la antre nan pawòl Bondye a ki matche ak dosye son ou.

source: Proceed adding sounds on the first tile, with matching words on the second tile.
ht: Kontinye ajoute son sou mozayik la an premye, ak matche mo sou dezyèm mozayik la.

source: Sharing
ht: Pataje

source: To play these games with users on more than one XO, so that the turn moves from one user to the other when a user fails to make a matching selection:
ht: Pou jwe jwèt sa yo ak itilizatè sou plis pase yon XO, se konsa ke vire mouvman yo soti nan yon itilizatè nan lòt la lè yon itilizatè echwe yo fè yon seleksyon matche:

source: Open the Memorize activity and load the game you want to share on the main XO
ht: Louvri aktivite a Memorize ak chaj jwèt la ou vle pataje sou XO prensipal la

source: Click on the Activity tab, and click on the Home View button |Home_key_f3_small| so that it turns into the My Neighborhood button |Neighborhood_key|
ht: Klike sou tab la pou Aktivite, epi klike sou bouton an Kay View | Home_key_f3_small | konsa ke li vin nan bouton an Neighborhood mwen | Neighborhood_key |

source: All the other XOs will see the Memorize activity icon close to your XO symbol on their Neighborhood View.
ht: Tout lòt XO yo pral wè icon a Memorize aktivite fèmen nan senbòl XO ou sou View katye yo.

source: They can then join the activity by moving their cursor over the game icon.
ht: Lè sa a, Yo ka rantre nan aktivite a pa deplase kurseur yo sou icon nan jwèt.

source: |more| For further information, please see the page :doc:`/collaborating`
ht: | Plis | Pou plis enfòmasyon, tanpri al gade paj: doc la: `/ collaborating`

source: Extending
ht: Pwolonje

source: There is a rich set of opportunities for extending these games. Memorize could be used in history, biology, music, science, early reading, mathematics and others. The media objects available in Sugar, such as sound files and images, as well as all the media objects available by transfer from a USB, or the internet, mean that this game can be powerful in many educational areas.
ht: Gen yon seri moun rich nan opòtinite pou pwolonje jwèt sa yo. Memorize te kapab itilize nan istwa, byoloji, mizik, syans, lekti byen bonè, matematik ak lòt moun. Objè yo medya disponib nan Sugar, tankou dosye son ak imaj, osi byen ke tout medya yo objè ki disponib pa transfè soti nan yon USB, oswa entènèt la, vle di ke jwèt sa a kapab pwisan nan anpil zòn edikasyon.
