Repository: tony37/sledhelp
Catalog: translated_po/ht/musickeyboard.po
Languages: ht

source: Music Keyboard
ht: Klavye Mizik

source: About
ht: Sou

source: This activity display a piano keyboard in the screen and can be used to play music selecting sounds from different instruments. In devices with touch screen, can be used touching the screen, in devices without one, the laptop keyboard can be used.
ht: Aktivite sa a montre yon klavye pyano nan ekran an epi yo ka itilize yo jwe chwazi mizik son soti nan enstriman mizik diferan. Nan aparèy ak manyen ekran, kapab itilize manyen ekran an, nan aparèy san yo pa yon sèl, ka klavye a laptop dwe itilize.

source: The piano widget trigger events for every key pressed/released, and is designed to be easily included in other activities.
ht: Evènman yo pyano widje deklanche pou chak kle bourade / lage, ak se fèt yo dwe fasil pou enkli nan lòt aktivite.

source: How to use Music Keyboard
ht: Kouman yo itilize Mizik klavye

source: By clicking on the small "Q" at the top of the screen, the user can set the on-screen keyboard to show the letters and numbers of the corresponding notes on the QWERTY keyboard. This is very helpful for XOs without a touch screen. It should help eliminate the confusion children who have had piano lessons encounter when, for example, the Qwerty C key plays the musical note of E or the Qwerty B key plays the musical note of G. Users can easily see the Qwerty keyboard relationship with this version running.
ht: Pa klike sou ti "K a" nan tèt la nan ekran an, itilizatè a ka mete klavye a sou ekran yo montre lèt yo ak nimewo nan nòt yo ki koresponn sou klavye a kvèrti. Sa a se trè itil pou XO san yo pa yon manyen ekran. Li ta ede elimine konfizyon timoun yo ki te gen leson pyano rankontre lè, pou egzanp, kle a kvèrti C jwe nòt la mizik nan E oswa kle a kvèrti B jwe nòt la mizik nan G. Itilizatè yo ka fasilman wè relasyon ki klavye kvèrti ak sa a vèsyon kouri.

source: For countries, such as the USA and and some European countries where the 7th note is sung as "Ti", you simply click on the "TI" button!
ht: Pou peyi, tankou USA a ak ak kèk peyi Ewopeyen ki kote nòt la 7th chante chante kòm "Ti", ou tou senpleman klike sou "TI" bouton an!

source: Of course, some people will want the letter names of the notes, and clicking on the "C" button will magically switch to the letter names of the notes.
ht: Natirèlman, gen kèk moun ki pral vle non yo lèt nan nòt yo, epi klike sou "C" bouton an pral maji chanje nan non yo lèt nan nòt yo.

source: Finally, for purists (best on a touch screen) all note names can be eliminated by clicking on the "X," giving just a plain, standard keyboard.
ht: Finalman, pou purist (pi bon sou yon ekran taktil) tout non nòt ka elimine pa klike sou "X a," bay jis yon plenn, estanda klavye.

source: Other small, but important details are the inclusion of the enharmonic names of the "black" keys, for example, A# and Bb are both marked on the same key because, on a keyboard, they sound exactly the same.
ht: Lòt ti, men enpòtan detay yo enklizyon de non yo enharmonic nan kle yo "nwa", pou egzanp, yo A # ak Bb tou de make sou kle a menm paske, sou yon klavye, yo son ekzakteman menm bagay la.

source: Thirty-three instruments are available for choice, and while they don't sound exactly like the instruments they represent, they are close enough to make it interesting to try different sounds.
ht: Trant-twa enstriman ki disponib pou chwa, ak pandan ke yo pa son egzakteman menm jan ak enstriman mizik yo yo reprezante yo, yo se tou pre ase yo fè li enteresan eseye diferan son.

source: `Activity page in our activities portal <http://activities.sugarlabs.org/sugar/addon/4654>`_
ht: `Paj Aktivite nan aktivite nou Portal <http: // aktivite. sugarlabs. org / sik / addon / 4654> `_

source: References
ht: Referans

source: `Wiki Page <http://wiki.sugarlabs.org/go/Activities/Music_Keyboard>`_
ht: `Wiki Page <http: // wiki. sugarlabs. org / ale / Aktivite / Music_Keyboard> `_

source: Repositories
ht: Zarchiv

source: `The Music Keyboard repository <https://github.com/godiard/music-keyboard-activity>`_
ht: `Repozitwa nan klavye Klas Mizik <https: // GitHub. com / godiard / mizik-klavye-aktivite> `_

source: `The Tam Tam repository <https://git.sugarlabs.org/tamtam>`_
ht: `Repozitwa nan Tam Tam <https: // git. sugarlabs. org / tamtam> `_

source: Note the master branch in the Tam Tam repository is where the port to Gtk3 started, but is not finished. If you want generate a usable activity, should use the branch sugar-0.94
ht: Remake byen branch lan mèt nan depo a Tam Tam se kote pò a Gtk3 te kòmanse, men se pa fini. Si ou vle jenere yon aktivite ka itilize, ta dwe itilize branch sik-0 a. 94
