Repository: tony37/sledhelp
Catalog: translated_po/ht/neighborhood_view.po
Languages: ht

source: Neighborhood View
ht: Katye View

source: Neighborhood View: Connecting to the Internet
ht: Katye View: Konekte sou entènèt la

source: You can use the Neighborhood View to connect to the Internet and to collaborate with others.
ht: Ou kapab sèvi ak View Katye pou konekte avèk entènèt la ak yo kolabore ak lòt moun.

source: To see the Neighborhood View, click the Neighborhood icon on the Frame. You can also use the Neighborhood button for this purpose if your keyboard has one, or press the F1 key.
ht: Pou wè View la Katye, klike sou ikòn Katye sou ankadreman an. Ou kapab tou itilize bouton an Neighborhood pou objektif sa a si klavye ou gen youn, oswa peze kle a F1.

source: Neighborhood Elements
ht: Eleman Katye

source: Search menu: You can find find people, Activities, or access points (what connects you to the Internet) using the search menu.
ht: Search meni: Ou ka jwenn jwenn moun, Aktivite, oswa pwen aksè (sa ki konekte ou nan entènèt la) lè l sèvi avèk meni an rechèch.

source: Ad-Hoc network icon: An ad-hoc network lets you connect to other computers on a network.
ht: Anons-tanporè rezo icon: Yon rezo anons-tanporè pèmèt ou konekte nan òdinatè lòt sou yon rezo.

source: Access point: WiFi hot spots (Internet access points) appear as circles in the Neighborhood view. If you hover over a circle, the name of the network appears. Each circle has another color inside, the more full the inside color, the better the connection. To connect to a network, click the circle. If the circle shows a lock symbol, expect to enter a key or password. The inside of the circle blinks while your system tries to connect. Once you are connected, an icon for the connection will appear at bottom right of the Frame. To disconnect, hover over the circle, and choose Disconnect on the menu. Or hover over the icon in the Frame, and choose Disconnect there. (OLPC XO-1 Note: The XO-1 laptop has three mesh network channels. By clicking on a mesh icon you join that particular mesh network, and disconnect from an Access point network. The other XO icons are shown will change according to who is on that network.)
ht: Aksè pwen: fil tach cho (pwen aksè nan Entènèt) parèt kòm ti sèk nan gade nan Katye. Si ou hover sou yon sèk, non an nan rezo a parèt. Chak sèk gen yon lòt koulè andedan, plis plen koulè a ​​nan andedan, pi bon an koneksyon a. Pou konekte nan yon rezo, klike sou sèk la. Si ti sèk ki montre yon senbòl fèmen, atann yo antre nan yon kle oswa modpas. Anndan an nan sèk la flache pandan y ap sistèm ou a ap eseye konekte. Yon fwa ou yo ki konekte, yon icon pou koneksyon la ap parèt sou bò dwat anba nan ankadreman an. Dekonekte, hover sou sèk la, epi chwazi Dekonekte sou menu an. Oswa hover sou icon nan nan ankadreman an, epi chwazi Dekonekte gen. (OLPC XO-1 Remak: laptop XO a-1 gen twa chanèl rezo may. Pa klike sou yon icon may ou rantre nan ke rezo may patikilye, ak dekonekte soti nan yon pwen rezo Aksè. Lòt Icônes XO yo montre pral chanje dapre ki moun ki sou ke rezo. )

source: Shared Activities: Shared Activities appear as icons in the Neighborhood View and you can join them by clicking the corresponding icon.
ht: Pataje Aktivite: Pataje Aktivite parèt kòm ikon nan gade nan Katye epi ou ka rantre nan yo pa klike icon nan korespondan.

source: XO icon: Other Sugar users appear as XO icons. By hovering over them, you can discover the nickname of that person and can add them as a friend or invite them to join you in a shared Activity.
ht: XO icon: Lòt itilizatè Sugar parèt kòm ikon XO. Pa elikopte sou yo, ou ka dekouvri tinon a nan moun sa a epi yo ka ajoute yo kòm yon zanmi oswa envite yo rantre nan ou nan yon aktivite Pataje.

source: Open access point: An access point which isn't protected by a password.
ht: Louvri pwen aksè: Yon pwen aksè ki pa pwoteje pa yon modpas.

source: Connected networks: Once the computer has connected to a network
ht: Konekte rezo: Yon fwa gen òdinatè a ki konekte nan yon rezo
