Repository: tony37/sledhelp
Catalog: translated_po/ht/opening_the_xo.po
Languages: ht

source: Opening the XO
ht: Ouvèti XO a

source: You can open, flip, and close the XO to position it in different ways.
ht: Ou kapab louvri, baskile, epi fèmen XO a nan pozisyon li nan diferan fason.

source: To open the XO
ht: Pou ou kapab louvri XO a

source: Position the laptop with the handle away from you, and then rotate both of the antennae towards you.
ht: Pozisyon laptop a ak manch lan lwen ou, ak Lè sa a vini youn apre lòt tou de nan antèn la nan direksyon pou ou.

source: Lift the front edge of the top of laptop, and then move the top upward away from you. You can hear and feel a slight click as you first lift the top.
ht: Leve kwen an devan nan tèt la nan laptop, ak lè sa a deplase tèt la anwo lwen ou. Ou ka tande epi yo santi yon ti tay klike kòm ou premye leve tèt la.

source: To flip the XO
ht: Baskile XO a

source: You can switch the XO so that the screen lies flat and covers the keyboard. This lets you handle the gamepad buttons more easily or read electronic books (ebooks), using the arrow buttons to page forward and backward.
ht: Ou ka chanje XO a pou ke ekran an bay manti plat epi kouvri klavye a. Sa a pèmèt ou okipe bouton sa yo gampad pi fasil oswa li liv elektwonik (Ebooks), lè l sèvi avèk bouton sa yo flèch nan paj devan dèyè.

source: Bring the display up to a 90-degree angle and rotate the antennae down.
ht: Pote ekspozisyon an jiska yon ang 90-degre ak Thorne antèn la desann.

source: Rotate the display 180 degrees until it is facing backwards.
ht: Vini youn apre lòt ekspozisyon an 180 degre jouk li ap fè fas a bak.

source: Fold the display down onto the keyboard.
ht: Pliye ekspozisyon an desann sou klavye a.

source: Press the rotate key to orient the display.
ht: Peze kle a Thorne oryante ekspozisyon an.
