Repository: tony37/sledhelp
Catalog: translated_po/ht/paint.po
Languages: ht

source: Paint
ht: Penti

source: About
ht: Sou

source: This Activity allows users to create paintings or drawings. It can also be used to edit images created by other Activities and the images it creates can be imported into some Activities.
ht: Aktivite sa a pèmèt itilizatè yo kreye penti oswa desen. Li kapab tou itilize yo edit imaj kreye pa lòt Aktivite ak imaj yo li kreye ka enpòte nan kèk aktivite.

source: Using
ht: Lè l sèvi avèk

source: You can start a new project by selecting *Start new* from the :doc:`/home_view` or open an existing Paint project in the :doc:`/journal`. By default, when you click on Paint in Home View, you will resume your last project.
ht: Ou ka kòmanse yon nouvo pwojè pa chwazi * Kòmanse nouvo * nan: doc la: `/ home_view` oswa louvri yon pwojè Penti ki deja egziste nan: doc la:` / journal`. Pa default, lè ou klike sou penti nan Kay View, ou pral rezime dènye pwojè ou.

source: Paint main tool bar
ht: Penti prensipal ba zouti

source: The tool bar top row contains buttons to open each of the following tabs.
ht: Zouti ba tèt ranje a gen bouton yo louvri chak nan onglè sa yo.

source: Activity tab. The Activity tab is open, and the project has been given a name.
ht: Tab aktivite. Tab la aktivite se ouvè, e li te pwojè a te bay yon non.

source: Brush properties.
ht: Pwopriyete Bwòs.

source: Brush.
ht: Bwòs.

source: Shapes.
ht: Fòm.

source: Shapes properties.
ht: Fòm pwopriyete.

source: Text tab.
ht: Tab Tèks.

source: Images Tab.
ht: Imaj Contenu.

source: Stop, or close Activity.
ht: Stop, oswa aktivite fèmen.

source: Explanation of tabs or tool bars in more detail.
ht: Eksplikasyon sou onglè oswa ba zouti nan plis detay.

source: The Activity tab
ht: Tab an aktivite

source: Activity tab. In the first field name the page or project. The Description button, the "pencil and book" icon, allows you to add a description to the :doc:`/journal` entry. Try to get in the habit of re-naming the project before you start work. Move the cursor over the existing title, click the left mouse button, and start typing a name for the project. Your new name will overwrite the original.
ht: Tab aktivite. Nan jaden an premye non paj la oswa pwojè. Bouton an Deskripsyon, "kreyon ak liv" icon an, pèmèt ou ajoute yon deskripsyon nan: doc la: `/ antre journal`. Eseye jwenn nan abitid la nan re-nonmen pwojè a anvan ou kòmanse travay. Deplase kurseur a sou tit la ki deja egziste, klike sou bouton an sourit gòch, ak kòmanse sezisman yon non pou pwojè a. Nouvo non ou pral recouvrir orijinal la.

source: The collaboration button is grayed out, see :ref:`Share`.
ht: Bouton an kolaborasyon se grize soti, wè: ref: `Share`.

source: Undo button.
ht: Defèt bouton.

source: Redo button.
ht: Refè bouton.

source: Copy button. This will copy the area selected with the *Select Area* tool to the clipboard. The *Select Area* tool is the bottom item of the Brush tool bar.
ht: Bouton Kopi. Sa a pral kopi zòn nan chwazi ak * chwazi zòn nan * zouti nan papye a. * Chwazi zòn nan * zouti se atik la anba nan Bwòs zouti ba a.

source: Use the *Select Area* tool to crop images, select the area you want, and use the *Copy button* to copy the clipping to the Clipboard. The Clipboard feature is within the Frame in the lower left corner of the screen.
ht: Sèvi ak * chwazi zòn nan * zouti yo rekòt imaj, chwazi zòn nan ou vle, epi sèvi ak * Kopi bouton an * kopi coupure nan clipboard a. Karakteristik nan clipboard se nan ankadreman an nan kwen gòch nan ekran an.

source: To save from the Clipboard, click on the clipping on the Frame, and then select 'Keep' on the menu, which appears. The original image is unchanged and a new *Image clipping* item is saved in the Journal.
ht: Pou konsève pou soti nan clipboard a, klike sou coupure la sou ankadreman an, ak Lè sa a chwazi 'Kenbe' sou menu an, ki parèt. Imaj orijinal la se chanje epi li se yon nouvo * Imaj coupure * atik sove nan jounal la.

source: To retieve from the Clipboard use the Paste button:
ht: Retieve soti nan clipboard a sèvi ak bouton an kole:

source: Paste button. The copied image, which you pick up as an *Image clipping* from the Frame, is pasted in the top left of the work space, and it is already selected, that is under the control of the *Select Area* tool, with which you drag the clipping to the desired place.
ht: Bouton kole. Se imaj la kopye, kote ou ranmase kòm yon coupure * Imaj * soti nan ankadreman an, kopye nan bò gòch a anwo nan espas ki la travay, epi li se deja chwazi, se sa ki anba kontwòl la nan * chwazi zòn nan * zouti, ak ki ou trennen coupure la nan plas la vle.

source: Clear the work space, or clear the selected area if there is an area selected.
ht: Klè espas ki la travay, oswa klè zòn nan chwazi si gen yon zòn chwazi.

source: Brush properties
ht: Pwopriyete Bwòs

source: Changes the color, and other properties of the Brush tools, Brush, Bucket, and Stamp.
ht: Chanje koulè a, ak lòt pwopriyete nan zouti yo Bwòs, Bwòs, bokit, ak Koupon pou Achte.

source: When the stamp tool is selected, Brush properties changes to Stamp properties and it controls the size of the stamp.
ht: Lè l chwazi zouti nan koupon pou achte, pwopriyete Bwòs chanjman nan So pwopriyete ak li kontwole gwosè a nan koupon pou achte a.

source: Brush
ht: Bwòs

source: Brush. Spreads color as you move the cursor over the work space.
ht: Bwòs. Pwopaje koulè jan ou deplase kurseur a sou espas ki la travay.

source: Eraser. Removes color.
ht: Gonm. Retire koulè.

source: Bucket. This will flood, or fill, an enclosed area with color.
ht: Bokit. Sa a pral inondasyon, oswa ranpli, yon zòn ki fèmen ak koulè.

source: Picker. Use this tool to pick up a certain color from the image on the work space. This colour is then used by Brush, Bucket, or Stamp.
ht: Selèkteur. Sèvi ak zouti sa a nan ranmase yon koulè sèten soti nan imaj la sou espas ki la travay. Se koulè sa a Lè sa a, itilize pa Bwòs, bokit, oswa Koupon pou Achte.

source: Stamp. Stamp will repeat a part of the image selected in Select Area.
ht: Koupon pou Achte. Koupon pou Achte pral repete yon pati nan imaj la chwazi nan chwazi zòn.

source: Select Area. A rectangular area is selected by placing the curson at top left of desired area, click left mouse button, draw cursor to bottom right, and release the mouse button.
ht: Chwazi Zòn. Yon zòn rektangilè chwazi pa mete curson la sou bò gòch tèt nan vle zòn, Sur bouton sourit gòch, trase kurseur a dwat anba, ak lage bouton an sourit.

source: Shapes
ht: Fòm

source: Elipse (hold down shift for circle).
ht: Elipse (kenbe desann chanjman pou fè yon sèk).

source: Rectangle (hold down shift for squares).
ht: Rektang (kenbe desann chanjman pou kare).

source: Line.
ht: Liy.

source: Free form.
ht: Gratis fòm.

source: Polygon (number of sides set in Shapes properties).
ht: Poligòn (nimewo nan kote sa mete nan fòm pwopriyete).

source: Heart.
ht: Kè.

source: Parallelogram.
ht: Paralelogram.

source: Arrow.
ht: Flèch.

source: Star (number of points is set in Shapes properties).
ht: Star (kantite pwen se mete nan fòm pwopriyete).

source: Trapezoid.
ht: Trapèz.

source: Triangle.
ht: Triyang.

source: Shapes Properties
ht: Fòm Pwopriyete

source: The color of Shapes *Fill* is set here, while the color of the *border* is set in Brush properties. If the *Fill* box is unchecked, only an outline, or border, is displayed.
ht: Koulè a ​​nan fòm * Ranpli * se mete isit la, pandan y ap koulè a ​​nan fwontyè a * * se mete nan Bwòs pwopriyete. Si ti bwat la * Ranpli * se san limit, se sèlman yon plan, oswa fwontyè, se parèt.

source: Under the *Fill* checkbox, set aspect ratio, and the number of sides of stars and polygons.
ht: Anba Ranpli nan * * toulède kaz, mete rapò aspè, ak nimewo a nan pati yo ki nan zetwal yo ak poligòn.

source: Type. To insert text, press *Type*, move the cursor to the point you want to start typing, click, and insert text with the keyboard. The colour used is set in Brush properties.
ht: Kalite. Insert tèks, pou laprès Kalite * *, deplase kurseur la nan pwen a ou vle kòmanse sezisman, klike sou, ak insert tèks ak klavye a. Se koulè a ​​itilize mete nan pwopriyete Bwòs.

source: Bold switch.
ht: Switch Bold.

source: Italic switch.
ht: Switch italik.

source: Increase or decrease font size.
ht: Ogmante oswa diminye font size.

source: Select font.
ht: Chwazi font.

source: Images Tab
ht: Imaj Contenu

source: Insert picture, opens Journal or attached media in Image search.
ht: Foto Antre, ouvè Journal oswa medya tache nan rechèch imaj.

source: Rotate selected area left.
ht: Vini youn apre lòt chwazi zòn kite.

source: Rotate selected area right.
ht: Vini youn apre lòt chwazi dwat zòn.

source: Horizontal mirror, or flip, selected area.
ht: Kouche plat glas, oswa baskile, chwazi zòn.

source: Vertical mirror, or flip, selected area.
ht: Vètikal glas, oswa baskile, chwazi zòn.

source: Convert selected area from color to gray.
ht: Konvèti chwazi zòn nan koulè nan gri.

source: Invert colors in the selected area. For example black is inverted to white, and similarly, all colors are inverted.
ht: Koulè Invert nan zòn nan chwazi. Pou egzanp se nwa Envèse blan, ak Menm jan an tou, tout koulè yo Envèse.

source: Applying
ht: Aplike

source: Paint is a versatile Activity with many uses such as:
ht: Penti se yon aktivite versatile ak itilizasyon anpil tankou:

source: creating drawings or paintings.
ht: kreye desen oswa penti.

source: creating images for inserting into Write documents.
ht: kreye imaj pou mete nan Ekri dokiman.

source: creating slides for a Portfolio Activity slide show.
ht: kreye glisad pou yon montre glise Portfolio aktivite.

source: creating images for using in other Activities including Turtle Blocks and many more.
ht: kreye imaj pou lè l sèvi avèk nan lòt aktivite ki gen ladan Turtle Blòk ak anpil plis.

source: editing and cropping images made by other Activities including Turtle Blocks and many more..
ht: koreksyon ak imaj cultures fèt pa lòt Aktivite ki gen ladan Turtle Blòk ak anpil plis. .

source: editing and cropping screen shots (take screen shots from the keyboard by pressing the *Alt* key with *1*).
ht: koreksyon ak cultures ekran vaksen (pran vaksen ekran soti nan klavye a pa peze kle a * * Alt ak * 1 *).

source: editing and cropping photos taken with the Record Activity.
ht: koreksyon ak foto cultures pran ak aktivite nan Dosye.

source: Sharing
ht: Pataje

source: Paint does not support sharing. You can use Turtle Blocks for collaborative drawing.
ht: Penti pa sipòte pataje. Ou kapab sèvi ak Turtle blòk pou kolaborasyon desen.

source: You can share the work you have done in Image Viewer.
ht: Ou ka pataje travay la ou te fè nan Viewer Imaj.

source: |more| For further information, please see the page :doc:`/collaborating`
ht: | Plis | Pou plis enfòmasyon, tanpri al gade paj: doc la: `/ collaborating`

source: Extending
ht: Pwolonje

source: take a photo of an animal with Record, crop the image with Paint, use as a custom turtle in Turtle Blocks.
ht: pran yon foto nan yon bèt ak Dosye, rekòt imaj la ak penti, itilize kòm yon tòti koutim nan Turtle blòk.

source: start a school newspaper, take photos with Record, crop with Paint, import them into Write.
ht: kòmanse yon jounal lekòl, pran foto ak Dosye, rekòt ak penti, enpòte yo nan Ekri.

source: do a portfolio of your schoolwork, get screenshots (Alt-1) crop with Paint and add explanatory labels then make a slideshow in Portfolio Activity.
ht: fè yon dosye travay lekòl ou, jwenn Ekran (Alt-1) rekòt ak penti epi ajoute etikèt eksplikasyon lè sa a fè yon Slideshow nan Portfolio aktivite.

source: create a custom Memorize Activity game, create the images in Paint.
ht: kreye yon jwèt Memorize aktivite koutim, kreye imaj yo nan penti.

source: create custom cards for the Dimensions (Visual Match) Activity.
ht: kreye kat koutim pou Dimansyon yo (vizyèl Koresponn ak) aktivite.

source: create custom foods for the Nutrition Activity.
ht: kreye manje koutim pou Aktivite nan Nitrisyon.

source: create custom images for the Labyrinth Activity. Labyrinth is a mind mapping tool.
ht: kreye imaj koutim pou Aktivite nan labirent. Labirent se yon zouti kat tèt ou.

source: create a web page with images from Paint.
ht: kreye yon paj entènèt ak imaj ki soti nan penti.

source: take photos of plants or animals, crop the photos, and label them.
ht: pran foto nan plant oswa bèt, rekòt foto yo, epi mete lejann sou yo.

source: take the output of SimpleGraph and use the *Bucket* (flood-fill tool) to make a multicolored graph.
ht: pran pwodiksyon an nan SimpleGraph epi sèvi ak bokit an * * (inondasyon-ranpli zouti) fè yon graf milti koulè.

source: Developers' information
ht: Enfòmasyon Devlopè '

source: **History**
ht: ** Istwa **

source: **Resources**
ht: ** Resous **

source: `Sources <https://git.sugarlabs.org/projects/paint>`_
ht: `Sous <https: // git. sugarlabs. org / pwojè / penti abazde> `_

source: Where to report problems
ht: Ki kote yo repòte pwoblèm

source: In http://bugs.sugarlabs.org, component Paint.
ht: Nan http: // pinèz. sugarlabs. org, eleman Penti.
