Repository: tony37/sledhelp
Catalog: translated_po/ht/physics.po
Languages: ht

source: Physics
ht: Fizik

source: About
ht: Sou

source: Physics is a physical world simulator and playground. You can add squares, circles, triangles, or draw your own shapes, and see them come to life with forces (think gravity, Newton!), friction (scrrrrape), and inertia (ahh, slow down!).
ht: Fizik se yon similatè mond fizik ak lakou rekreyasyon. Ou kapab ajoute kare, sèk, triyang, oubyen desine fòm pwòp ou a, ak wè yo vini nan lavi ak fòs (panse gravite a, Newton!), Friksyon (scrrrrape), ak inèsi (ahh, ralanti!).

source: Getting to know the tools
ht: Lè w konnen zouti yo

source: This image shows all the tools used for creating objects. Reference the number shown below the tool to learn what it does.
ht: Imaj sa a montre tout zouti yo itilize pou kreye objè. Referans nimewo a yo montre anba a zouti a yo aprann ki sa li fè.

source: Magic Pen Tool:
ht: Magic Pen Zouti:

source: Draw anything and it will appear in the canvas. You can use it to create custom shapes, or a surface. Like a slope.
ht: Trase anyen epi li pral parèt nan twal la. Ou ka sèvi ak li yo kreye fòm koutim, oswa yon sifas. Tankou yon pant.

source: Circle Tool:
ht: Sèk Zouti:

source: You can make circles with it, just drag. Try rolling a circle down a slope.
ht: Ou ka fè ti sèk ak li, jis trennen. Eseye woule yon sèk desann yon pant.

source: Triangle Tool:
ht: Triyang Zouti:

source: You can make equilateral triangles (all sides equal) with this tool. Try making a seesaw by combining a triangle and a rectangle (described below).
ht: Ou kapab fè triyang ekilateral (tout kote egal) ak zouti sa a. Eseye fè yon baskil pa mete ansanm yon triyang ak yon rektang (dekri pi ba a).

source: Rectangle Tool:
ht: Rektang Zouti:

source: For making rectangles.
ht: Pou fè rektang.

source: Polygon Tool:
ht: Poligòn Zouti:

source: You can make multi-sided shapes with this tool. Drag the mouse, then click on place where the vertices of the polygon should be. after you are finished, click in the circle surrounding the first dot you drew and the shape will be drawn.
ht: Ou ka fè fòm milti-sided ak zouti sa a. Trennen sourit la, lè sa a klike sou plas kote somè yo nan poligòn la yo ta dwe. apre w fini, klike sou nan sèk la ki antoure dot an premye ou te trase epi yo pral fòm nan dwe desine.

source: Grab Tool:
ht: Gen tan pwan Zouti:

source: You can move objects around with this tool. You can use it even when the game is running: Try grabbing an object and moving it around. It can be really fun.
ht: Ou ka deplase objè otou ak zouti sa a. Ou ka sèvi ak li menm lè jwèt la ap kouri: Eseye arachman yon objè ak deplase l 'nan. Li kapab reyèlman plezi.

source: When the game is paused, you can use dragging to move objects with more precision. You can also drag pins and motors. When you select the grab tool, the pins and motors will become bigger so that you can easily hold and drag.
ht: Lè se jwèt la Sarepta, ou ka itilize trenen yo avanse objets ak plis presizyon. Ou kapab tou trennen broch ak motè. Lè ou chwazi zouti nan gen tan pwan, broch yo ak motè yo ap vin pi gwo pou ke ou ka fasilman kenbe ak trennen.

source: **ProTip**: You can move motors and pins from one object to another. Also, moving them out of the body and dropping them in empty space deletes them.
ht: ** ProTip **: Ou ka deplase motè ak broch soti nan yon objè nan yon lòt. Epitou, k ap deplase yo deyò nan kò a, epi jete yo nan espas vid yo supresyon.

source: Motor Tool:
ht: Machin Zouti:

source: With this tool, you can place a motor on an object. The object will then start rotating around that point. You can also change the speed with which it rotates, as will be explained in the Palette section.
ht: Avèk zouti sa a, ou ka mete yon motè sou yon objè. Objè a pral Lè sa a kòmanse wotasyon alantou pwen sa. Ou kapab tou chanje vitès la ak ki li wotasyon, menm jan yo pral eksplike nan seksyon an palèt.

source: Pin Tool:
ht: PIN Zouti:

source: This tool allows you to make objects stick to the background and not move around, very much like pinning a paper to a clipboard. Just click where you want to place a pin.
ht: Zouti sa a pèmèt ou fè objè bwa nan background nan epi yo pa fè mouvman, anpil tankou epenglaj yon papye nan yon clipboard. Jis klike kote ou vle mete yon PIN.

source: Joint Tool:
ht: Joint Zouti:

source: With this tool you can attach objects to other objects. Click on the point at which you want to attach the joint in the first object and drag the mouse over to the point at which you want the joint to end on the second object. Done!
ht: Avèk zouti sa a ou ka tache objè yo lòt objè. Klike sou pwen an nan ki ou vle mete jwenti a nan objè a premye ak trennen sourit la sou nan pwen an nan ki ou vle jwenti a nan fen sou objè a dezyèm. Fè!

source: Rope Tool:
ht: Zouti kòd:

source: Joints are like iron bars, they cannot bend. If you need rope, this tool does it for you. Just click and drag to make the rope. Be careful though, removing ropes once they have been made can be difficult.
ht: Jwenti yo tankou ba fè, yo pa ka pliye. Si ou bezwen kòd, zouti sa a fè li pou ou. Jis Sur Et faites yo fè kòd la. Fè atansyon menm si, retire yon fwa yo kòd yo te fè ka difisil.

source: Trace Tool:
ht: Trace Zouti:

source: Want to see how and where an object is moving? Put a tracer on it! Select this tool and click on the point on the object you want to trace. You can delete a tracer by left clicking with the destroy tool (below)
ht: Vle wè ki jan ak ki kote yon objè ap deplase? Mete yon reje sou li! Chwazi zouti sa a, epi klike sou pwen an sou objè a ou vle trase. Ou ka efase yon reje pa klike gòch ak zouti nan detwi (anba a)

source: Destroy Tool:
ht: Detwi Zouti:

source: Select this tool and drag to leave a trail of destruction behind! You not only use this tool to destroy objects, but also pins, motors and tracers. A single left click deletes one pin/motor/tracer on the object. Since ropes are just small balls joined with small joints, you can try deleting them too, but it takes time and is mildly annoying. Therefore try to make rope only when you are sure you want it.
ht: Chwazi zouti sa a ak trennen yo kite yon santye nan destriksyon dèyè! Ou pa sèlman sèvi ak zouti sa a detwi objè, men tou, broch, motè ak traseur. Yon sèl klike sou bò gòch supresyon yon PIN / motè / reje sou objè a. Depi kòd yo se jis voye boul ti ansanm ak jwenti piti, ou ka eseye efase yo tou, men li pran tan ak se léjèrman anmèdan. Se poutèt sa eseye fè kòd sèlman lè ou se asire w ke ou vle l '.

source: **ProTip**: If you've drawn with a tool before and want multiple copies of the same shape, just do a left-click and the same object with be drawn again. Try it with the Rectangle tool! Draw a square and then left click again, you'll get another copy of the square.
ht: ** ProTip **: Si ou te trase ak yon zouti anvan epi ou vle plizyè kopi fòm la menm, jis fè yon bò gòch-klike sou ak objè a menm ak yo dwe desine ankò. Eseye li ak zouti nan Rektang! Trase yon kare ak Lè sa a, kite klike ankò, ou pral jwenn yon lòt kopi nan kare a.

source: Other cool features
ht: Lòt karakteristik fre

source: Using this button, you can erase everything from the canvas. Careful, you cannot undo this!
ht: Sèvi ak bouton sa a, ou ka efase tout bagay soti nan twal la. Atansyon, ou pa ka defèt sa a!

source: This button allows you to delete all trace marks on the canvas.
ht: Bouton sa a pèmèt ou efase tout mak tras sou twal la.

source: These two buttons allow you to pause or start the game. The first button makes the game start again after a pause and the second stops it. These are ultra useful while building complicated machines, which you cannot build while the machine is running.
ht: Bouton sa yo de pèmèt ou pran yon poz oswa kòmanse jwèt la. Bouton an premye fè jwèt la kòmanse ankò apre yon pran yon poz ak dezyèm la sispann li. Sa yo se ultra itil pandan y ap bati machin konplike, ki ou pa kapab bati pandan y ap machin nan ap kouri.

source: All of the objects have palette menus to adjust object properties:
ht: Tout nan objè yo gen meni palèt yo ajiste pwopriyete objè:

source: feather, wood, and anvil represent light to dense
ht: plim, bwa, ak anklum reprezante limyè a dans

source: basketball, baseball, and bowling ball represent very bouncy to inelastic
ht: baskètbòl, bizbòl, ak boul bowling reprezante trè bouncy elastic

source: Friction
ht: Sibi friksyon

source: ice skate, shoe, and sneaker represent low to high coefficient of friction
ht: monte paten glas, soulye, ak sniker reprezante ba segondè koyefisyan nan friksyon

source: The motor has a palette to set speed (fast and slow) and direction (counter-clockwise and clockwise)
ht: Motè a gen yon palèt yo mete vitès (vit epi ralanti) ak direksyon (counter-goch ak goch)

source: The chain has a palette to set the coarseness and weight of the chain elements
ht: Chèn an gen yon palèt yo mete vulgarité a ak pwa nan eleman yo chèn

source: Ideas to try
ht: Lide eseye

source: Here are some ideas you could try:
ht: Isit la yo se kèk ide ou ta ka eseye:

source: Build a catapult to simulate Angry Birds
ht: Bati yon lans a wòch nan simulation Zwazo fache

source: Build a machine that sorts different sized balls in to two buckets, large and small, with no ball jams.
ht: Bati yon machin ki kalite diferan voye boul gwosè a nan de bokit, gwo ak piti, ki pa gen okenn jams boul.

source: A cyclic mechanism for lifting balls from the bottom of the screen to the top, again and again.
ht: Yon mekanis siklik pou leve voye boul anba nan fon an nan ekran an nan tèt la, ankò e ankò.

source: Try dropping 2 different mass objects at the same time.
ht: Eseye jete 2 diferan objè mas nan menm tan an.

source: Experiment with pendulums of different lengths and masses.
ht: Eksperyans ak pandul ki gen longè diferan ak mas.

source: Ping pong, can you make a device that hits a ball back and forth across the screen?
ht: Ping Pong, ou ka fè yon aparèy ki frape yon boul retounen ak lide nan tout ekran an?

source: Try building a mechanical binary clock.
ht: Eseye bati yon revèy mekanik binè.

source: Convert rotation into parallel motion using pistons.
ht: Konvèti wotasyon nan paralèl mouvman lè l sèvi avèk piston.

source: Experiment with touching one motorised circle against one pinned circle of various sizes.
ht: Eksperyans ak manyen youn sèk motè kont youn sèk estime diferan gwosè.

source: Try building a rag-doll puppet and make it dance in a convincing way.
ht: Eseye bati yon mannken ranyon-poupées, epi fè li danse nan yon fason konvenk.

source: Use just links and circles to make a structurally sound Eiffel Tower.
ht: Sèvi ak jis lyen ak ti sèk fè yon struktural son èifèl Tower.

source: Try building a ratchet mechanism.
ht: Eseye bati yon mekanis klike.

source: Try building an analogue clock face where the min hand goes around 60 times for each hour.
ht: Eseye bati yon figi revèy analogique kote men nan min ale alantou 60 fwa pou chak èdtan.

source: Modify the program itself: `Modifying Physics <http://wiki.sugarlabs.org/go/Activity_Team/Modifing_an_Activity#Modifying_Physics>`_
ht: Modifye pwogram nan tèt li: `Modifye Fizik <http: // wiki. sugarlabs. org / ale / Activity_Team / Modifing_an_Activity # Modifying_Physics> `_
