Repository: tony37/sledhelp
Catalog: translated_po/ht/pippy.po
Languages: ht

source: About
ht: Sou

source: Pippy allows the student to examine, execute, and modify simple Python programs. In addition it is possible to write Python statements to play sounds, calculate expressions, or make simple text based interactive games.
ht: Pippy pèmèt elèv la egzaminen, egzekite, epi modifye pwogram Piton senp. Anplis de sa li se posib yo ekri deklarasyon Piton yo jwe son, kalkile ekspresyon, oswa fè tèks ki senp ki baze jwèt entèaktif.

source: Where to get Pippy
ht: Ki kote yo ka resevwa Pippy

source: Pippy is included in the standard releases of the OLPC software. It is available for download `here <http://activities.sugarlabs.org/en-US/sugar/addon/4041>`_
ht: Pippy se enkli nan degaje yo estanda nan lojisyèl an OLPC. Li se ki disponib pou download `isit la <http: // aktivite. sugarlabs. org / en-US / sik / addon / 4041> `_

source: Using
ht: Lè l sèvi avèk

source: The left column is a list of python programs, which can be viewed, and modified in the upper right window, and where the results of execution are displayed in the lower right window.
ht: Kolòn la kite a se yon lis nan pwogram piton, ki ka wè, ak modifye nan fennèt la anwo dwa, ak ki kote rezilta yo nan ekzekisyon yo ap parèt nan fennèt la pi ba dwa.

source: Learning with Pippy
ht: Aprann ak Pippy

source: Etoys and Turtle art provide easy introduction to programming. Pippy introduces a more traditional view of programming a computer, wherein the instructions are first written to a text file, and then executed with a "run" command.
ht: Etoys ak Turtle atizay bay entwodiksyon fasil pwogram. Pippy entwodui yon View plis tradisyonèl nan pwogramasyon yon òdinatè, kote enstriksyon yo ap premye ekri nan yon dosye tèks, ak Lè sa a egzekite ak yon "kouri" lòd.

source: In particular, it is instructive to play with the sounds:
ht: An patikilye, li se édikatif yo jwe ak son yo:

source: Get the list of sounds by executing the Getsoundlist program
ht: Jwenn lis la nan son pa egzekite pwogram nan Getsoundlist

source: Copy the name of one of the sounds and replace the "digeridu" sound name in Playwave program.
ht: Kopi non an nan youn nan son yo ak ranplase "digeridu a" son non nan pwogram Playwave.

source: Extending Pippy
ht: Pwolonje Pippy

source: If Pippy is used in parallel with the Write Activity, it is possible to develop larger programs. Copy the program that you develop in the Write Activity by selecting all (<ctrl>a) and copying it to the clipboard (<ctrl>c), then switch to the Pippy Activity, and paste (<ctrl>v) it into the code window. If there are errors that you want to correct, you can make the changes in the code window, and immediately see the results of your changes. Then by copying the changed program back to the clipboard, you can paste it back into the Word Activity, and save the changes to the Journal.
ht: Si Pippy se itilize nan paralèl ak ekri aktivite a, li se posib yo devlope pi gwo pwogram. Kopi pwogram nan ke ou devlope nan ekri aktivite a pa chwazi tout (<CTRL> a) ak kopye li nan clipboard a (<CTRL> c), lè sa a chanje nan Pippy aktivite a, ak keratin (<CTRL> v) l 'nan la fenèt Kòd. Si gen erè ke ou vle korije, ou ka fè chanjman sa yo nan fennèt la Kòd, ak imedyatman wè rezilta yo nan chanjman ou. Lè sa a, lè w kopye pwogram nan chanje tounen nan clipboard a, ou ka kole li tounen nan aktivite nan Word, epi sove chanjman yo nan jounal la.

source: Modifying Pippy
ht: Modifye Pippy

source: The student can add small programs, and have them show up in the left column of Pippy by adding files to /home/olpc/Activities/Pippy.activity/data. There is a large number of suggested examples of programs for Pippy at http://wiki.laptop.org/go/Pippy#Examples.
ht: Elèv la ka ajoute pwogram ti, epi fè yo montre moute nan kolòn nan kite nan Pippy pa ajoute dosye nan / Home / OLPC / Aktivite / Pippy. aktivite / done. Gen yon gwo kantite sijere egzanp nan pwogram pou Pippy nan http: // wiki. laptop. org / ale / Pippy # Egzanp.

source: Where to report problems
ht: Ki kote yo repòte pwoblèm

source: There's a range of ways to report problems. The easiest is to email to the sugarlabs email list at sugar-devel@lists.sugarlabs.org. Someone on the list will respond to you, and perhaps also put a formal bug report at http://bugs.sugarlabs.org/.
ht: Genyen yon seri de fason yo repòte pwoblèm. Pi fasil la se voye yon imèl ba nan lis la imel sugarlabs nan lis @ sik-DEVEL. sugarlabs. org. Yon moun sou lis la pral reponn ou, e petèt tou mete yon rapò ensèk fòmèl nan http: // pinèz. sugarlabs. org /.

source: Or you can register at http://bugs.sugarlabs.org/ and enter a bug report yourself.
ht: Oswa ou ka enskri nan http: // pinèz. sugarlabs. org / ak antre nan yon ensèk rapòte tèt ou.
