Repository: tony37/sledhelp
Catalog: translated_po/ht/poll.po
Languages: ht

source: Poll
ht: Biwo Vòt

source: Overview
ht: Apèsi sou lekòl la

source: A poll is a research tool that helps explain what a group of people think about a subject. First you present the group with a question and a set of answer choices. Then each person in the group gets to vote for the answer which best describes their personal feelings or opinion. After collecting votes from the whole group, you look for a pattern in their answers. You can also ask the same question of different groups (i.e. boys and girls or children and adults) and see how each group answers.
ht: Yon manm biwo vòt se yon zouti rechèch ki ede eksplike ki sa yon gwoup moun panse osijè de yon sijè. Premye ou prezante gwoup la ak yon kesyon ak yon seri repons ochwa. Lè sa a, chak moun nan gwoup la vin pou vote pou repons lan ki pi byen dekri santiman pèsonèl yo oswa opinyon. Apre kolekte vote soti nan tout gwoup la, ou gade pou yon modèl nan repons yo. Ou kapab tou mande kesyon an menm nan diferan gwoup (mwen. ak. ti gason ak ti fi oswa timoun ak granmoun) ak wè kòman chak gwoup repons.

source: A poll can be used to help a community make a decision and take action. It can also be used to understand the similarities and differences among individuals and groups of people.
ht: Ou ka jwenn yon biwo vòt dwe itilize yo ede yon kominote pran yon desizyon ak pran aksyon. Li kapab tou itilize yo konprann resanblans ak diferans nan mitan moun ak gwoup moun nan pèp.

source: Polls are a helpful tool for any research project. Use this Poll tool and lesson plans with whatever subject you are studying. It can also be used to make collaborative decisions in the classroom about academic activities and among friends about social issues.
ht: Biwo de vòt yo yo se yon zouti itil pou nenpòt pwojè rechèch. Sèvi ak zouti sa a Biwo Vòt ak leson plan ak tou sa sijè w ap etidye. Li kapab tou itilize pou pran desizyon pou kolaborasyon nan salklas la sou aktivite akademik ak nan mitan zanmi sou pwoblèm sosyal.

source: Skills:
ht: Ladrès:

source: Learn what a poll is and how it works.
ht: Aprann ki sa yon biwo vòt se ak kijan li fonksyone.

source: Learn how to use polls to gather information and make decisions.
ht: Aprann kouman yo sèvi ak biwo vòt nan ranmase enfòmasyon ak pran desizyon.

source: Practice choosing poll subjects.
ht: Pratike chwazi sijè biwo vòt.

source: Learn how to formulate good poll questions and answer choices.
ht: Aprann Kòman pou pou fòmile bon kesyon biwo vòt epi reponn chwa.

source: Practice basic survey skills of data collection, analysis and presentation.
ht: Pratike ladrès debaz sondaj nan koleksyon done, analiz ak prezantasyon.

source: Learn how to use a bar graph to represent votes and opinions.
ht: Aprann kouman yo sèvi ak yon graf an ba ki reprezante vote ak opinyon.

source: Learn how to represent poll results using ratios and percentages.
ht: Aprann Kòman pou pou reprezante rezilta biwo vòt lè l sèvi avèk rapò ak pousantaj.

source: Learn how to help peers understand an idea or an opinion.
ht: Aprann Kòman pou pou ede kamarad klas konprann yon lide oswa yon opinyon.

source: Learn from classmates.
ht: Aprann nan men kamarad klas.

source: Learn how to present poll results and make collaborative decisions based on those results.
ht: Aprann Kòman pou pou prezante rezilta biwo vòt ak pran desizyon ki baze sou rezilta kolaborasyon moun.

source: Practice using new functions and features of the XO Laptop.
ht: Pratike lè l sèvi avèk fonksyon ak nouvo karakteristik nan Laptop nan XO.

source: Participate in a Poll
ht: Patisipe nan yon Biwo Vòt

source: Open the Poll activity from the Sugar Home view.
ht: Louvri aktivite a Biwo Vòt soti nan View la Sugar Kay.

source: A Poll question and answer choices will appear. Read them carefully, then click on your favorite answer. Click the “VOTE” button to submit your answer.
ht: Yon Biwo Vòt kesyon ak repons ochwa ap parèt. Li yo ak anpil atansyon, lè sa a klike sou repons pi renmen ou.

source: After you vote, current Poll results will appear. You will see the exact number of votes cast (so far) for each answer. You will also see a bar graph that shows which answer is currently the most popular among the whole group.
ht: Apre ou fin vote, rezilta Biwo Vòt aktyèl ap parèt. Ou gen pou wè nimewo egzak la nan vote cast (byen lwen tèlman) pou chak repons. Ou pral gen tou wè yon graf an ba ki montre ki repons se kounye a ki pi popilè a nan mitan tout gwoup la.

source: Look at the number of votes next to each answer. Which one has the most votes so far? How many people chose the same answer as you? Which answer do you think will win? Why?
ht: Gade nan nimewo a nan vòt akote chak repons. Ki yon sèl gen vòt yo ki pi byen lwen tèlman? Konbyen moun ki te chwazi repons lan menm jan ou? Ki repons ou panse ki pral genyen? Poukisa?

source: Look at the bar graph. Which answer has the longest bar? What does that mean? Which answer has the shortest bar? What does that mean?
ht: Gade nan graf la ba. Ki repons gen ba la pi long? Ki sa sa vle di? Ki repons gen ba a pi kout? Ki sa sa vle di?

source: Let each person in your group vote in this poll. How did the votes and bar graphs change?
ht: Se pou chak moun nan vòt gwoup ou a nan sa a biwo vòt. Ki jan vòt yo ak graf ba chanje?

source: After everyone votes, discuss the final results. What did you learn from the poll? Were you surprised by the results? How could you use this information?
ht: Apre tout moun vote, diskite sou rezilta final yo. Ki sa ou te aprann nan men biwo vòt la? Eske ou te etone pou rezilta yo? Ki jan ou ka sèvi ak enfòmasyon sa a?

source: Generate a list of ideas for polls. Record your ideas on a blackboard, on paper or in the “Write” program on the XO Laptop. What would you like to learn from each poll you thought of? What would you do with the results?
ht: Jenere yon lis ide pou biwo vòt. Ki sa ou ta renmen aprann ki soti nan chak biwo vòt ou te panse a? Ki sa ou ta fè ak rezilta yo?

source: Build a Poll
ht: Bati yon Biwo Vòt

source: Make a poll of your own! The goal is to build a poll that is interesting to you, and learn to collect votes from people and reach conclusions or make decisions based on your poll.
ht: Fè yon biwo vòt nan pwòp ou a! Objektif la se yo bati yon biwo vòt ki se enteresan yo ou, epi aprann nan kolekte vòt nan men moun, epi rive nan konklizyon oswa pran desizyon ki baze sou biwo vòt ou.

source: Fill in your poll details on the blank form that appears. Type in your poll title, question and answers, and the number of votes you want to collect.
ht: Ranpli nan detay ou biwo vòt sou fòm nan vid ki parèt. Tape nan biwo vòt ou tit, kesyon ak repons, ak nimewo a nan vòt ou vle kolekte.

source: Next type in the number of votes you want to collect in your poll. This number is called a “sample size” by researchers. To do this correctly, think about how many people you want to poll. Is it all of the students in your class? Just the 12-year-olds? All of the people in your family? All of the women in your town?
ht: Next kalite nan nimewo a nan vòt ou vle kolekte nan biwo vòt ou. Pou fè sa kòrèkteman, panse osijè de ki jan anpil moun ou vle biwo vòt. Èske li tout elèv yo nan klas ou a? Jis-timoun ki gen yo 12-ane? Tout moun nan pèp la nan fanmi ou? Tout moun nan fanm yo nan vil ou a?

source: Now type in the “Answer choices,” you want people to choose from. You can offer 2, 3, 4 or 5 answer choices in this poll. In our Favorite Food example, the answer choices could be: 1. Bread, 2. Rice, 3. Beans, 4. Candy, 5. Bananas.
ht: Ou ka ofri 2, 3, 4 oswa 5 repons ochwa nan sa a biwo vòt. Nan nou an Favorite egzanp Manje, repons ochwa yo ta ka: 1. Pen, 2. Rice, 3. Pwa, 4. Sirèt, 5. Bannann.

source: Collect Poll Data
ht: Kolekte Biwo Vòt Done

source: Now that your poll is built, invite people to take your poll on the XO. Walk around with your laptop, and ask people to answer your research question.
ht: Kounye a ke se biwo vòt ou bati a, envite moun yo pran biwo vòt ou sou XO a. Mache nan ak laptop ou, epi mande moun yo reponn kesyon rechèch ou.

source: Decide how you are going to get the information you need. You could read your question and the answer choices to each person and click their answer on your XO. Or, you can show each person how to select your poll from the list, read the poll by themselves and click on their answer choice by themselves.
ht: Deside ki jan ou yo ale nan jwenn enfòmasyon ou bezwen an. Ou te kapab li kesyon ou ak repons ochwa yo nan chak moun, epi klike repons yo sou XO ou. Oswa, ou ka montre chak moun ki jan yo chwazi biwo vòt ou nan lis la, li biwo vòt la nan tèt yo, epi klike sou chwa repons yo nan tèt yo.

source: For best results, each person should vote only once. The Poll will close when you reach the number of your “sample size.”
ht: Pou pi bon rezilta, chak moun ta dwe vote sèlman yon fwa

source: Try to collect votes from the people you originally thought about when you chose the “number of votes to collect.” If it was girls, ask only girls. Otherwise your results will not reflect the group you had in mind.
ht: Sinon rezilta ou pa pwal reflete gwoup la ou te gen nan tèt ou.

source: Remember, you can create the same poll again, and ask different kinds of people to answer each time. It will be very interesting to compare the results of the same question asked to different groups, such as boys and girls or adults and children.
ht: Sonje byen, ou kapab kreye biwo vòt la menm ankò, epi mande diferan kalite moun yo reponn chak fwa. Li pral trè enteresan yo konpare rezilta yo nan kesyon an menm mande yo diferan gwoup, tankou ti gason ak ti fi oswa granmoun ak timoun.

source: Use Data to make Observations and Decisions
ht: Sèvi ak Done fè obsèvasyon ak Desizyon

source: After you have collected the poll data you needed from one or more groups, look at the results and think about what they mean.
ht: Apre ou te ranmase done yo biwo vòt ou te bezwen soti nan youn oswa plis gwoup, gade nan rezilta yo, epi reflechi sou sa yo vle di.

source: Open the Poll activity on your XO and find your poll title on the list. Click the “See Results” button to see how people voted.
ht: Louvri aktivite a Biwo Vòt sou XO ou epi jwenn tit biwo vòt ou sou lis la.

source: Look at the Bar Graphs that represent the votes (results) of your poll. Which answer has the longest bar? What does that mean? Which answer has the shortest bar? What does that mean?
ht: Gade nan graf yo Bar ki reprezante vòt yo (rezilta) nan biwo vòt ou. Ki repons gen ba la pi long? Ki sa sa vle di? Ki repons gen ba a pi kout? Ki sa sa vle di?

source: If you tried your poll with different groups (girls, boys, teachers, students, adults, children, etc.) Open each poll and see if there are any differences.
ht: Si ou te eseye biwo vòt ou an ak diferan gwoup (filles, gason, pwofesè, elèv, granmoun, timoun, elatriye. ) Louvri chak biwo vòt ak wè si gen nenpòt ki diferans.

source: Write down notes about what you see; put your findings on paper or record them with the “Write” activity on your XO. How does this kind of information help you draw conclusions about the people you surveyed? Does the data accurately represent an entire group? Does it matter if you questioned 25 people or 100 people? Why?
ht: Ki jan sa a kalite enfòmasyon ede ou tire konklizyon sou moun yo ou fè sondaj? done yo avèk presizyon reprezante yon gwoup antye? li gen pwoblèm si ou kesyone 25 moun oswa 100 moun? Poukisa?

source: Present you findings to your class, or to the people who took the poll. Tell them what you learned for the poll and discuss the results together. Brainstorm about what could be done with this information.
ht: Prezante ou jwenn nan klas ou, oswa nan moun yo ki te pran biwo vòt la. Di yo sa ou te aprann pou biwo vòt la epi diskite sou rezilta yo ansanm. Brainstorm sou kisa ki ka fè ak enfòmasyon sa a.
