Repository: tony37/sledhelp
Catalog: translated_po/ht/portfolio.po
Languages: ht

source: About
ht: Sou

source: The Portfolio Activity creates a slide show from Sugar Journal entries that have been 'starred'.
ht: Aktivite nan Portfolio kreye yon montre glise soti nan Sugar Journal antre ki te 'joue'.

source: Where to get Portfolio
ht: Ki kote yo ka resevwa Portfolio

source: The Portfolio activity is included in OLPC images and available for download from the `Sugar Activity Library <http://activities.sugarlabs.org/en-US/sugar/addon/4437>`_
ht: Se aktivite a Portfolio enkli nan imaj OLPC epi ki disponib pou download soti nan `<http Sugar Bibliyotèk Aktivite: // aktivite yo. sugarlabs. org / en-US / sik / addon / 4437> `_

source: The source code is available on the `Sugar Labs Gitorious server <http://git.sugarlabs.org/portfolio>`_.
ht: Kòd la sous ki disponib sou `sèvè a Sugar Labs Gitorious <http: // git. sugarlabs. org / dosye> `_.

source: Using
ht: Lè l sèvi avèk

source: Before you launch the activity, use the ☆ on the left of each Journal entry to mark that entry for inclusion in the portfolio. The Portfolio Activity will use the entry title as well as the preview image and description.
ht: Aktivite nan Portfolio pral sèvi ak tit la antre kòm byen ke imaj la aperçu ak deskripsyon.

source: The title text, the preview image, and the description text from Journal entries is used in the portfolio presentations.
ht: Se tèks la tit, imaj la aperçu, ak tèks la deskripsyon soti nan Journal antre yo itilize nan prezantasyon yo dosye.

source: In the Thumbnail View, you can reorder the slides in your presentation by dragging.
ht: Nan gade nan Thumbnail, ou ka reorganized glisad yo nan prezantasyon ou pa trenen.

source: With the Edit-description Button, you can directly edit a Journal entry's description field.
ht: Avèk bouton an Edit-deskripsyon, ou ka dirèkteman edite jaden deskripsyon yon antre Journal la.

source: When running the activity, use the ◀ and ▶ buttons to step one-by-one through the slide show. Use the auto-play button to start/pause a slide show. The delay between slides can be controlled by the interval chosen in the combo box. (The default is 10 seconds.)
ht: Sèvi ak bouton an oto-pou jwe pou yo kòmanse / pran yon poz yon montre glise. Ka reta ki genyen ant glisad dwe kontwole pa entèval an chwazi nan ti bwat la liste. (Default la se 10 segonn. )

source: **Did you know that:**
ht: ** Èske w te konnen: **

source: you can record audio notes for each slide; the notes are played back whenever the slide is viewed;
ht: ou ka dosye nòt odyo pou chak glise; nòt yo yo yo te jwe tounen chak fwa se glise nan wè;

source: the colors used in the background are taken from the XO colors of the user;
ht: koulè yo itilize nan background nan yo te pran soti nan koulè yo XO nan itilizatè a;

source: a warning is displayed if there are no starred entries in your Journal;
ht: se yon avètisman parèt si pa gen okenn antre joue nan jounal ou;

source: the slide show can be saved as an PDF document that can be shared;
ht: ka montre nan glise kapab delivre kòm yon dokiman PDF ki ka pataje;

source: in the thumbnail view, you can reorder your slides (by dragging them); and
ht: nan gade nan thumbnail, ou ka reorganized glisad ou a (nan antrenman yo); ak

source: you can edit the descriptions for each slide (and save your edits to the Journal).
ht: ou ka edit deskripsyon yo pou chak glise (epi sove edits ou nan jounal la).

source: for group projects, try using the Bulletin-board Activity.
ht: pou pwojè gwoup, eseye lè l sèvi avèk aktivite nan Bilten-Komisyon Konsèy.

source: The Toolbars
ht: D yo

source: from left to right
ht: de gòch a dwat

source: **Activity-toolbar Button**
ht: ** Button aktivite-toolbar **

source: (toolbar described below)
ht: (Toolbar dekri pi ba a)

source: **Previous-slide Button**
ht: ** Button Previous-glise **

source: returns to the previous slide shown (also activated by typing <Ctrl-p>)
ht: retounen nan glise anvan an montre (tou aktive pa sezisman <Ctrl-p>)

source: **Next-slide Button**
ht: ** Button Next-glise **

source: goes to the next slide in the sequence (also activated by typing <Ctrl-n>)
ht: ale nan glise nan pwochen nan sekans lan (tou aktive pa sezisman <Ctrl-n>)

source: **Auto-play Button**
ht: ** Button Auto-jwe **

source: starts a slide show with a user-settable pause between each slide
ht: kòmanse yon montre glise ak yon pran yon poz user-reglabl ant chak glise

source: **Customize-toolbar Button**
ht: ** Bouton Customize-toolbar **

source: **Record-toolbar Button**
ht: ** Button Dosye-toolbar **

source: **Portfolio-view Radio Button**
ht: ** Portfolio-view bouton radyo **

source: used to switch to portfolio view (default)
ht: itilize pou chanje an dosye View (default)

source: **Thumbnail-view Radio Button**
ht: ** Thumbnail-view bouton radyo **

source: used to switch to thumbnail view, where you can reorder the sequence of the slides by dragging them
ht: itilize pou chanje an View thumbnail, kote ou ka reorganized sekans nan glisad yo pa derapaj yo

source: **Full-screen-view Button**
ht: ** Full ekran-view Button **

source: hides the toolbars (Return from full-screen by hitting the Esc key.)
ht: kache bar yo (Retounen nan plen ekran-pa frape kle a ESC. )

source: **Update-description Button**
ht: ** Bouton Mizajou-deskripsyon **

source: Used to edit the description of the entry currently being viewed (Note: use the Save-annotations Button to make these edits permanent).
ht: Itilize edite deskripsyon an nan antre nan kounye a ke yo te wè (Remak: Sèvi ak bouton an Save-anote fè edits sa pèmanan).

source: used to exit the activity
ht: itilize yo sòti aktivite a

source: Activity Toolbar
ht: Aktivite Toolbar

source: **Activity name field**
ht: ** Aktivite Non jaden **

source: used to change the name of the activity (The name is used by the save-to-PDF Button.)
ht: itilize yo chanje non an nan aktivite a (Non a se itilize pa bouton an sove-a-PDF. )

source: **Share Button**
ht: ** Bouton Share **

source: as shown, disabled (Portfolio Activity version since v27 support sharing: joiners can add comments)
ht: jan yo montre, andikape (vèsyon Portfolio aktivite depi pataje sipò v27: menwizye kapab ajoute kòmantè)

source: **Reflection Button**
ht: ** Button Refleksyon **

source: used to write descriptions for the Journal entry of this instance of Portfolio
ht: itilize yo ekri deskripsyon pou antre nan Journal of sa a egzanp nan Portfolio

source: **Save-to-PDF Button**
ht: ** Save-a-PDF bouton **

source: used to save a copy of your presentation to the Sugar Journal as an PDF document
ht: itilize pou konsève pou yon kopi nan prezantasyon ou a Sugar Journal a kòm yon dokiman PDF

source: **Save-annotations Button**
ht: ** Save-anote Button **

source: used to save updates to the Journal entry descriptions
ht: itilize pou konsève pou dènye deskripsyon yo antre Journal

source: Options Toolbar
ht: Opsyon Toolbar

source: **Timer Combo-box**
ht: ** Minutri Combo-bwat **

source: lets you select a delay time between slides when using auto play (Choose two-seconds, ten-seconds, thirty-seconds, or one-minute delay).
ht: pèmèt ou chwazi yon tan reta ant glisad lè w ap itilize jwe oto (Chwazi de-segonn, dis-segonn, trant-segonn, oswa yon sèl-minit reta).

source: **Refresh Button**
ht: ** Bouton Rafrechi **

source: scans the Journal to pull in any changes made since the Portfolio activity was launched.
ht: analiz Journal la rale nan nenpòt chanjman ki fèt depi te aktivite a Portfolio te lanse.

source: **Record Button**
ht: ** Button Dosye **

source: used to record an audio note associated with the current slide
ht: itilize nan dosye yon nòt odyo ki asosye ak glise nan aktyèl

source: **Playback Button**
ht: ** Bouton Lecture **

source: active when there is audio associated with the current slide
ht: aktif lè gen odyo ki asosye ak glise nan aktyèl

source: active when there is a new recording to save
ht: aktif lè gen yon nouvo anrejistreman pou konsève pou

source: Saving to PDF
ht: Ekonomize PDF

source: Each time your launch the Portfolio activity, it will update to reflect the current contents of your Journal. If you want to save a portfolio that represents a particular moment in time (or you want to share your portfolio with someone else), you need to save it as a PDF document. Click on the "Save as PDF" Button from the Activity toolbar menu and the content of the portfolio will be saved as a document in the Journal.
ht: Chak fwa ou lanse aktivite a Portfolio, li pral mete ajou a reflete sa ki aktyèl la nan jounal ou. Si ou vle pou konsève pou yon dosye ki reprezante yon moman patikilye nan tan (oswa ou vle pataje dosye ou a ak yon lòt moun), ou bezwen pou konsève pou li kòm yon dokiman PDF. Klike sou "Save kòm PDF" bouton an nan meni an ba ikòn aktivite ak kontni an nan dosye a va sove kòm yon dokiman nan jounal la.

source: **Tip:** Open your Journal to make sure the portfolio has been saved.
ht: ** Ide: ** Louvri Journal ou a asire w te dosye a te sove.

source: **Tip:** You may want to copy the PDF file to a USB to open it in a different XO, or any other computer, using the Browse or Read activity.
ht: ** Ide: ** Ou ka vle kopi dosye PDF a nan yon USB yo louvri l 'nan yon XO diferan, oswa nenpòt ki lòt òdinatè, lè l sèvi avèk Browse oswa Li aktivite a.

source: Learning with Portfolio
ht: Aprann ak Portfolio

source: Most education experts agree that the best approach to learning involves doing and then stepping back to reflect on the doing: What did I learn? How can I use that? What questions do I have?1 By helping children to ask good questions about the things they’ve done, as opposed to remembering the right answers, we are helping them to build the critical thinking skills that enable them to be independent problem solvers. Without reflection, learning is an open loop, and an open-loop system can neither identify and correct errors nor adapt to change.
ht: San yo pa refleksyon, aprann se yon riban louvri, ak yon sistèm louvri-riban ka ni idantifye ak erè kòrèk ni adapte yo ak chanjman.

source: Sugar facilitates reflective learning by ensuring that everything a child does is recorded in an electronic journal which includes screen capture of a child’s work. After every activity, children are encouraged to share their observations, which are recorded in an electronic portfolio. From this record of activities, children can expand their portfolio into a multimedia narrative that shows what they have done, how they have done it and what their thoughts are on what they have created—children essentially become curators of their own work. The child’s process of telling about what they have learned as a “story” is a simple way to help reflection become a norm in their education.
ht: Apre chak aktivite, yo ankouraje timoun yo pataje obsèvasyon yo, ki fè yo ekri nan yon dosye elektwonik.

source: By building upon the automatic accumulation of work in the Sugar journal, the portfolio process can readily be integrated into the classroom routine. It can be used as an assessment tool to help teachers, parents, and school administrators understand better the depth and breadth of what a child has learned.2 At a “portfolio social”, parents could be invited to view presentations and ask children about their learning. The classroom teacher can add addition assessment slides to the portfolio addressing themes such as work habits and personal growth. This can become part of an archive that travels with a child across grade levels. Through juxtaposition, the child and teacher can see what has changed over the course of the years, trends, and areas for improvement.
ht: Pa bati sou akumulasyon nan otomatik nan travay nan jounal la Sugar, ka pwosesis la dosye fasilman dwe entegre nan woutin nan salklas. Li kapab itilize kòm yon zouti evalyasyon yo ede pwofesè yo, paran yo, ak administratè lekòl konprann pi byen pwofondè ak lajè nan sa ki yon timoun te aprann. Pwofesè klas la ka ajoute glisad evalyasyon de sa nan dosye a adrese tèm tankou abitid travay ak kwasans pèsonèl. Sa a ka vin yon pati nan yon achiv ki vwayaje ak yon timoun nan tout nivo klas. Atravè jukstapoze, timoun nan ak pwofesè ka wè sa ki te chanje sou kou a nan ane, tandans, ak nan zòn kote pou amelyorasyon.

source: It is recommended that periodically (once per week, month, semester) that the children are asked to select and edit items for a portfolio presentation. For example, a weekly presentation could be made to classmates; a monthly one to parents; and perhaps once per semester, a school-wide presentation that makes all of the learning visible to administrators and community members during a social event.
ht: Li rekòmande ke detanzantan (yon fwa pou chak semèn, mwa, semès) ke timoun yo yo mande yo chwazi epi modifye atik pou yon prezantasyon pòtfolyo. Pou egzanp, te kapab yon prezantasyon chak semèn yo dwe fè yo kondisip klas yo; yon yon sèl chak mwa bay paran; e petèt yon fwa pou chak semès, yon prezantasyon nan tout lekòl la ki fè tout nan vizib nan aprann administratè ak manm kominote pandan yon evènman sosyal.

source: Periodic PDF snapshots are also a great way to preserve a record of each child's work, and as a vehicle for assessing progress.
ht: Pariod PDF Peryodik yo tou se yon bon fason yo prezève yon dosye nan travay chak timoun, ak kòm yon machin pou evalye pwogrè.

source: Extending Portfolio
ht: Pwolonje Portfolio

source: In addition to using Portfolio as a tool for reflection, it can be used as a more general-purpose presentation tool. For example, a collection of photographs can be annotated (by using the title and description fields in the Journal detail view for each photo) and then made into a slide show. The order of the slides can be modified from the Thumbnail view. Modifying Portfolio
ht: Anplis de sa nan lè l sèvi avèk Portfolio kòm yon zouti pou refleksyon, li kapab itilize kòm yon jeneral-bi zouti plis prezantasyon. Pou egzanp, ka yon koleksyon foto dwe komante (lè l sèvi avèk jaden yo tit ak deskripsyon nan gade nan detay Journal pou chak foto) ak Lè sa a, te fè nan yon montre glise. Ka lòd la nan glisad yo kapab modifye soti nan gade nan Thumbnail. Modifye Portfolio

source: Manuq made some mock-ups of other layouts. It would be fun to add alternative layout options (or even add support for style sheets).
ht: Manuq te fè kèk Metye-ups nan lòt kouman. Li ta enteresan yo ajoute opsyon layout altènatif (oswa menm ajoute sipò pou dra style).

source: See http://wiki.sugarlabs.org/go/Activities/Portfolio
ht: Wè http: // wiki. sugarlabs. org / ale / Aktivite / Portfolio

source: Another idea would be to add the ability to export video from Portfolio.
ht: Yon lòt lide ta dwe ajoute kapasite nan ekspòtasyon videyo soti nan Portfolio.

source: Your suggestions for enhancements and/or use cases...
ht: Sijesyon ou pou amelyorasyon ak / oswa ka itilize. . .

source: A word to developers
ht: Yon ti mo nan devlopè

source: Reflection is an important part of learning and a good habit to establish in general. An analog to writing descriptions in the Journal -- the text that is shown in the Portfolio presentations -- is writing commit messages in git. It forces you to stop, reflect, and then articulate to others what you have done and why.
ht: Refleksyon se yon pati enpòtan pou yo aprann ak yon bon abitid etabli an jeneral. Yon analòg deskripsyon ekri nan jounal la - tèks la ki se yo montre nan prezantasyon yo Portfolio - ap ekri komèt mesaj nan git. Li fòse ou yo sispann, reflete, ak Lè sa a articuler ak lòt moun sa ou te fè ak poukisa.

source: Where to report problems
ht: Ki kote yo repòte pwoblèm

source: You can report bugs and make feature requests on our bug-tracking system (You need to create an account first). To list all open tickets of Portfolio you can use query component=Portfolio. You are also welcome to leave comments/suggestions on the Talk:Activities/Portfolio page.
ht: Ou kapab rapòte pinèz epi fè demann karakteristik sou sistèm ensèk-Suivi nou an (Ou bezwen yo kreye yon kont premye). Nan lis tout tikè louvri nan Portfolio ou ka itilize query eleman = Portfolio. Ou yo tou akeyi yo kite kòmantè / sijesyon sou Pale a: Aktivite / paj pòtfolyo.

source: Credits
ht: Kredi

source: Portfolio was written and is maintained by User:Walter. He was inspired in part by the work of BU Prof. Stefanakis.
ht: Portfolio te ekri epi li se konsève pa Itilizatè: Walter. Li te enspire an pati pa travay la nan BU professeurs. Stefanakis.
