Repository: tony37/sledhelp
Catalog: translated_po/ht/ports.po
Languages: ht

source: Physical Features
ht: Karakteristik fizik

source: Features and Ports
ht: Features ak pò

source: The XO laptop has many built-in features. These include a camera, microphone, speakers and wireless antenna. In addition, the laptop allows for the attachment of other external devices. This is often done by plugging the devices into connectors (some are more commonly referred to as ports, jacks or slots).
ht: Laptop XO a gen anpil karakteristik bati-an. Men sa yo enkli yon kamera, mikwofòn, moun kap pale epi san fil antèn. Anplis de sa, konpitè pòtatif li a pèmèt pou atachman a nan lòt aparèy ekstèn. Sa a se souvan fè pa rakorde aparèy yo nan konektè (gen kèk ki plis souvan refere li kòm pò yo, jak oswa fant).

source: Backlit screen
ht: Retroeklere ekran

source: The display functions in a full-color mode similar to other laptop displays and in an ultra-low-power, ultra-high-resolution, black-and-white mode that is readable in direct sunlight.
ht: Fonksyon yo ekspozisyon nan yon mòd plen koulè menm jan ak lòt montre laptop ak nan yon ultra-ba-pouvwa a, ultra-wo-rezolisyon, nwa-e-blan mòd se sa ki lizib nan limyè solèy la dirèk.

source: 1, 2 - Built-in microphone
ht: 1, 2 - Bati-an mikwofòn

source: There is both a built-in microphone (and an external microphone jack, which supports both AC and DC sources.) As a privacy measure, an LED above the microphone (1) lights up whenever the microphone is in use.
ht: Gen tou de yon mikwofòn bati-an (ak yon jack mikwofòn ekstèn, ki sipòte tou de sous AC ak DC. ) Kòm yon mezi sou vi prive, yon ki ap dirije pi wo a mikwofòn la (1) limyè moute chak fwa mikwofòn la se nan itilize.

source: 3, 8 - Built-in speakers
ht: 3, 8 - Bati-an ki pale natif

source: Internal stereo speakers and an amplifier provide a way to play music, videos, and anything you have recorded yourself. There’s also a jack for external headphones or speakers.
ht: Natif stereo Entèn ak yon anplifikatè bay yon fason yo jwe mizik, videyo, ak nenpòt bagay ou te anrejistre tèt ou.

source: 4 - Game pad
ht: 4 - Jwèt pad

source: Two sets of four-direction cursor-control keys can be game controllers. Since they still function when the screen is folded down into e-book mode, the XO creates a self-contained game playing pad including a controller.
ht: De kouche nan kle kurseur-kontwòl kat-direksyon kapab contrôleur jwèt. Depi yo toujou fonksyone lè se ekran an pliye desann nan mòd e-liv, XO a kreye yon pad jwèt ap jwe endepandan ki gen ladan yon kontwolè.

source: 5 - Screen rotate button
ht: 5 - Screen bouton Thorne

source: 6, 7 - Built-in camera
ht: 6, 7 - Bati-an kamera

source: The XO laptop has a built-in color camera, enabling still photography and video recording. As a privacy measure, an LED above the camera (6) lights up whenever the camera is on.
ht: Laptop XO a te gen yon bati-an kamera koulè, pèmèt fotografi toujou ak anrejistreman videyo. Kòm yon mezi sou vi prive, yon ki ap dirije pi wo a kamera a (6) limyè moute chak fwa kamera a se sou.

source: 9 - Game buttons
ht: 9 - Jwèt bouton

source: The game buttons can be used when the screen is folded down into e-book mode, creating a self-contained game player. The buttons are labeled with a circle, a square, a check, and an ×. These buttons are often used by Activities. For example, the circle button can be used as the shutter for the camera in the Record Activity.
ht: Bouton sa yo jwèt ka itilize lè se ekran an pliye desann nan mòd e-liv, kreye yon endepandan jwèt jwè. Bouton sa yo yo souvan itilize pa Aktivite. Pou egzanp, ka bouton an sèk ka itilize kòm vole a pou kamera a nan aktivite nan Dosye.

source: 10 - Power button, indicator
ht: 10 - Pouvwa bouton, endikatè

source: From left to right: the battery-level indicator; the power indicator; and the power button.
ht: De gòch a dwat: batri-nivo endikatè a; endikatè a pouvwa; ak bouton an pouvwa.

source: Along with offering unique connectivity options, the XO laptop can work with a wide range of external devices.
ht: Ansanm ak ofri opsyon koneksyon inik, konpitè pòtatif li a XO ka travay avèk nan yon pakèt domèn aparèy ekstèn.

source: 11 - Antennae ears
ht: 11 - antèn zòrèy

source: When the wireless antennae "ears" are rotated up, they provide the XO with a connection range vastly superior to those of conventional laptops. When down, they keep dirt out of the connectors and act as a latch.
ht: Lè antèn la san fil "zòrèy" yo vire toutotou yo, yo bay XO a ak yon seri koneksyon larjeman siperyè sa yo ki nan laptops konvansyonèl. Lè l 'atè, yo kenbe pousyè tè soti nan konèkteur yo ak aji tankou yon obtenir.

source: 12, 13 - External headphones and microphone jacks
ht: 12, 13 - kas ekoutè Ekstèn ak oslè mikwofòn

source: Along with built-in speakers and microphone, the XO laptop features jacks for external headphones and an external microphone.
ht: Ansanm ak bati-an moun kap pale epi mikwofòn, konpitè pòtatif li a karakteristik XO oslè pou kas ekoutè ekstèn ak yon mikwofòn ekstèn.

source: 14 - USB/memory ports
ht: 14 - USB / pò memwa

source: The XO laptop features three external USB ports to support a variety of plug-in peripherals (one seen in the photo above, and two others under the other "ear"). Right side ports + battery
ht: Laptop XO a karakteristik twa pò ekstèn USB sipòte yon varyete de plug-in periferik (yon sèl wè nan foto a pi wo a, ak de lòt moun anba lòt "zòrèy" la). Pò bò dwat + batri

source: 15 - Power jack
ht: 15 - Pouvwa Jack

source: The XO comes with a power cord that can be plugged into any 110-to-240-volt AC outlet for charging. The power jack also accepts DC power from a solar panel for charging the XO laptop’s battery.
ht: XO a vini ak yon kòd pouvwa ki ka konekte nan nenpòt ki 110-a-240-volt AC priz pou pote plent-.

source: SD memory card slot
ht: Plas kat memwa SD

source: There is a slot underneath the display that accepts SD memory cards for photos, video, and other content. Rotate the display so that the left-hand edge is over the keyboard—the slot is then accessible from below.
ht: Gen yon plas anba ekspozisyon an ki asepte SD kat memwa pou foto, videyo, ak lòt kontni.

source: Rechargeable battery
ht: Batri rcharjabl

source: Since many children, maybe even you, live "off the grid" (in places with poor or non-existent power infrastructure), the XO laptop is designed to be extremely power efficient.
ht: Depi gen anpil timoun ki, petèt menm ou, viv "nan griy la" (nan kote ki gen pòv oswa ki pa-inexistant enfrastrikti pouvwa), se konpitè pòtatif li a XO fèt yo dwe trè pouvwa efikas.
