Repository: tony37/sledhelp
Catalog: translated_po/ht/read.po
Languages: ht

source: Read
ht: Li

source: About
ht: Sou

source: The Read activity allows the laptop to act as a book reader. It has a simple interface, and will view many kinds of text and image-based book-like materials. It will have particular strengths in handheld mode, with extremely low power consumption and simple navigation controls.
ht: Aktivite a Li pèmèt konpitè pòtatif li a yo aji kòm yon lektè liv. Li te gen yon koòdone senp, epi yo pral wè divès kalite tèks ak liv-tankou materyèl imaj ki baze sou. Li pral gen fòs patikilye nan mòd pòtatif, ak pouvwa konsomasyon ba anpil ak kontwole navigasyon senp.

source: Read can read PDF files, EPUB files, text files and single-page TIFF files.
ht: Li kapab li dosye PDF yo, dosye èpeub, dosye tèks ak yon sèl-paj dosye TIFF.

source: Using
ht: Lè l sèvi avèk

source: The Read activity is launched by opening the Journal and choosing a PDF document. PDFs downloaded from Browse can be opened in this way, as can PDFs on an external storage device. The user may also start Read from the Home page Favorites circle and select a file to read. The book opens in a portrait orientation.
ht: Se aktivite a li te lanse pa louvri Journal la ak w ap chwazi yon dokiman PDF. Pdf telechaje soti nan Browse ka louvri nan fason sa a, kòm ka pdf sou yon aparèy depo ekstèn. Itilizatè a kapab tou kòmanse li nan sèk la Akey favori epi chwazi yon dosye li. Liv la ouvè nan yon oryantasyon pòtrè.

source: Navigation
ht: Navigasyon

source: When the screen is in the upright position, the keyboard is available for navigation as well as the directional pad and games keys. When the screen is in tablet mode, the keyboard is not available. Make sure the document canvas is selected (and not the tool-bar menu) by clicking either in the page area, or pressing the TAB key until focus moves out of the toolbar.
ht: Lè ekran an se nan yon pozisyon nan mache dwat devan Bondye, klavye a ki disponib pou navigasyon kòm byen ke pad an direksyon ak jwèt kle. Lè ekran an se nan mòd grenn, klavye a se pa disponib. Asire w ke se twal la dokiman chwazi (epi yo pa meni an zouti-bar) pa klike swa nan zòn nan paj, oswa peze kle a TAB jiskaske konsantre mouvman soti nan ba ikòn nan.

source: **Keyboard Navigation:**
ht: ** Navigasyon klavye: **

source: The arrow keys will scroll the page a few lines in any direction
ht: Kle yo flèch pral woulo liv paj la yon liy kèk nan nenpòt direksyon

source: ALT + arrow keys, or screen direction pad, will scroll the page a small amount in any direction
ht: ALT + flèch kle, oswa ekran direksyon pad, yo pral woulo liv paj la yon ti kantite lajan nan nenpòt direksyon

source: FN + arrow keys up/down will move one page up or down (with a small overlap to keep context)
ht: FN + flèch kle moute / desann ap deplase yon paj monte oswa desann (ak yon ti sipèpoze kenbe kontèks)

source: FN + arrow keys right/left will jump to the start or end of the document
ht: FN + flèch kle dwa / gòch pral sote nan kòmansman an oswa nan fen dokiman an

source: The keys h, j, k, l also act as left, down, up, right
ht: Kle h, J, K, L a tou aji kòm kite, desann, moute, dwa

source: **Screen GamePad and Directional Button Navigation**
ht: ** Gampad ekran ak diriger Button Navigasyon **

source: The screen rotation key (the bottom key on the left side of the screen) will turn the screen image to accommodate tablet use.
ht: Kle a wotasyon ekran (kle a anba sou bò gòch nan ekran an) ap vire imaj la ekran li akomode itilize grenn.

source: The directional pad on the left hand side of the screen will also scroll a few lines
ht: Pad an direksyon sou bò men gòch nan ekran an ap tou woulo liv yon liy kèk

source: On the right hand side of the screen the gamepad buttons 'circle' and 'cross' also act as page up and page down (with a small overlap to keep context).
ht: Sou bò nan men dwat nan ekran an 'sèk' bouton sa yo gampad ak 'kwa' tou aji kòm PAJ KANPE e PAJ desann (ak yon ti sipèpoze kenbe kontèks).

source: The gamepad buttons 'square' and 'tick' act as a zoom in and zoom out
ht: 'Kare' gampad Bouton sa yo ak 'tik' aji tankou yon rale nan ak rale soti

source: **Brightness Control**
ht: ** Luminozite Kontwòl **

source: The brightness can be increased or decreased with the keys
ht: Ka klète an ap ogmante oswa diminye ak kle yo

source: Clarity is improved in tablet mode (turning the screen and laying it flat) by using monochrome mode. Select CTRL + Brightness keys to turn it on or off.
ht: Clarity se amelyore nan mòd grenn (vire ekran an ak tap mete li plat) lè l sèvi avèk mòd kamayeu. Chwazi kle Ctrl + Luminozite yo vire l 'sou oswa koupe.

source: Monochrome outside is easier to view books (CTRL Brightness Down)
ht: Kamayeu deyò se pi fasil yo wè liv (CTRL Luminozite Down)

source: Be aware that large books may open and scroll slowly.
ht: Dwe konnen ke liv gwo pouvwa louvri ak woulo liv tou dousman.

source: Applying
ht: Aplike

source: The GetBooks Activity provides a way to expand access to many of the free books available worldwide. The 'My Documents' folder appears at the bottom of the screen when you are using Journal. Books can be stored in the My Documents folder for easier cataloging.
ht: Aktivite nan GetBooks bay yon fason yo elaji aksè nan anpil nan liv yo gratis ki disponib atravè lemond. Folder nan 'Dokiman mwen' parèt nan pati anba a nan ekran an lè w ap itilize Journal. Liv ka dwe estoke nan dosye a Dokiman mwen pi fasil pou cataloging.
