Repository: tony37/sledhelp
Catalog: translated_po/ht/record.po
Languages: ht

source: Record
ht: Dosye

source: About
ht: Sou

source: The Record Activity is used for recording audio and video and for taking pictures. You will need to have a built in, or an attached, microphone and/or camera to use Record.
ht: Se aktivite a Dosye itilize pou anrejistreman odyo ak videyo ak pou pran foto. Ou ap bezwen gen yon bati nan, oswa yon tache, mikwofòn ak / oswa kamera yo sèvi ak Dosye.

source: If your computer has no built in camera, or an unsuitable camera attached, then Record, will open in *Record audio* mode only.
ht: Si òdinatè w lan pa gen okenn bati nan kamera, oswa yon kamera inoporten tache, lè sa a Dosye, yo ap louvri nan * Dosye odyo * mòd sèlman.

source: There are three record or capture modes. Select **one** of these buttons to chose your Record mode.
ht: Gen twa dosye oswa kaptire mòd. Chwazi ** youn nan bouton sa yo ** chwazi mòd Dosye ou.

source: The image above shows the buttons of the three *Record* modes, they are:
ht: Imaj la pi wo a montre bouton sa yo nan twa * mòd yo Dosye *, yo yo se:

source: Picture camera mode
ht: Foto mòd kamera

source: Video camera mode
ht: Videyo mòd kamera

source: Audio, or sound mode
ht: Odyo, oswa mòd son

source: This is the *Record* or capture button |Capture| in the centre of the screen, below *main image*.
ht: Sa a se dosye a * * oswa bouton kapti | Capture | nan sant la nan ekran an, pi ba a * sou prensipal estati *.

source: The main image shows what will be captured. Record will capture whatever is in front of the camera in *Picture camera* mode, or *Video camera* mode, and will capture whatever the microphone can detect, when in *Audio* mode.
ht: Imaj la prensipal montre sa ki pral pran. Dosye pral pran tou sa se nan devan kamera a nan * kamera Foto mòd *, oswa * Videyo kamera * mòd, epi yo pral pran tou sa mikwofòn la kapab detekte, lè nan * Audio * mòd.

source: **Tip** As always in Sugar, if you are not sure what a button will do, hover the cursor over it, to reveal its function.
ht: ** Ide ** Kòm toujou nan Sugar, si ou pa fin sèten sa ki yon bouton pral fè, hover kurseur a sou li, revele fonksyon li.

source: Record features in detail
ht: Karakteristik Dosye an detay

source: **Toolbar and capture buttons explained**
ht: ** Toolbar ak kaptire bouton eksplike **

source: Activity tab. In the first field name the page or project. The Description button allows you to add a description to the :doc:`/journal` entry. Thirdly select Private, or My Neighbourhood, see :ref:`Sharing Media`.
ht: Tab aktivite. Nan jaden an premye non paj la oswa pwojè. Bouton an Deskripsyon pèmèt ou ajoute yon deskripsyon nan: doc la: `/ antre journal`. Anfen chwazi Prive, oswa Katye mwen, wè: ref: `Pataje Media`.

source: Picture camera mode is selected.
ht: Se foto mòd kamera chwazi.

source: Video camera mode button. Press to switch to Video camera mode.
ht: Videyo mòd kamera bouton. Press pou chanje an Video mòd kamera.

source: Audio recording mode button. Press to switch to Audio recording mode.
ht: Audio anrejistreman mòd bouton. Press pou chanje an Audio mòd anrejistreman.

source: Select timer button. Press this button to engage a delay before taking a picture. Available delay options are, *Immediate*, *5 seconds*, or 10 secomds.
ht: Chwazi bouton revèy. Peze bouton sa-a angaje yo yon reta anvan yo pran yon foto. Disponib reta opsyon ki, * Piblikasyon Imedyat *, * 5 segonn *, oswa 10 secomds.

source: Timer duration button. Duration is grayed out in *Picture camera* mode. In *Video* mode and in *Audio* mode press to *Select duration*. Available duration options are 2, 4, 6 minutes.
ht: Minutri bouton dire. Se Duration grize soti nan * Foto mòd kamera *. Nan * Video * mòd ak nan * mòd * Audio laprès * Chwazi dire *. Opsyon dire Disponib yo 2, 4, 6 minit.

source: Select quality button. The button is grayed out in *Picture camera* mode, and *Audio* mode. In Video camera mode, press this button to select low or high quality. Experiment and choose whichever gives the best results in your conditions.
ht: Chwazi bouton bon jan kalite. Bouton an se grize soti nan * kamera Foto mòd *, ak * Audio * mòd. Nan Videyo mòd kamera, peze bouton sa a yo chwazi ki ba oswa wo kalite. Eksperyans epi chwazi kèlkeswa sa ki bay rezilta yo pi byen nan kondisyon ou.

source: This image represents an picture already taken. It is in the area of the screen called the *tray*, which contains thumbnail images.
ht: Imaj sa a reprezante yon foto deja pran. Li se nan zòn nan nan ekran an yo rele * a * plato, ki gen imaj thumbnail.

source: The record or capture button. Once a picture, video, or Audio recording has been captured, it is automaticly saved in the Journal, and the saved image or clip is represented as a thumbnail in the tray.
ht: Bouton an dosye oswa kaptire. Yon fwa ke yon foto, videyo, oswa Audio anrejistreman te kaptire, li se otomatikman sove nan Journal la, ak imaj la sove oswa clip se reprezante kòm yon thumbnail nan plato a.

source: When the tray is full of images, this button scrolls through the images.
ht: Lè plato a se tout imaj, bouton sa-a woulo nan imaj yo.

source: Stop, or close the application.
ht: One Stop, oswa fèmen aplikasyon an.

source: The next section covers Video camera mode, and then Audio recording in more specific detail. However you might now prefer to follow on to :ref:`Viewing, saving and managing your work`.
ht: Seksyon nan pwochen kouvri Video mòd kamera, ak Lè sa a Audio anrejistreman an detay plis espesifik. Sepandan ou ta ka kounye a pito yo swiv sou a: ref: `Wè, ekonomize ak jere work` ou.

source: Video camera
ht: Kamera videyo

source: Activity tab. Here you can enter a name for the project, access the Journal, to provide a description, and select Private, or My Neighbourhood, see :ref:`Sharing Media`.
ht: Tab aktivite. Isit la ou ka antre nan yon non pou pwojè a, aksè nan jounal la, bay yon deskripsyon, epi chwazi Prive, oswa Katye mwen, wè: ref: `Pataje Media`.

source: Picture camera mode button. Press to switch to Picture camera mode.
ht: Foto mòd kamera bouton. Press pou chanje an Foto mòd kamera.

source: Video camera mode button is selected, and capture or record has been started.
ht: Videyo mòd kamera bouton se chwazi, e li te pran oswa dosye te kòmanse.

source: Select timer button. Press this button to set a delay before capture, available delay options are, Immediate, 5 seconds, or 10 secomds.
ht: Chwazi bouton revèy. Peze bouton sa a yo mete yon reta anvan kaptire, ki disponib reta opsyon yo, Piblikasyon Imedyat, 5 segonn, oswa 10 secomds.

source: Timer duration button. In *Video* mode and in *Audio* mode, press to *Select duration*. Available duration options are 2, 4, 6 minutes.
ht: Minutri bouton dire. Nan * Video * mòd ak nan * Audio mòd *, peze * Chwazi dire *. Opsyon dire Disponib yo 2, 4, 6 minit.

source: Select quality button. In Video camera mode, press this button to select low or high quality. Experiment and choose whichever gives the best reults in your conditions.
ht: Chwazi bouton bon jan kalite. Nan Videyo mòd kamera, peze bouton sa a yo chwazi ki ba oswa wo kalite. Eksperyans epi chwazi kèlkeswa sa ki bay reults yo pi byen nan kondisyon ou.

source: Record is in *Sharing* mode, and we have been joined by a collaborator.
ht: Dosye se nan * Pataje mòd *, epi nou yo te ansanm ak yon kolaboratè.

source: The image, which the other party shared is in the tray, identified by their characteristic colours. See also :ref:`Sharing Media`.
ht: Imaj la, ki lòt pati a pataje se nan plato a, idantifye pa koulè karakteristik yo. Gade tou: ref: `Pataje Media`.

source: Time remaining bar. This is the time remaining, from the *Timer duration*, set with **6**.
ht: Tan ki rete ba. Sa a se tan ki rete, ki soti nan dire * a * minutri, mete ak ** 6 **.

source: The button to stop capture and to save the video file. Once a recording has been captured, it is automaticly saved in the Journal.
ht: Bouton an yo sispann pran ak pou konsève pou dosye a videyo. Yon fwa gen yon anrejistreman te kaptire, li se otomatikman sove nan jounal la.

source: When you finish recording, the saved video clip will be represented by a thumbnail.
ht: Lè ou fini anrejistreman, yo pral clip nan videyo sove dwe reprezante pa yon thumbnail.

source: The next section is Audio recording. However you might now prefer to follow on to :ref:`Viewing, saving and managing your work`.
ht: Seksyon nan pwochen se Audio anrejistreman. Sepandan ou ta ka kounye a pito yo swiv sou a: ref: `Wè, ekonomize ak jere work` ou.

source: The tool bar items are just as described above.
ht: Bagay sa yo se jis zouti ba jan sa dekri anwo.

source: It is always a good idea to enter a name for your file **1** in the Activity tab, so that it is easier to find your work later.
ht: Li se toujou yon bon lide yo antre nan yon non pou dosye ou ** 1 ** nan tab la pou Aktivite, konsa ke li se pi fasil jwenn travay ou pita.

source: If you have a camera, an image **2** appears in the picture window and looks like live video. As the audio file is saved, the image is saved as a snapshot to help identify your audio recording.
ht: Si ou gen yon kamera, yon imaj ** 2 ** parèt nan fennèt la foto sanble videyo ap viv ak. Kòm se dosye a odyo sove, se imaj la sove kòm yon snapshot ede idantifye anrejistreman odyo ou.

source: The Select timer and Timer duration buttons **3** are available, to set a delay before start of recording, and set the duration. You can either leave the audio recording to run for the set duration, or press the stop capture button **4** at any time.
ht: Bouton sa yo Chwazi revèy ak minutri dire ** 3 ** ki disponib, yo mete yon reta anvan yo kòmanse nan anrejistreman, li mete dire a. Ou ka swa kite anrejistreman an odyo nan kouri pou dire a seri, oswa peze bouton an pran arè ** 4 ** nan nenpòt ki lè.

source: As with the photo and video modes, you see an icon for your recording **5** show up in the tray once you are done.
ht: Menm jan ak foto ak videyo mòd yo, ou wè yon icon pou anrejistreman ou ** 5 ** montre moute nan plato a yon fwa w ap fè.

source: Viewing, saving and managing your work
ht: Wè, ekonomize ak jere travay ou

source: Working clock wise from the top left, shows the sequence, to save, name, and inspect an image once it has been taken. This sequence is taken in *Picture camera* mode, but the features are similar in all modes.
ht: K ap travay revèy ki gen bon konprann ki soti nan bò gòch nan tèt, montre sekans lan, pou konsève pou, non, ak enspekte yon imaj yon fwa li te pran. Se sa a sekans pran nan * kamera Foto mòd *, men karakteristik yo ki yo se menm jan an nan tout mòd.

source: The first screen shot, top left, shows the main image in Picture camera mode, while a picture, just taken, has been automatically saved and named in the Journal. It shows up as a thumbnail on the tray. The cursor is hovering on the thumbnail. The automaticly given, temporary name, is “Photo by Sugar Learner” **1**.
ht: Premye piki a ekran, gòch anwo, montre imaj la prensipal nan mòd Foto kamera, pandan y ap gen yon foto, jis pran, te otomatikman sove epi yo te nonmen nan jounal la. Li montre moute kòm yon thumbnail sou plato a. Kurseur a ap elikopte sou thumbnail a.

source: When we click the thumbnail, the main image changes to *viewer* mode. Images are viewed and information can be updated.
ht: Lè nou klike sou thumbnail a, prensipal chanjman yo imaj * visualiseur mòd *. Imaj yo wè ak ka mete ajou enfòmasyon.

source: A field, in which to enter a title for the photo appears **2**. The title “Cornish village” is entered. Also at this point **2** is the full screen mode button. This will switch the main image to full screen.
ht: Yon jaden, nan ki antre nan yon tit pou foto a parèt ** 2 **. Epitou nan pwen sa a ** ** 2 se plein écran mòd bouton an. Sa a pral chanje imaj la prensipal nan ekran plen.

source: At the bottom right of the main image is a little tab, **3**, which allows you to find out more about the photo that was taken. Now pressing that tab **4** reveals the image information, author, date, and a space to add tags. A tag is a single word that helps categorize an item.
ht: Nan bò dwat la anba imaj la prensipal la se yon tab ti kras, ** 3 **, ki pèmèt ou jwenn plis enfòmasyon sou foto a ki te pran. Koulye a, peze ki tab ** 4 ** revele enfòmasyon a imaj, otè, dat, ak yon espas yo ajoute tags. Yon tag se yon mo sèl ki ede kategorize yon atik.

source: The tray displays a history of your previously taken photos. When you have more photos in the tray the *scroll button* **5** scrolls through the images.
ht: Plato a montre yon istwa de foto deja pran ou. Lè ou gen plis foto nan plato a * woulo liv bouton an * ** ** 5 woulo nan imaj yo.

source: To replay a video or audio recording, click the thumbnail of the recording in the tray. When viewing or listening to a clip, if you move your cursor in the main image area, you see small window **6**, representing the output of your camera or microphone. Click on that window to return from *viewer* mode to *capture* mode.
ht: Reparèt yon videyo oswa odyo anrejistreman, klike sou thumbnail a anrejistreman an nan plato a. Lè gade oswa koute yon clip, si ou deplase kurseur ou a nan zòn nan imaj prensipal la, ou wè ti fenèt ** 6 **, repwezantan pwodiksyon an nan kamera ou oswa mikwofòn. Klike sou ki fenèt yo retounen soti nan * visualiseur * mòd * kaptire mòd *.

source: The final image is displayed full screen, and can be reduced to normal with the button **7**.
ht: Se imaj la final parèt ekran plen, e yo ka ap redwi a nòmal ak bouton an ** 7 **.

source: Record stores images and audio in the Journal, from which they can be used by other activities, such as Paint, Write, Etoys, and Browse, as well as Memorize and some other games. Images can be copied to a USB storage device from the Journal.
ht: Dosye magazen imaj, ak odyo nan jounal la, ki soti nan ki yo kapab itilize pa lòt aktivite, tankou penti, Ekri, Etoys, ak Browse, osi byen ke Memorize ak kèk lòt jwèt. Imaj yo ka kopye nan yon aparèy depo USB soti nan Journal la.

source: Sharing Media
ht: Pataje Media

source: You can share photos, video and audio recordings (these can just be referred to as 'media') with your friends.
ht: Ou ka pataje foto, videyo ak anrejistreman odyo (sa yo ka jis dwe refere yo kòm 'medya') ak zanmi ou.

source: To share media you must first have some media in the tray. We have the image of a Bison in the tray.
ht: Yo pataje medya ou dwe premye gen kèk medya nan plato a. Nou gen imaj la nan yon Bison nan plato a.

source: The Activity tab has been opened, the collaboraton button is pressed and "My Neighborhood" selected.
ht: Te tab la aktivite te louvri, bouton an collaboraton se bourade ak "Katye mwen" chwazi.

source: Share, and join Record
ht: Share, yo ak rantre nan Dosye

source: Once you have made your Activity available to share, others, looking at their Neighborhood View, see your icon with the Record icon, an eye, close to it. They can now join your Activity by clicking on the Record icon next to your icon.
ht: Yon fwa ou te fè aktivite ou disponib nan pataje, lòt moun, gade nan Katye wè yo, wè icon ou a ak icon a Dosye, yon grenn je, fèmen nan li. Yo kapab kounye a rantre nan aktivite ou pa klike sou icon nan Dosye akote icon ou.

source: They must then select "Join" and their Record Activity opens with your images in their tray.
ht: Lè sa a, Yo dwe chwazi "Antre nan" ak aktivite Dosye yo ouvè ak imaj ou nan plato yo.

source: Now in Record, thumbnails of both parties are shared. The frame of the thumbnail is in the same colors as the XO icon of the person who took the photo.
ht: Koulye a, nan Dosye, ti kliche nan toulède pati yo yo pataje. Ankadreman an nan thumbnail a se nan koulè yo menm jan ak icon a XO nan moun nan ki te pran foto a.

source: Images shared
ht: Imaj pataje

source: On your Frame, you can see the icons of all of the people with whom you are collaborating. You can also see their shared media.
ht: Sou ankadreman ou a, ou ka wè ikon yo nan tout nan moun yo ak ki moun ou ap kolabore. Ou ka wè tou medya pataje yo.

source: You can exit a shared Activity at any time.
ht: Ou ka sòti yon aktivite pataje nan nenpòt ki lè.

source: |more| :doc:`/collaborating` has more information on sharing work in Sugar.
ht: | Plis |: doc: `/ collaborating` gen plis enfòmasyon sou pataje travay nan Sugar.

source: Getting creative with Record
ht: Lè w kreyatif ak Dosye

source: Record can be used for :
ht: Ka dosye gen pou itilize pou:

source: Taking pictures.
ht: Lè w ap pran foto.

source: Recording video.
ht: Anrejistreman videyo.

source: Recording audio.
ht: Anrejistreman odyo.

source: Stop-motion photography.
ht: Fotografi Stop-mouvman.

source: Time-lapse photography.
ht: Fotografi tan-erè.

source: Viewing slide shows.
ht: Wè montre glise.

source: Storing extra information about audio, video, and pictures.
ht: Sere enfòmasyon siplemantè sou odyo, videyo, ak foto.

source: Things to Try with Record
ht: Bagay sa yo Eseye ak Dosye

source: You can easily take pictures and make videos by using a built-in, or connected, camera for still photography and video recording. You can also use the camera for video conferencing, which involves talking to others on a video screen knowing that the others can also view your video.
ht: Ou ka byen fasil pran foto, epi fè videyo lè l sèvi avèk yon bati-an, oswa konekte, kamera pou toujou fotografi ak videyo anrejistreman. Ou kapab tou itilize kamera a pou konferans sou videyo, ki gen ladan ap pale ak lòt moun sou yon ekran videyo konnen ke lòt moun yo kapab tou wè videyo ou.

source: You can express yourself with sound, images, and video using the cameras and microphones. You are learning about light, observations, angle, and perspective. By recording the sights and sounds around you, others can learn about you, your culture, and environment. You can communicate with your voice and pictures. You can tell factual or emotional stories with film or pictures to help change perceptions or take action.
ht: Ou ka eksprime tèt ou ak son, imaj, ak videyo lè l sèvi avèk kamera yo ak mikro. Ou ap aprann sou limyè, obsèvasyon, ang, ak pèspektiv. By anrejistreman aklè yo ak son bò kote ou, lòt moun ka aprann sou ou, kilti ou, ak anviwònman. Ou ka kominike avèk vwa ou ak foto. Ou ka rakonte istwa reyèl oswa emosyonèl ak fim oswa foto yo ede chanjman pèsepsyon oswa pran aksyon.

source: You could also try some of the following :
ht: Ou kapab tou eseye kèk nan bagay sa yo:

source: Use the Record Activity to record your voice with a built-in microphone.
ht: Sèvi ak aktivite a Dosye nan dosye vwa ou ak yon mikwofòn bati-an.

source: Take a photo of where you live by aiming the camera lens at your home, and then clicking the circle icon.
ht: Pran yon foto nan kote w ap viv pa vise lantiy la kamera nan kay ou a, ak Lè sa a, klike icon a sèk.

source: Record sounds of your city or town.
ht: Dosye son nan vil oswa vilaj ou.

source: Record and leave messages for your family.
ht: Ekri epi kite mesaj pou fanmi ou.

source: Teachers - record a message for parents.
ht: Pwofesè - dosye yon mesaj pou paran.

source: Interview your friends and record it to audio or video.
ht: Entèvyou zanmi ou yo epi ekri li nan odyo oswa videyo.

source: Make a video diary.
ht: Fè yon jounal pèsonèl videyo.

source: Open your photos in the Paint Activity and draw on them.
ht: Louvri foto ou nan Aktivite nan penti epi trase sou yo.

source: Add your pictures to a story using Write.
ht: Ajoute foto ou a nan yon ekri istwa lè l sèvi avèk.

source: Upload a picture to Flickr or Wikimedia Commons.
ht: Voye yon foto Flickr oswa Wikimedia Commons.

source: Attach a picture to an e-mail you send to a friend or family member.
ht: Tache yon foto nan yon e-mail ou voye nan yon zanmi oswa manm fanmi.

source: Take a picture of a flower or plant from the same place every day to show how it changes.
ht: Pran yon foto nan yon flè oswa plant ki nan plas la menm chak jou yo montre ki jan li chanje.

source: Take a picture of a baby animal every week to show how it grows.
ht: Pran yon foto nan yon bèt ti bebe chak semèn yo montre ki jan li ap grandi.
