Repository: tony37/sledhelp
Catalog: translated_po/ht/repair.po
Languages: ht

source: Repairs
ht: Reparasyon

source: Your XO is built and designed for repair work to be completed with only your hands and a screwdriver, and the case includes extra screws in case you need them. Please refer to http://wiki.laptop.org/go/Disassembly for important details on how to start on repairs.
ht: Se XO ou bati ak ki fèt pou travay reparasyon nan dwe ranpli ak sèlman men ou ak yon tournevis, epi ka-a gen ladan vis siplemantè nan ka ou bezwen yo. Tanpri gade nan http: // wiki. laptop. org / ale / Démontage pou plis detay enpòtan sou ki jan yo kòmanse sou reparasyon.

source: For photos and step-by-step instructions on repairing your XO or putting replacement parts in, go to http://wiki.laptop.org/go/Repair.
ht: Pou foto ak etap-pa-etap enstriksyon sou reparasyon XO ou oswa mete pati ranplasman nan, ale nan http: // wiki. laptop. org / ale / Reparasyon.

source: Refer to http://wiki.laptop.org/go/Repair_center_locations to get to the most recent directory of repair centers, if you do not want to repair your XO yourself.
ht: Gade nan http: // wiki. laptop. org / ale / Repair_center_locations pou li ale nan anyè a ki pi resan nan sant reparasyon, si ou pa vle pou fè reparasyon pou ou tèt ou XO.

source: Recalibrating the touchpad on the XO 1.0
ht: Recalibrating touchpad a sou XO a 1. 0

source: If the pointer is not following your finger on the touchpad of a XO 1.0, or if it jumps to the corners when you touch the touchpad, please try this recalibration procedure:
ht: Si konsèy la se pa sa yo dwèt ou sou touchpad a nan yon XO 1. 0, oswa si li sote nan kwen yo lè w manyen touchpad a, tanpri eseye sa a pwosedi kalibraj:

source: Hold down the three keys at one time: the upper left, upper right, and lower right of the keyboard and the fourth key, fn, the lower leftmost key, as the last one pressed, and then release them all.
ht: Kenbe desann twa kle yo nan yon sèl fwa: bò gòch a anwo, dwa anwo, ak pi ba dwa nan klavye a ak katriyèm kle a, FN, kle a pi ba leftmost, kòm youn nan dènye bourade, ak Lè sa a lage yo tout.

source: If this doesn't help, try shutting down the laptop and removing the battery for ten seconds before restarting.
ht: Si sa a pa ede, eseye fèmen konpitè pòtatif li a epi yo retire batri a pou di segonn anvan rekòmanse.

source: Finally, plug a standard USB mouse into your laptop to bypass the problem.
ht: Finalman, ploge yon sourit estanda USB nan konpitè pòtatif ou kontoune pwoblèm nan.

source: How to do a Keyboard Test
ht: Ki jan yo fè yon tès klavye

source: Checking for keys that stay down or appear stuck
ht: Lè nap Peye pou kle ki rete desann oswa parèt kole

source: Your XO must have a developer's key to do this keyboard test. Refer to http://wiki.laptop.org/go/Developer_key for more information about developer's keys.
ht: XO ou a dwe gen kle yon pwomotè a fè tès sa a klavye. Gade nan http: // wiki. laptop. org / ale / Developer_key pou plis enfòmasyon sou kle pwomotè a.

source: With the XO off, hold down the "check mark" game button (above the power button) while pushing the power button. After start up, the screen displays "Release the game keys to continue" and shows a text diagram of which key is pressed.
ht: Avèk XO a koupe, kenbe desann bouton an "chèk make" jwèt (pi wo a bouton an pouvwa) pandan y ap pouse bouton an pouvwa. Apre kòmanse moute, montre yo ekran "Lage kle yo jwèt yo kontinye", ak pou montre yon dyagram tèks nan yo ki se kle bourade.

source: Release the "check mark" game button.
ht: Lage "chèk make" jwèt bouton an.

source: Next, after you see "Type the Esc key to interrupt automatic startup," press the escape key in the upper left hand corner of the keyboard layout (a circle with an x). The XO displays an ok prompt.
ht: Next, apre yo fin ou wè "Tape kle nan kompitè entèwonp otomatik demaraj," laprès kle a chape nan kwen an men gòch anwo nan Layout la klavye (yon sèk ki gen yon x). XO a montre yon èd memwa ok.

source: At the ok prompt, type:
ht: Nan ok èd memwa, kalite a:

source: ``test keyboard``
ht: `` Keyboard`` tès

source: and press enter.
ht: ak laprès antre.

source: A blue keyboard map displays on the screen.
ht: Yon kat jeyografik klavye ble montre sou ekran an.

source: Press keys one at a time to see the keyboard map turn the key light blue.
ht: Kle Press yon sèl nan yon tan wè kat jeyografik la klavye vire kle ble nan limyè.

source: If the display on screen shows a light blue key constantly, the keyboard has a problem with that particular key sticking. Refer to a repair center for full diagnosis and repair at http://wiki.laptop.org/go/Repair_center_locations.
ht: Si ekspozisyon an sou ekran montre yon kle ble limyè toujou ap, klavye a gen yon pwoblèm ak sa an patikilye rete soude kle. Gade nan yon sant reparasyon pou dyagnostik plen ak reparasyon nan http: // wiki. laptop. org / ale / Repair_center_locations.

source: Press the the escape key (circle with an x) again to exit the keyboard test.
ht: Peze kle a chape nan (sèk ki gen yon x) ankò sòti tès la klavye.

source: At the ok prompt, type reboot to restart.
ht: Nan èd memwa a ok, kalite rdemare rekòmanse.

source: Repairing damage to the keyboard
ht: Reparasyon domaj nan klavye a

source: If your keyboard becomes damaged, normally it has to be replaced. Replacements are available through the repair centers. Information on spare parts and repair centers can be found at http://wiki.laptop.org/go/Repair_center_locations.
ht: Si klavye ou vin domaje, nòmalman li te yo dwe ranplase. Ranplasman ki disponib nan sant sa yo reparasyon. Enfòmasyon sou pati yo ak nan sant reparasyon rezèv ka jwenn nan http: // wiki. laptop. org / ale / Repair_center_locations.

source: Troubleshooting the internal XO hardware
ht: Depanaj pyès ki nan konpitè XO entèn

source: The XO can give you information about possible repairs that are needed.
ht: XO a kapab ba ou enfòmasyon sou reparasyon posib ke yo bezwen.

source: Start by pressing the power button for a second, and then answer the following questions. Does the Power LED half-circle light up?
ht: Kòmanse pa peze bouton an pouvwa pou yon dezyèm fwa, ak Lè sa a reponn kesyon sa yo. pouvwa dirije limyè demi-sèk moute?

source: When the power button is pressed once, and the power LED doesn't turn on, first try resetting it.
ht: Lè yo bouton an pouvwa bourade yon fwa, epi dirije nan pouvwa pa vire sou, premye eseye re li.

source: To reset the XO, remove all power sources from the laptop:
ht: Reyajiste XO a, retire tout sous pouvwa soti nan konpitè pòtatif li a:

source: Take the battery out and remove the power adapter.
ht: Pran batri a soti epi retire adaptè nan pouvwa.

source: Wait two minutes. This allows embedded hardware to lose all power and reset itself.
ht: Rete tann de minit. Sa a pyès ki nan konpitè pèmèt entegre pèdi tout pouvwa ak Reyajiste tèt li.

source: Replace at least one source of power, either the battery or power adapter, and watch the power/battery LED while you do so.
ht: Ranplase omwen yon sous ki gen pouvwa, swa batri oswa pouvwa adaptè a, epi gade pouvwa / batri a pandan y ap dirije ou fè sa.

source: The battery LED should flash orange momentarily (about a quarter of a second) when power is first reapplied. If you do not see this flash, you either have a motherboard hardware problem or faulty EC firmware installed. Contact a repair center for assistance.
ht: Dirije nan batri ta dwe flache ti tan zoranj (anviwon yon ka nan yon dezyèm) lè pouvwa se premye reaplike. Si w pa wè kat sa a, ou swa gen yon pwoblèm mèr kenkayri oswa defo EC firmwèr enstale. Kontakte yon sant reparasyon pou asistans.

source: If the power LED doesn't turn on or flash, but the laptop proceeds to illuminate the backlight and even start, the problem may be either the LEDs themselves or the power LED driver. The LEDs are in series, so if one fails they may both fail to light.
ht: Si ap dirije nan pouvwa pa vire sou oswa flash, men lajan an laptop grandi ekleraj la e menm kòmanse, pwoblèm nan pouvwa dwe swa poul yo tèt yo oswa pouvwa dirije chofè a. Poul sa yo nan seri, Se konsa, si yon sèl echwe yo ka tou de fail limyè.

source: On rare occasions, the power button becomes stuck mechanically. In this case, the laptop does not detect the depression of the power button, and does not turn on. Ensure that the power button is moving freely by pressing it a few times.
ht: Nan okazyon ra, bouton an pouvwa vin kole mekanikman. Nan ka sa a, konpitè pòtatif li a pa detekte depresyon an nan bouton an pouvwa, epi yo pa vire sou. Asire ke bouton an pouvwa ap deplase libreman pa peze li yon fwa kèk.

source: If the battery LED flashed on restoration of power and the power button isn't stuck, and no other signs of life are detected, then you can't determine the reason for failure. Contact a repair center for assistance. Does the display light up?
ht: Si ap dirije a batri klere sou restorasyon nan pouvwa ak bouton an pouvwa se pa sa kole, ak pa gen okenn lòt siy nan lavi yo detekte, lè sa a ou pa kapab detèmine rezon ki fè yo pou fayit. Kontakte yon sant reparasyon pou asistans. Èske limyè ekspozisyon moute a?

source: After starting the XO and viewing the power LED, the next visible feedback from the XO is that the display lights up. The LCD display should be initialized with white, then begin to show text or graphics. The backlight for the screen should be turned on, even if the backlight was previously turned off.
ht: Apre kòmanse XO a ak gade ki ap dirije nan pouvwa, pwochen fidbak la vizib nan XO a se ke limyè yo ekspozisyon moute. Ekspozisyon a LCD ta dwe inisyalizèd ak blan, Lè sa a, kòmanse montre tèks oswa grafik. Ekleraj la pou ekran an ta dwe vire sou, menm si ekleraj la te deja etenn.

source: If this does not happen then the boot sequence may not be operating correctly. Next, look at the Microphone activity LED to see if it is lit. If the power LED and the microphone LED are both lit then a serious boot error has occurred and you should contact a repair center for assistance. Can you hear the startup sound when the XO starts?
ht: Si sa pa rive Lè sa a, sekans an bòt pa ka opere kòrèkteman. Next, gade nan aktivite a Mikwofòn ki ap dirije yo wè si li se limen. Si yo pouvwa a ki ap dirije epi dirije nan mikwofòn tou de limen lè sa a te yon erè grav bòt ki te fèt ak ou ta dwe kontakte yon sant reparasyon pou asistans. Èske ou ka tande son an demaraj lè XO a kòmanse?

source: If the startup sound does not play, this usually indicates a problem that a repair center needs to fix. Yes, the startup sound plays
ht: Si son an demaraj pa jwe, sa a anjeneral endike yon pwoblèm ki yon sant reparasyon bezwen ranje. Wi, demaraj a son jwe

source: If the display doesn't initialize, but the boot sound plays, then this is probably a problem with the display. No, the XO boots normally, but no boot sound plays
ht: Si ekspozisyon an pa inisyalize, men son an bòt jwe, lè sa a sa a se pwobableman yon pwoblèm ak ekspozisyon an. Non, bòt yo XO nòmalman, men pa gen okenn jwe son bòt

source: If no boot sound is played, but the machine boots normally and has audio, it is possible that the default boot volume to has been changed to 0. While the boot sound is playing, you can adjust the volume using the volume adjust keys. This modified volume setting is saved and used for future boots. Try increasing the volume right after starting the laptop a few times, and see if the boot sound returns.
ht: Si pa gen son bòt te jwe, men bòt yo machin nòmalman epi ki gen odyo, li se posib ke volim nan bòt default te chanje nan 0. Pandan ke son an bòt ap jwe, ou ka ajiste volim nan lè l sèvi avèk volim nan ajiste kle. Se anviwònman sa a volim modifye sove ak itilize pou bòt lavni. Eseye ogmante volim nan dwa apre kòmanse konpitè pòtatif li a yon fwa kèk, ak wè si retounen yo son bòt.

source: If no boot sound is played, and the machine boots normally but has no audio see http://wiki.laptop.org/go/XO_Troubleshooting_AV. Does the display remains blank after starting up?
ht: Si pa gen son bòt te jwe, ak bòt yo machin nòmalman men pa gen okenn odyo wè http: // wiki. laptop. org / ale / XO_Troubleshooting_AV. Èske ekspozisyon an rete vid apre yo fin kòmanse moute?

source: Sometimes the display is active (including backlight), but no text or graphics appear. This problem can be caused by removing the power to an XO while it is upgrading the firmware. You should contact a repair center for assistance. Does the display say "Connect power to proceed"? Sometimes a firmware update requires two sources of power, both a battery and a power adapter. If this is the problem, provide both sources of power and reboot. The XO should proceed with a firmware update and boot normally. Is the display is showing an XO icon only?
ht: Pafwa ekspozisyon an se aktif (ki gen ladan ekleraj), men pa gen okenn tèks oswa grafik parèt. Ka pwoblèm sa a dwe ki te koze pa retire pouvwa a nan yon XO pandan y ap li se amelyore firmwèr a. Ou ta dwe kontakte yon sant reparasyon pou asistans. ekspozisyon an di "Konekte pouvwa a kontinye"? Pafwa yon aktyalizasyon firmwèr egzije de sous ki gen pouvwa, tou de yon batri ak yon adaptè pouvwa. Si sa a se pwoblèm nan, bay tou de sous ki gen pouvwa ak rdemare. XO a ta dwe kontinye ak yon aktyalizasyon firmwèr ak bòt nòmalman. Èske ekspozisyon an se ki montre yon icon XO sèlman?

source: This means that the XO has started the startup process.
ht: Sa vle di ke te XO a te kòmanse pwosesis la demaraj.

source: You can see much more information about your Open Firmware by holding the "check mark" game button (above the power button) after powering on. That makes Open Firmware display more detailed messages about what it is doing during the secure boot process (including early boot messages from the Linux kernel). The messages are in English only. Is it showing an XO icon with a serial number and three icons below it?
ht: Ou ka wè pi plis enfòmasyon sou mikrolojisyèl Open ou pa kenbe "chèk make" jwèt bouton an (pi wo a bouton an pouvwa) apre alimante sou. Ki fè Open mikrolojisyèl montre mesaj plis detay sou sa li ap fè pandan pwosesis la bòt sekirite (ki gen ladan mesaj bòt bonè nan men Kernel a Linux). Mesaj sa yo nan lang angle sèlman. Èske li ki montre yon icon XO ak yon nimewo seri ak twa ikon anba a li?

source: If the laptop powers up, but stops when displaying the XO icon in the middle of the screen, followed by a serial number (e.g. CSN74902B22) and three icons (SD disk, USB disk, Network signal strength), it is looking for its activation lease. This should eventually print "Activation lease not found" at the top of the screen and power-off soon thereafter.
ht: Si pouvwa konpitè pòtatif li a moute, men sispann lè montre icon nan XO nan mitan an nan ekran an, ki te swiv pa yon nimewo seri (e. g. CSN74902B22) ak twa ikon (SD gen kapasite, USB ki gen kapasite, Rezo fòs siyal), li se kap pou kontra-lwaye li yo deklanchman. Sa a ta dwe evantyèlman enprime "Aktivasyon kontra-lwaye pa jwenn" nan tèt la nan ekran an ak pouvwa-off byento apre sa.

source: The solution is to re-activate the laptop. Obtain a copy of the lease (or a new lease) from your country activation manager, place it (named "lease.sig") in the top-level directory of a USB key and boot the laptop. See the "what to do with activation keys" section within: http://wiki.laptop.org/go/Activation_and_Developer_Keys. Is it showing an XO icon with a "sad face" above it?
ht: Solisyon an se yo re-aktive konpitè pòtatif li a. Jwenn yon kopi kontra-lwaye a (oswa yon nouvo kontra-lwaye) soti nan manadjè deklanchman peyi ou, mete l '(yo te rele "kontra-lwaye. sig ") nan anyè a tèt-nivo nan yon kle USB ak bòt konpitè pòtatif li a. Wè seksyon "sa yo dwe fè ak kle deklanchman" nan lespas: http: // wiki. laptop. org / ale / Activation_and_Developer_Keys. Èske li ki montre yon icon XO ak yon "figi tris" pi wo a li?

source: This means that Open Firmware couldn't find a signed operating system on the internal flash memory. Firmware bootup also looks on USB memory sticks and SD cards for signed operating system software.
ht: Sa vle di ke Open mikrolojisyèl pa t 'kapab jwenn yon sistèm opere siyen sou entèn memwa flash nan. Mikrolojisyèl demaraj tou sanble sou baton USB memwa ak kat SD pou siyen lojisyèl sistèm opere.

source: Try upgrading or re-installing the software: http://wiki.laptop.org/go/Secure_Upgrade. XO icon with a single dot below it?
ht: Eseye amelyore oswa re-enstale lojisyèl an: http: // wiki. laptop. org / ale / Secure_Upgrade. XO icon ak yon dot sèl anba a li?

source: If the XO powers up, but stops when just displaying the XO icon in the middle, with a single dot below it, it means that something was wrong when the Linux operating system started. When this happens, try upgrading or reinstalling the XO. If this has happened to the same XO more than one time, consider a repair center for full diagnosis and repair at http://wiki.laptop.org/go/Repair_center_locations.
ht: Si pouvwa XO a moute, men sispann lè jis montre icon nan XO nan mitan an, ak yon dot sèl anba a li, sa vle di ke yon bagay te mal lè sistèm nan fonksyone Linux te kòmanse. Lè sa rive, eseye amelyore oswa rmontaj XO a. Si sa a te rive nan menm XO plis pase yon tan nan, konsidere yon sant reparasyon pou dyagnostik plen ak reparasyon nan http: // wiki. laptop. org / ale / Repair_center_locations.
