Repository: tony37/sledhelp
Catalog: translated_po/ht/restructuredtext.po
Languages: ht

source: Writing in reStructuredText
ht: Ekri nan reStructuredText

source: This page is a short primer and cheat sheet for the markup language we are using in :doc:`/how_to_help`. The rst format is easy to create and we are using a part of it only.
ht: Paj sa a se yon Jadendanfan kout ak tronpe fèy pou lang lan baliz nou ap lè l sèvi avèk nan: doc: `/ how_to_help`. Fòma a RST se fasil yo kreye epi nou ap lè l sèvi avèk yon pati nan li sèlman.

source: Titles
ht: Tit

source: Links
ht: Lyen

source: Links like http://activities.sugarlabs.org are automatically created.
ht: Lyen tankou http: // aktivite. sugarlabs. org yo se otomatikman kreye.

source: To create links where the text displayed in the page is different to the link you should do:
ht: Pou kreye lyen ki tèks la parèt nan paj an se diferan nan lyen ki ou ta dwe fè:

source: You will find `ASLO <http://activities.sugarlabs.org>`_ here.
ht: Ou pral jwenn `aslo <http: // aktivite. sugarlabs. org> `_ isit la.

source: Program writing software like Python_.
ht: Pwogram lojisyèl ekri tankou Python_.

source: Links within Help
ht: Lyen nan Èd

source: This link, :ref:`my-reference-label` links to the top paragraph of this document.
ht: Lyen sa a,: ref: `lyen-referans my-label` paragraf nan tèt nan dokiman sa a.

source: To see how this works, ``.. _my-reference-label:`` appears on line 7 of restructuredtext.rst.
ht: Pou wè ki jan sa a ap travay, ``. . _my-referans-mete etikèt sou: `` parèt sou liy 7 nan restructuredtext. RST.

source: Secondly, this page contains more about terms and words used in sugar. :doc:`/glossary`
ht: Dezyèmman, paj sa a ki gen plis enfòmasyon sou tèm ak mo yo itilize nan sik. : Doc: `/ glossary`

source: Lists
ht: Lis

source: Lists are simple
ht: Lis yo se senp

source: First item
ht: Premye atik

source: Second item
ht: Dezyèm atik

source: Last item
ht: Denye atik

source: or numbered:
ht: oswa resansman:

source: One item
ht: Youn atik

source: Another item
ht: Yon lòt atik

source: The last one
ht: Youn nan dènye

source: Simple table
ht: Tab Senp

source: Inputs
ht: Entran

source: Output
ht: Sòti

source: A
ht: Yon

source: A or B
ht: A oswa B

source: False
ht: Fo

source: True
ht: Vrè

source: Images
ht: Imaj

source: An image can be included like this:
ht: Ka Yon imaj dwe enkli tankou sa a:

source: Icons and small images
ht: Icônes ak imaj ti

source: |Neighborhood_key| This is the sharing option.
ht: | Neighborhood_key | Sa a se opsyon nan pataje.

source: |Home_key_f3_small| This is the Private option.
ht: | Home_key_f3_small | Sa a se opsyon a Prive.

source: Adding a note
ht: Ajoute yon nòt

source: When you are required to place the first readable character at point 3 or 4 in the line, it is recommended to check if you are required to insert spaces or Tab.
ht: Lè w ap oblije mete premye pèsonaj la lizib nan pwen 3 oswa 4 nan liy lan, li rekòmande yo tcheke si ou oblije Insert espas oswa tab.

source: And also
ht: Epi tou

source: Notice that first readable character of this note is under the "s", three spaces preceed it.
ht: Remake premye karaktè lizib nan nòt sa a se anba "nan la", twa espas preceed li.

source: |more| There are links to :ref:`Further reading` at the foot of the page :doc:`/how_to_help`
ht: | Plis | Gen lyen ki mennen nan: ref: `Pli lwen reading` nan pye a nan paj la: doc:` / how_to_help`
