Repository: tony37/sledhelp
Catalog: translated_po/ht/schoolserver.po
Languages: ht

source: XS school server
ht: Sèvè lekòl XS

source: Overview
ht: Apèsi sou lekòl la

source: The XO school Server, or XS, is one of the products of the OLPC project, designed to complement the XO laptop. The XS is installed on x86 (Intel-compatible) computers. These could be conventional servers such as rack-mounted computers, purpose-built low-power machines, or even netbooks.
ht: Sèvè a lekòl XO, oswa X, se youn nan pwodwi yo nan pwojè a OLPC, ki fèt yo konplete konpitè pòtatif li a XO. X yo se enstale sou x86 (Intel-konpatib) òdinatè. Sa yo ta ka serveurs konvansyonèl tankou etajè-monte òdinatè, bi-bati machin ki ba-pouvwa, oswa menm netbooks.

source: The OLPC XS provides additional infrastructure extending the capabilities of the laptops. While the laptops are self-sufficient for many learning activities, other activities and services depend on the XS providing connectivity, shared resources and services. The XS provides XO machines with network connectivity for backups, anti-theft leases, web browsing, system, content updates, and asynchronous collaboration tools such as Moodle.
ht: OLPC X yo bay plis enfrastrikti pwolonje kapasite yo nan laptops yo. Pandan ke laptops yo se endepandan pou aktivite aprantisaj anpil, lòt aktivite ak sèvis depann sou X yo bay koneksyon, resous ak sèvis pataje. XS a bay machin XO ak koneksyon rezo pou sovgad, lwe anti-vòl, Navigasyon entènèt, sistèm, dènye kontni, ak zouti kolaborasyon asenkron tankou moodl.

source: Installation
ht: Enstalasyon

source: Two installation options are available:
ht: De opsyon enstalasyon yo disponib:

source: XS installation CD (recommended): download and burn a CD image, and use the resultant CD to install the system. See details at http://wiki.laptop.org/go/XS_Installing_Software_0.7#Installing_from_CD
ht: XS enstalasyon CD (rekòmande): download yo ak boule yon imaj CD, epi sèvi ak CD a resultant yo enstale sistèm nan. Al gade nan detay nan http: // wiki. laptop. org / ale / XS_Installing_Software_0. 7 # Installing_from_CD

source: On top of another system (advanced): install the XS software packages on top of an existing operating system installation. See details at http://wiki.laptop.org/go/XS_Installing_Software_0.7#Installing_on_top_of_existing_OS_installation
ht: Sou tèt yon lòt sistèm (avanse): enstale pakè yo lojisyèl XS sou tèt yon enstalasyon sistèm opere ki deja egziste. Al gade nan detay nan http: // wiki. laptop. org / ale / XS_Installing_Software_0. 7 # Installing_on_top_of_existing_OS_installation

source: The installation is fairly straight forward and requires minimal configuration after the initial installation to the XS hard drive.
ht: Enstalasyon an se jistis dwat devan epi li mande konfigirasyon minim apre enstalasyon inisyal la XS kondwi a difisil.

source: Configuration
ht: Nou konte ofri sèvis

source: Configuring the XS involves choosing a server domain name. The hostname is always 'schoolserver'. So, using a domain name like example.org will give you schoolserver.example.org.
ht: Konfigirasyon XS la enplike nan chwazi yon non domèn sèvè. Hostname a se toujou 'schoolserver'. Se konsa, lè l sèvi avèk yon non domèn tankou egzanp. org pral ba ou schoolserver. egzanp. org.

source: The XS has a fairly standard server-style networking setup. The XS provides DHCP and DNS services to all the XOs connected to it via a wireless access point. However, if the school already has its own network running its own DHCP services, the XS networking can be modified to work with the existing infrastructure. The XS can work with two Ethernet cards, where one works as a WAN interface, while the other works as the LAN interface. The XS can also work with a single Ethernet card where it works as a LAN interface for schools without WAN (Internet) connectivity. Optionally, such a server can provide WAN connectivity using a USB-to-Ethernet adapter.
ht: XS la gen yon rezo sèvè-style konfigirasyon jistis estanda. XS a bay dkp ak dns sèvis nan tout XO yo ki konekte nan li via yon pwen aksè san fil. Sepandan, si lekòl la deja gen rezo pwòp li yo kouri sèvis pwòp dkp li yo, rezo a XS kapab modifye yo travay avèk enfrastrikti a ki deja egziste. X yo ka travay avèk de kat Ethernet, kote yon travay kòm yon koòdone WAN, pandan y ap travay yo lòt kòm koòdone nan LAN. X yo ka travay tou ak yon kat Ethernet sèl kote li travay kòm yon koòdone LAN pou lekòl san yo pa WAN (entènèt) koneksyon. Opsyonèlman, tankou yon sèvè ka bay WAN koneksyon lè l sèvi avèk yon adaptè USB-a-Ethernet.

source: Services
ht: Sèvis

source: Collaboration
ht: Kolaborasyon

source: The XS provides collaboration services across a variety of activities. When XOs are connected to the School Server, the collaboration is managed through the server and can be segmented by a classroom or a group. While the user will not see anything different, the capacity of collaboration will scale up considerably with a XS in the mix.
ht: X yo bay sèvis kolaborasyon atravè yon varyete aktivite. Lè XO yo ki konekte nan sèvè a lavil la, se kolaborasyon nan jere nan sèvè a epi yo ka segmenté pa yon pwofesè oswa yon gwoup. Pandan ke itilizatè a pa pral wè anyen diferan, kapasite a nan kolaborasyon pral echèl moute konsiderableman ak yon X nan melanj la.

source: The XS uses Squid to cache content locally. At sites where Internet access is limited, slow or expensive, content caching helps in speeding up access to content by making copies on the XS and serving these up locally.
ht: XS a sèvi ak Kalma nan kontni kachèt lokalman. Nan sit kote aksè nan Entènèt se limite, ralanti oswa chè, kontni kach ede nan vitès moute aksè nan kontni pa fè kopi sou X yo ak sèvi sa yo moute lokalman.

source: Backup and Restore
ht: Sovgad ak restore

source: The XS provides seamless backup services for each registered XO. The XS checks to see the backup status of the Journal on each XO and backs it up incrementally. Once the backups are made, these can be used to restore a child's work back on her XO.
ht: X yo bay sèvis backup san pwoblèm pou chak XO anrejistre. XS nan chèk yo wè estati a backup nan jounal la sou chak XO ak ekate li moute incrémentielle. Yon fwa yo te fè sovgad yo, sa yo ka itilize yo retabli travay yon timoun tounen sou XO li.

source: Antitheft Controls
ht: Kontwòl antivol

source: Antitheft controls lists all registered XOs in one location. additionally, this feature offers rescue leases to laptops to re-activate laptops in case of problems. If a laptop gets stolen, the antitheft control feature shuts it down.
ht: Antivol kontwole lis tout XO anrejistre nan yon sèl kote. Anplis de sa, karakteristik sa a ofri lwe sekou laptops re-aktive laptops nan ka ta gen pwoblèm. Si vin yon laptop yo vòlè li, karakteristik nan kontwòl antivol eten li desann.

source: Learning Management System
ht: Aprantisaj Management System

source: Moodle is a Learning Management System that provides the teacher with a way to create a course, manage assignments and administer assessment using a web-based interface. On the XO, the Moodle LMS is accessible via the Browse activity. Moodle features include assignment submission, discussion forums, file downloads, grade books, instant messages, calendars, news, announcements, quizzes and wiki.
ht: Moodl se yon Management System Aprantisaj ki bay pwofesè a ak yon fason yo kreye yon kou, jere devwa ak administre evalyasyon lè l sèvi avèk yon koòdone ki baze sou wèb. Sou XO a, moodl LMS a se aksesib nan aktivite a Browse. Moodl karakteristik genyen ladan yo soumèt plasman, fowòm diskisyon, downloads dosye, liv ane, mesaj enstantane, kalandriye, nouvèl, anons, ti tès ak wiki.
