Repository: tony37/sledhelp
Catalog: translated_po/ht/speak.po
Languages: ht

source: Speak
ht: Pale

source: **The toolbar buttons explained**
ht: ** Bouton sa yo ba ikòn eksplike **

source: Activity tab. In the first field name the session. The book and pencil icon, the Description button allows you to add a description to the :doc:`/journal` entry. Thirdly select Private, or My Neighbourhood mode.
ht: Tab aktivite. Nan jaden an premye non sesyon an. Liv ak kreyon icon la, bouton an Deskripsyon pèmèt ou ajoute yon deskripsyon nan: doc la: `/ antre journal`. Anfen chwazi prive, oswa mòd Katye mwen.

source: Type something to hear robot Alice read it aloud.
ht: Tape yon bagay yo tande robo Alice li li l 'byen fò.

source: Ask robot Alice any question.
ht: Mande robo Alice nenpòt kesyon.

source: Voice chat.
ht: Vwa chat.

source: Set language.
ht: Lang Set.

source: Set pitch of voice and rate of delivery.
ht: Mete goudwon ​​nan vwa ak pousantaj nan livrezon.

source: Alter shape of eyes and mouth
ht: Chanje fòm nan je ak bouch ou

source: Click the arrow button, and use the up/down arrow keys to scroll back through a history of things you have typed.
ht: Klike sou bouton an flèch, ak sèvi ak kle yo moute / desann flèch nan woulo liv tounen nan yon istwa de bagay sa yo ou te tape.

source: Stop, or close the Activity
ht: One Stop, oswa fèmen aktivite a

source: Using
ht: Lè l sèvi avèk

source: Speak is a talking face for the XO laptop. Anything you type will be spoken aloud using the XO's speech synthesizer, espeak. Use the toolbars at the top to change the voice's accent, rate and pitch or the shape of the eyes and mouth.
ht: Pale se yon figi pale pou konpitè pòtatif li a XO. Pral Nenpòt bagay ou tape dwe pale byen fò lè l sèvi avèk diskou synthesizer XO a, eSpeak. Sèvi ak bar yo nan tèt la yo chanje aksan, pousantaj vwa a ak goudwon ​​oswa fòm nan je yo ak bouch.

source: You can ask Alice a question too.
ht: Ou ka mande Alice yon kesyon twò.

source: This is a great way to experiment with the speech synthesizer, learn to type or just have fun making a funny face for your XO.
ht: Sa a se yon bon fason fè eksperyans ak synthesizer la lapawòl, aprann tape oswa jis gen plezi fè yon figi komik pou XO ou.

source: After you've adjusted the settings it looks nicer in full-screen mode (Press Alt-Enter to switch).
ht: Apre ou te ajiste anviwònman yo li sanble joli nan mòd plen ekran-(Press Alt-Antre chanje).

source: Use the Journal to resume your Speak activity including all voice, face and history settings.
ht: Sèvi ak jounal la kourikouloum-vite aktivite Pale ou ki gen ladan tout vwa, figi ak istwa anviwònman.

source: Page suggested improvements
ht: Page sijere amelyorasyon

source: ... add the ideas.
ht: . . . ajoute lide yo.

source: Expand voice chat.
ht: Elaji chat vwa.

source: Where Speak is good
ht: Ki kote Pale se yon bon bagay

source: Early reading - early writing - with FotoToon
ht: Bonè lekti - ekri byen bonè - ak FotoToon

source: Reading aloud Help pages
ht: Li awotvwa Ede Paj

source: Learn a language
ht: Aprann yon lang

source: This is an experimental new page. You can improve it yourself by following :doc:`/how_to_help`, and perhaps borrowing content from http://wiki.laptop.org/go/Speak
ht: Sa a se yon paj nouvo eksperimantal. Ou ka amelyore li tèt ou pa yo: doc: `/ how_to_help`, e petèt prete kontni ki soti nan http: // wiki. laptop. org / ale / Pale
