Repository: tony37/sledhelp
Catalog: translated_po/ht/starting_the_xo.po
Languages: ht

source: Starting the XO
ht: Koumanse XO a

source: To start the XO, press the Power button, near the lower right corner of the screen. The XO takes about 30 seconds to start up.
ht: Pou yo kòmanse XO a, peze bouton an pouvwa, tou pre kwen ki anba adwat nan ekran an. XO la pran apeprè 30 segonn yo kòmanse moute.

source: If the battery needs charging, the light next to the power button glows red. Plug the AC adaptor into the left side of the XO and plug the power cord into an outlet if you see the red light or if the XO does not start up.
ht: Si batri a bezwen chaje, limyè a pwochen nan bouton an pouvwa vin wouj wouj. Ploge adaptè a AC nan bò gòch la XO a ak ploge kòd la pouvwa nan yon priz si ou wè limyè a wouj oswa si XO a pa kòmanse moute.

source: If you have difficulty starting your XO, refer to the Repairing chapter for ideas.
ht: Si ou gen difikilte kòmanse XO ou, al gade nan chapit la Reparasyon pou lide.

source: Starting for the first time
ht: Koumanse la pou premye fwa

source: After you press the power button and the XO initially starts up, the XO screen asks for your first name. The next time you start it, it remembers your name and goes directly to the Home View. Later on you can learn how to change to a nick name of your choosing.
ht: Apre ou peze bouton an pouvwa ak XO a okòmansman kòmanse leve, ekran an XO mande pou premye non ou. Tan nan pwochen ou kòmanse li, li sonje non ou ak ale dirèkteman nan View a Kay. Pita sou ou ka aprann ki jan yo chanje yon non Nick yo chwazi ou.

source: Type your name.
ht: Tape non ou.

source: After you enter your name, click Next. (Use a finger on the touchpad below the keyboard to move the arrow over the word "Next". Press the key below the touchpad on the left with an "X" on it to "click".)
ht: Apre ou fin antre nan non ou, klike sou Next. (Sèvi ak yon dwèt sou touchpad ki anba a klavye a pou avanse pou pi flèch la sou pawòl Bondye a "Next". Peze kle ki anba la a touchpad a sou bò gòch la ak yon "X" sou li nan "klike sou". )

source: Next, you see a small O on top of an X. This symbol represents you when you use your XO. Use your finger on the touchpad to move the arrow over the person symbol. "Click" this person symbol by pressing the key with an "X" on the left below the touchpad to choose colors that you like.
ht: Next, ou wè yon ti O sou tèt yon X. Senbòl sa a reprezante ou lè ou sèvi ak XO ou. Sèvi ak dwèt ou sou touchpad a pou avanse pou pi flèch la sou senbòl la moun. "Klike sou" sa a senbòl moun pa peze kle a ak yon "X" sou bò gòch la anba a touchpad a yo chwazi koulè ke ou renmen.

source: After you chose your colors, click "Done."
ht: Apre ou te chwazi koulè ou a, klike "fè. "

source: Putting the XO to sleep
ht: Mete XO a nan dòmi

source: When you are ready to stop using your XO for a while, you can put it to sleep by pushing the power key you used to turn it on. The screen that appears when you push the power button shows the two reasons for sleeping; when you haven't been using it for a while, or when you push the power button.
ht: Lè ou pare yo sispann lè l sèvi avèk XO ou pou yon ti tan, ou ka mete l 'nan dòmi pa pouse kle a pouvwa ou te itilize yo vire l' sou. Ekran an ki parèt lè ou pouse bouton an pouvwa montre de rezon ki fè yo pou dòmi; lè ou pa yo te itilize li pou yon ti tan, oswa lè ou pouse bouton an pouvwa.

source: Shutting down the XO
ht: Fèmen XO a

source: When you have finished using the computer, click over the XO icon in the middle of the Home screen, and select the option Shutdown.
ht: Lè ou fini lè l sèvi avèk òdinatè a, klike sou sou icon nan XO nan mitan an nan ekran an Kay, epi chwazi are a opsyon.

source: Forced Shutdown
ht: Fòse are

source: Whenever the XO becomes unresponsive to the keyboard or to the touchscreen, you can make an emergency shutdown by pressing and holding the power button for a few seconds. Be careful that your power button does not get "stuck" in the down position. If it does get stuck, the XO does not detect the depression of the power button, and does not turn on. If this happens, refer to the Repairing chapter for information.
ht: Chak fwa XO a vin unresponsive klavye a oswa tactile a, ou ka fè yon are ijans pa peze e kenbe bouton an pouvwa pou yon kèk segond. Fè atansyon pou bouton pouvwa ou pa jwenn "kole" nan yon pozisyon nan desann. Si li bloke, XO a pa detekte depresyon an nan bouton an pouvwa, epi yo pa vire sou. Si sa rive, al gade nan chapit la Reparasyon pou enfòmasyon.
