Repository: tony37/sledhelp
Catalog: translated_po/ht/starchart.po
Languages: ht

source: When you click on the "Specify time" radio button, StarChart stops the display from automatically being updated. Clicking on the "Now" radio button will set the time back to the current time and resume automatically updating the time fields and the chart.
ht: Lè ou klike sou "Espesifye tan" bouton an radyo, StarChart sispann ekspozisyon an soti nan ke yo te mete ajou otomatikman. Klike sou "Koulye a," bouton an radyo pral mete tan an tounen nan tan aktyèl la ak rezime otomatikman à jaden yo tan ak tablo a.

source: Locate |type_ico|
ht: Jwenn | type_ico |

source: These controls let you select an object and have it highlighted on the chart so you can tell where the object is in the sky. You can "locate" planets, stars (either by the constellation which contains the star or from a list of the brightest stars) or "deep-sky" objects.
ht: Kontwòl sa yo kite ou chwazi yon objè epi yo gen li make sou tablo a pou ou kapab di ki kote objè a se nan syèl la. Ou ka "jwenn" planèt yo, zetwal (swa pa konstelasyon nan ki gen zetwal nan oswa soti nan yon lis nan zetwal yo pi klere) oswa "gwo twou san fon-syèl" objè.

source: Planets
ht: Planèt

source: Stars by Constellation
ht: Stars pa Konstelasyon

source: Brightest Stars
ht: Klere Stars

source: Deep-sky Objects
ht: Gwo twou san fon-syèl objè

source: You begin by selecting the type of object. Then you pick the object itself...
ht: Ou kòmanse pa chwazi ki kalite objè. Lè sa a, ou chwazi objè a li menm. . .

source: Select from the list and sub-lists to locate whatever object you wish to.
ht: Chwazi nan lis la ak sub-lis jwenn tou sa objè ou ta vle.

source: Examples:
ht: Egzanp:

source: Reporting Bugs
ht: Rapòte Pinèz

source: To report a bug or to see what bugs have been reported and/or fixed, please go to the `bug tracking page <http://wiki.laptop.org/go/StarChart/Bug_tracking>`_.
ht: Pou rapòte yon ensèk oswa yo wè sa ki pinèz yo te rapòte ak / oswa fiks, tanpri ale nan `ensèk paj an swiv <http: // wiki. laptop. org / ale / StarChart / Bug_tracking> `_.

source: References
ht: Referans

source: `Wiki page <http://wiki.laptop.org/go/StarChart>`_
ht: `Paj Wiki <http: // wiki. laptop. org / ale / StarChart> `_
