Repository: tony37/sledhelp
Catalog: translated_po/ht/starchart.po
Languages: ht

source: About
ht: Sou

source: |Star_ico| This activity will display a map of the sky showing the position of the visible stars, some of the larger and brighter deep-sky objects (DSOs), the "classical" planets, the sun and the moon.
ht: | Star_ico | Aktivite sa a ap montre yon kat jeyografik nan syèl la ki montre pozisyon nan zetwal yo vizib, kèk nan pi gwo ak pi klere objè yo gwo twou san fon-syèl (DSOs), "klasik" planèt yo, solèy la ak lalin lan.

source: You may specify a location (longitude and latitude) and the time (including time zone offset from GMT) that you wish to have a plot for. Alternatively, you can get a plot which is updated once a minute showing the current sky.
ht: Ou ka presize yon kote (lonjitid ak latitid) ak tan an (ki gen ladan zòn tan konpanse nan GMT) ki ou ta vle gen yon konplo pou. Altènativman, ou kapab jwenn yon konplo ki se mete ajou yon fwa chak minit ki montre syèl la kounye a.

source: You can also learn your way around the sky by using the "Locate" feature to find an object whose name you know or by using the "Identify" feature to get the name of something you see on the chart.
ht: Ou ka aprann tou fason ou otou lè l sèvi avèk syèl la karakteristik nan "Jwenn" jwenn yon objè ki gen non ou konnen oswa ou lè l sèvi avèk karakteristik nan "Idantifye" jwenn non an nan yon bagay ou wè sou tablo a.

source: If you have access to a small telescope or a pair of binoculars, StarChart can provide a magnified view encompassing 7 degrees of the sky centered on a point you specify.
ht: Si ou gen aksè a yon teleskòp ti piti oubyen yon pè nan longvi, StarChart ka bay yon View mayifik kap anglobe 7 degre nan syèl la santre sou yon pwen ou presize.

source: The latest version (StarChart 16) can be downloaded from `here <http://activities.sugarlabs.org/en-US/sugar/addon/4300>`_.
ht: Ka vèsyon an dènye (StarChart 16) telechaje soti nan `isit la <http: // aktivite. sugarlabs. org / en-US / sik / addon / 4300> `_.

source: Introduction
ht: Entwodiksyon

source: StarChart was created by a professional programmer and amateur astronomer who likes to vacation in places far removed from his home town and appreciates the opportunity to view the sky from these places. The XO is a wonderful travel accessory for supporting this sort of thing since it is light, compact and frugal of battery power while providing a reasonably large, reasonably high resolution color display.
ht: StarChart te kreye pa yon pwogramè ak amatè astwonòm pwofesyonèl ki renmen vakans nan kote lwen yo retire nan vil lakay li ak apresye opòtinite pou yo wè syèl la soti nan kote sa yo. XO a se yon akseswar vwayaj bèl bagay pou sipòte sa a sòt de bagay sa depi li se limyè, kontra enfòmèl ant ak frugal nan pouvwa batri pandan y ap ofri yon rezonab gwo, rezonab segondè rezolisyon ekspozisyon koulè.

source: This Activity is intended to support the star-gazer who has no instrument better than his own eyes. It can be used as a guide to the sky overhead, as a tool for planning future observations (including observations from a different location) or as a way to reprise the look of the sky as it was at some time in the past.
ht: Aktivite sa a se gen entansyon sipòte etwal-gazer a ki pa gen okenn enstriman pi bon pase pwòp je l '. Li kapab itilize kòm yon gid nan syèl anlè tèt yo, kòm yon zouti pou planifikasyon obsèvasyon lavni (ki gen ladan obsèvasyon soti nan yon kote diferan) oswa kòm yon fason rpriz gade nan syèl la jan li te ye nan kèk tan nan tan lontan an.

source: Using Star Chart
ht: Lè l sèvi avèk Tablo Star

source: Before you begin
ht: Anvan ou kòmanse

source: Be sure your XO has been set to the correct time-zone offset and the correct local time! The astronomical algorithms need to compute GMT (UT) and can't do that if "now" isn't the right time. (This is only an issue if you don't plan to always use "specify time". But it's still an untidy way to operate your computer.)
ht: Asire w ke te XO ou te mete nan kòrèk tan-zòn nan konpanse ak tan ki kòrèk la lokal! Algoritm yo astwonomik bezwen kalkile GMT (UT) epi yo pa ka fè sa si "kounye a" se pa tan an dwa. (Sa a se sèlman yon pwoblèm si ou pa fè plan yo toujou sèvi ak "presize tan". Men, li la toujou yon fason dezord yo opere òdinatè w lan. )

source: Installation and set-up
ht: Enstalasyon ak mete-up

source: For best results, remove any previous version of StarChart you may have installed. Re-start X (hit Ctrl-Alt-Backspace). Then, simply follow the usual procedure for downloading and installing an Extra Activity.
ht: Pou pi bon rezilta, retire nenpòt vèsyon anvan nan StarChart ou ka te enstale. Re-kòmanse X (frape Ctrl-Alt-Backspace). Lè sa a, tou senpleman swiv pwosedi a nòmal pou Téléchargez ak enstale yon aktivite Siplemantè.

source: Once you have installed StarChart, start it and select the clock button.
ht: Yon fwa ou te enstale StarChart, kòmanse li epi chwazi bouton an revèy.

source: Is the time (YYYY/MM/DD,HH:MM) the correct year, month, day, hour and minute for your location (it's 24-hour time -- 1:00 PM is 13:00 in that system)? Is the zone offset showing the correct hours and minutes that your locale is offset from GMT? (Hint: Eastern Standard Time in the USA is "-5:00" with respect to GMT.) If not, stop the activity and correct your time and time-zone using the Sugar control panel before proceeding.
ht: Se tan a (ANE / MM / JJ, HH: MM) kòrèk ane, mwa, jou, èdtan an ak minit pou kote ou (li nan tan 24 èdtan - 1:00 PM se 13:00 nan ke sistèm)? Èske zòn nan konpanse ki montre èdtan yo kòrèk epi yo minit ki lokalizasyon ou konpanse nan GMT? (Sijesyon: lès Creole Tan nan USA a se "-5: 00" ki gen rapò ak GMT. ) Si ou pa, sispann aktivite a ak korije tan ou ak tan-zòn lè l sèvi avèk panèl la kontwòl Sugar anvan pwosedi.

source: If the time and date are correct, the chart will be displaying the sky for a location in Massachusetts, USA as of right now. If you don't happen to be in that location, you will need to enter your longitude and latitude. Click on "where" to display the controls for doing this. You should be able to get your coordinates from any good map, Google Earth or simply use the published coordinates for any relatively nearby city or town. Another possibility is from a site on the internet such as http://www.mapquest.com/atlas which provides a map with latitude and longitude information from which you can interpolate your specific coordinates.
ht: Si tan an ak dat yo kòrèk, tablo a pral montre syèl la pou yon kote nan Massachusetts, USA kòm nan kounye a. Si ou pa rive yo dwe nan ki kote, ou pral bezwen antre nan lonjitid ou ak latitid. Klike sou "kote" yo montre kontwole yo pou fè sa. Ou ta dwe kapab jwenn kowòdone ou nan nenpòt kat jeyografik bon, Google Latè oswa tou senpleman itilize kowòdone a pibliye pou nenpòt ki vil oswa lavil la relativman ki tou pre. Yon lòt posibilite se soti nan yon sit sou entènèt la tankou http: // www. MapQuest. com / Atlas ki bay yon kat jeyografik ak latitid ak lonjitid enfòmasyon ki soti nan ki ou ka entèpole kowòdone espesifik ou.

source: Don't be obsessive about the precision for this: the star chart will not look noticibly different if you are wrong by one or two degrees either way in latitude or longitude. Being off 100 km won't make enough of a difference to show. But be sure you select East or West longitude and North or South latitude! Then click "Ok" so the program knows you really want to change these settings.
ht: Ou pa bezwen obsession sou presizyon an pou sa a: tablo a zetwal pa pral gade noticibly diferan si ou se sa ki mal pa youn oubyen de degre swa fason nan latitid oswa lonjitid. Pou ou kab vin nan 100 km pa pral fè ase nan yon diferans yo montre. Men, asire w ke ou chwazi East oswa West lonjitid ak North oswa South latitid! Lè sa a, klike sou "Ok" Se konsa, pwogram lan konnen ou reyèlman vle chanje anviwònman sa yo.

source: Now I'd recommend clicking the "Make Home" button. StarChart will save this location as your "home" position. From now on, whenever you start the activity the location will default to these coordinates.
ht: Koulye a, mwen ta rekòmande pou klike sou bouton an "Fè Kay". StarChart pral delivre kote sa a kòm "lakay" ou pozisyon. Depi koulye a, chak fwa ou kòmanse aktivite a kote a pral default kowòdone sa yo.

source: How to read the plot
ht: Kouman li trase a

source: Stars are drawn (with default settings of the "What" menu tab controls) as white dots of different sizes. The brightest stars are drawn as the biggest dots; the dimmest stars are drawn as the smallest dots.
ht: Stars yo trase (ak default anviwònman nan "Ki sa ki" kontwole yo tab meni) kòm pwen blan nan gwosè diferan. Zetwal yo pi klere yo trase kòm pi gwo pwen yo; zetwal yo dimmest yo trase kòm pwen yo pi piti.

source: The constellations are drawn as white lines forming the stick-figures defined by the International Astronomical Union.
ht: Douz gwoup zetwal yo ap trase kòm liy blan fòme baton-figi yo defini nan Creole astwonomi Inyon.

source: The sun, moon and "classical" planets are drawn as their astrological symbols and plotted much larger than they actually appear.
ht: Solèy la, lalin lan ak "klasik" planèt yo trase kòm senbòl Astwoloji yo ak konplo pi gwo pase yo aktyèlman parèt.

source: Deep sky objects are plotted as areas of gray, with different "decorations", depending on the type of the object.
ht: Gwo twou san fon objè syèl yo konplo kòm zòn nan gri, ak diferan "dekorasyon", ki depann sou kalite a nan objè a.

source: A diffuse nebula (such as the one in Orion) is plotted as a gray rectangle.
ht: Yon Nebula difize (tankou yon sèl la nan Orion) konplo kòm yon rektang gri.

source: A galaxy is plotted as a gray ellipse or circle with a white border.
ht: Yon galaksi konplo kòm yon elips gri oswa sèk ki gen yon fwontyè blan.

source: A planetary nebula is plotted as a gray circle with a central white dot.
ht: Yon Nebula planetè konplo kòm yon sèk gri ak yon dot santral blan.

source: An open cluster is plotted as a gray circle with no border.
ht: Yon gwoup louvri konplo kòm yon sèk gri ki pa gen okenn fwontyè.

source: A globular cluster is plotted as a gray circle with a white border and a central dot.
ht: Yon gwoup globuleuz konplo kòm yon sèk gri ak yon fwontyè blan ak yon dot santral.

source: Although the ellipse representing a galaxy is roughly the correct eccentricity, the orientation of the ellipse on the chart is arbitrary and does not reflect the galaxy's actual position angle.
ht: Malgre ke elips ki reprezante yon galaksi se apeprè eksantrisite ki kòrèk la, oryantasyon an nan elips la sou tablo a se abitrè epi yo pa reflete aktyèl ang pozisyon galaksi a.

source: To identify symbols, you can correlate them to the `Astronomical Symbols on Wikipedia <http://en.wikipedia.org/wiki/Astronomical_symbols>`_
ht: Pou idantifye senbòl, ou ka correspond yo `Senbòl nan astwonomi sou Wikipedia <http: // en. wikipedia. org / wiki / Astronomical_symbols> `_

source: Operating Instructions
ht: Enstriksyon Operating

source: The initial display for StarChart will show the sky for your locale and the current time. (This assumes you have done the steps described above in "Installation and set-up".)
ht: Ekspozisyon an premye pou StarChart pral montre syèl la pou lokalizasyon ou ak tan aktyèl la. (Sa a pansé ké ou te fè etap sa yo dekri anwo a nan "Enstalasyon ak mete-up". )

source: (We will go from left to right)
ht: (Nou pral ale de gòch a dwat)

source: |eye_ico| is for changing the appearance. For exapmle, it lets you change the color combinations of the map and decide how many stars you want to see and if you want the constellation figures. These settings get saved, too. So if you prefer black stars on white sky you can get that combination. Let's walk through each option and see what it does to the appearance of the map.
ht: | Eye_ico | se pou chanje aparans la. Pou exapmle, li pèmèt ou chanje konbinezon yo koulè nan kat jeyografik la ak deside ki jan anpil zetwal ou vle wè epi si ou vle figi yo konstelasyon. Anviwònman sa yo jwenn sove, tou. Se konsa, si ou prefere zetwal nwa sou syèl blan ou ka jwenn ke konbinezon. Se pou nou mache nan chak opsyon ak wè sa ki li fè sa nan aparans nan kat jeyografik la.

source: Things you can do
ht: Bagay sa yo ou ka fè

source: Toggle Full-Screen
ht: Baskil Full Screen

source: Toggle Night Vision
ht: Baskil Vizyon lannwit

source: The "Night Vision" option makes the activity's display mostly red on black. Red light doesn't affect your night vision so using this mode lets your eyes read the map and still remain sensitive enough to see the dim stars. Hint: it also helps to set the brightness of the back-light as low as you can and still read the chart to minimize the effect on your night vision.
ht: "Vizyon lannwit" opsyon a fè ekspozisyon aktivite a nan sitou wouj sou nwa. Limyè wouj pa afekte vizyon lannwit ou pou lè l sèvi avèk sa a mòd pèmèt je ou li kat jeyografik la ak toujou rete sansib ase yo wè zetwal yo dim. Men yon tipoul: li tou ede yo mete limyè nan back-limyè a osi ba ke ou kapab epi ou toujou ap li tablo a pou misyon pou minimize efè a sou vizyon lannwit ou.

source: Invert Display
ht: Envèse Display

source: But sometimes you will find it easier to work with a chart that's black on white like a page in a book. This mode is not good for use at night but it's fine in a classroom or in daylight. To get a black chart on a white background, set "Invert Display".
ht: Men, pafwa ou pral jwenn li pi fasil yo travay avèk yon tablo sa a, se nwa sou blan tankou yon paj nan yon liv. Sa a mòd se pa bon pou itilize nan mitan lannwit men li la amann nan yon sal klas oswa nan lajounen. Pou jwenn yon tablo nwa sou yon blan jan nou koumanse, mete "Envèse Display".

source: Normally, StarChart shows its map with east on the left. This may seem odd to you because a terrestrial map would show east on the right. But if you face east and hold the map so that east is near the ground, you'll discover that with a terrestrial map, north on the map is now to your south! With StarChart's mirrored map, north is north and south is south when east is down. That means what you see on your XO's screen will match what you see in the sky.
ht: Nòmalman, StarChart montre kat jeyografik li yo ak bò solèy leve sou bò gòch la. Sa ka sanble enpè ou paske yon kat jeyografik terrestres ta montre bò solèy leve sou bò dwat la. Men, si ou fè fas a bò solèy leve ak kenbe kat la pou ke bò solèy leve se tou pre tè a, ou pral dekouvri ke ak yon kat jeyografik terrestres, nò sou kat jeyografik la se kounye a nan sid ou! Avèk kat jeyografik reflete StarChart a, nò se nò ak nan sid bò solèy leve a se sid lè se desann. Sa vle di sa ou wè sou ekran an ou XO ap matche ak sa ou wè nan syèl la.

source: But if you find it confusing to have east on the left and west on the right, you can set "Flip L/R" and get the map to be like a terrestrial map.
ht: Men, si ou jwenn li konfizyon gen solèy leve sou bò gòch la ak nan lwès sou bò dwat la, ou ka mete "Flip L / R" epi pou yo jwenn kat la yo dwe tankou yon kat jeyografik terrestres.

source: Draw Constellations
ht: Trase konstelasyon

source: Stars are grouped in imaginary figures called constellations. These represented scientific and navigational instruments, gods and goddesses, mythical and real animals and other patterns that people saw in the sky. Since drawing detailed pictures would make the chart too confusing, astronomers usually draw simple stick-figures. StarChart normally plots these standard figures. But you can turn that off and just see the stars themselves if you want -- after all, there are no lines drawn in the sky!
ht: Stars yo gwoupe nan imajinè figi rele douz gwoup zetwal. Sa yo reprezante enstriman syantifik ak navigasyon, bondye yo ak deyès, bèt mitik ak reyèl ak lòt modèl ke gen moun ki te wè nan syèl la. Depi desen foto detaye ta fè tablo a twò konfizyon, astwonòm anjeneral trase senp bwa-figi. StarChart nòmalman simityè sa yo figi estanda. Men, ou ka vire ki koupe ak jis wè zetwal yo tèt yo si ou vle - apre tout, pa gen okenn liy trase nan syèl la!

source: Change magnitude level (Choose between 1 to 6)
ht: Nivo Chanjman grandè (Chwazi ant 1 a 6)

source: Stars come in different brightnesses. Astronomers call these levels of brightness "magnitudes". The brightest stars are magnitude zero (well, in a couple of cases, brighter than that); the dimmest stars that you can see without a telescope or binoculars on a really dark night will be about magnitude 6.
ht: Stars vini nan brightnesses diferan. Astwonòm rele nivo sa yo nan klète "anpler". Zetwal yo pi klere yo se grandè zewo (byen, nan yon koup la ka, pi klere pase sa); zetwal yo dimmest ke ou ka wè san yo pa yon teleskòp oswa longvi sou yon jou lannwit vrèman fè nwa pral sou grandè 6.

source: There are a lot more dim stars than bright ones. So if StarChart always plotted all the stars you could see, there would be so many (over 1,000!) that it would be hard for you to read the map. So there's a control (actually six of them) that lets you select how dim the stars the activity should bother to plot. StarChart defaults to plotting stars of magnitude 4 or brighter. This is a good compromise between having not enough stars to appreciate what the sky looks like and having so many that it's confusing. This brightness is about what you would see on an average night in suburban locations.
ht: Gen zetwal yon anpil plis pase sa dim klere. Se konsa, si StarChart toujou trase tout zetwal yo ou te kapab wè, ta gen anpil (plis pase 1,000!) Ke li ta ka difisil pou ou pou w li kat la. Se konsa, gen nan yon kontwòl (aktyèlman sis nan yo) ki pèmèt ou chwazi ki jan dim zetwal yo aktivite a ta dwe deranje trase. StarChart défaut trase zetwal nan grandè 4 oswa pi klere. Sa a se yon konpwomi bon ant gen pa ase zetwal yo apresye sa syèl la sanble epi ki gen anpil ke li nan konfizyon. Klète sa a se sou sa ou ta wè sou yon jou lannwit mwayèn nan kote banlye.

source: Here is what the plot looks like when you have asked for only the brightest of the stars. This is what the sky might look like from the middle of a large city. (magnitude level 1)
ht: Isit la se sa trase a sanble lè ou te mande pou sèlman klere a nan zetwal yo. Sa a se sa syèl la ta ka gade tankou nan mitan an nan yon gwo vil. (Nivo grandè 1)

source: And this is what the sky might look like from a mountain a long way from cities or towns on a moonless night. (magnitude level 6)
ht: Lè sa a se sa ki nan syèl la ta ka gade tankou soti nan yon ti mòn yon fason lontan soti nan tout lavil oswa lavil sou yon jou lannwit moonless. (Nivo grandè 6)

source: (magnitude level 4)
ht: (Nivo grandè 4)

source: Where |pos_ico| (Specify Location)
ht: Ki kote | pos_ico | (presize kote)

source: This is the menu tab that lets you tell StarChart from what place on earth you would like to see the sky plotted. Usually, this would be where you are, but sometimes you might want to see what the sky looks like to someone living elsewhere.
ht: Sa a se tab la meni ki pèmèt ou di StarChart soti nan sa ki kote sou tè a ou ta renmen wè syèl la konplo. Anjeneral, sa a ta dwe kote ou ye, men pafwa ou ta ka vle wè sa ki nan syèl la sanble ak yon moun k ap viv yon lòt kote.

source: A location on earth is specified by longitude and latitude. Longitudes go from zero to 180 degrees east or from zero to 180 degrees west. Latitudes go from zero to 90 degrees north or zero to 90 degrees south.
ht: Yon kote sou latè se espesifye nan lonjitid ak latitid. Longitudes ale soti nan zewo rive 180 degre bò solèy leve oswa soti nan zewo rive 180 degre lwès. Latitid ale soti nan zewo rive 90 degre nò oswa zewo rive 90 degre nan sid.

source: The StarChart activity will accept an angle as a number of degrees, including fractional degrees (like "123.45") or an angle as degrees, minutes and seconds. In this second type of angle, you must use a form like "123d27m33s". Enter longitude (be sure to select east or west) and latitude (be sure to select north or south) and click on the "Ok" button. If the new location is substantially distant from the old, the star map will look very different.
ht: Aktivite a StarChart ap aksepte yon ang ke yon nimewo nan degre, ki gen ladan degre fraksyon (tankou "123. 45 ") oswa yon ang kòm degre, minit ak segonn. Nan kalite sa a dezyèm nan ang, ou dwe itilize yon fòm tankou "123d27m33s". Antre nan lonjitid (asire w ke ou chwazi lès oswa lwès) ak latitid (asire w ke ou chwazi nò oswa sid), epi klike sou bouton an "Ok". Si kote a nouvo se anpil byen lwen soti nan fin vye granmoun lan, kat jeyografik nan zetwal pral gade trè diferan.

source: The "Make Home" button will set the selected location as your default observatory coordinates. This setting is then remembered for all future StarChart sessions.
ht: Bouton an "Fè Kay" pral mete kote a chwazi kòm default kowòdone Obsèvatwa ou. Se anviwònman sa a Lè sa a, vin chonje pou tout sesyon StarChart lavni.

source: When |time_ico| (Specify Time)
ht: Lè | time_ico | (Espesifye Tan)

source: These controls let you specify the time for which you want the chart plotted.
ht: Kontwòl sa yo kite ou presize tan an pou ki ou vle tablo a konplo.

source: Normally, "Now" is selected and the current year, month, day, hour and minute and the number of hours and minutes that your time-zone differs from GMT by is shown in the time and offset fields. Additionally, the time field will automatically be updated to track the current local time and the plot will automatically be recomputed once a minute. In this mode, the plot will match the current sky and will move over time the way the sky does. But you can also use these controls to specify that you want a chart for a particular time in the future or past.
ht: Nòmalman, "Koulye a," se chwazi ak aktyèl ane, mwa, jou, èdtan an ak minit ak nimewo a nan èd tan ak minit ki ou tan-zòn diferan de GMT pa yo montre nan tan la ak konpanse jaden. Anplis de sa, jaden an tan pral otomatikman mete ajou swiv aktyèl tan an lokal yo ak pral trase a otomatikman dwe rekalkile yon fwa yon minit. Nan sa a mòd, trase a ap matche ak syèl la kounye a ak ap deplase sou tan wout la nan syèl la fè. Men, ou ka tou itilize kontwole sa yo ou presize ke ou vle yon tablo pou yon tan patikilye nan tan kap vini an oswa sot pase.

source: Click the "Specify time" radio button, since "Now" isn't what you want anymore. Now specify the new time, beginning with the year. Time is entered as a four-digit year, a two-digit month and a two-digit day, separated by slash (/) characters, a comma (,) and then the hour and minute in 24-hour time separated by a colon (:). Example: 2008/02/20,22:00 would be 10 PM on the 20th of February, 2008. Next, if your location observes daylight time, you may need to add or subtract an hour from the time-zone offset value if the time you entered is on the "other side of the daylight time boundary". Finally, click "Ok" to get the new plot.
ht: Klike sou "Espesifye tan" bouton an radyo, depi "Koulye a," se pa sa ou vle ankò. Koulye a, presize tan an nouvo, kòmanse ak ane a. Tan se te antre nan kòm yon ane kat chif, yon mwa de-chif ak yon jou de-chif, separe pa koupe (/) karaktè, yon vigil (,) ak Lè sa a, lè a ak minit nan tan 24 èdtan ki separe pa yon kolon (:). Egzanp: 2008/02 / 20,22: 00 ta dwe 10 PM sou 20yèm la nan mwa fevriye, 2008. Next, si kote ou ye obsève tan lajounen, ou ka bezwen fè adisyon oswa soustraksyon yon èdtan de tan-zòn konpanse valè a si tan an ou te antre nan se sou "lòt bò a nan fwontyè a tan lajounen". Finalman, klike sou "Ok" jwenn konplo a nouvo.
