Repository: tony37/sledhelp
Catalog: translated_po/ht/stopwatch.po
Languages: ht

source: About
ht: Sou

source: StopWatch is the quintessential stopwatch Sugar, intuitivoy well as being easy to use, supports the needs of both simple and advanced timing.Among its innovations, StopWatch offers the ability to manage multiple timers simultaneously and to make it easier to manage their watches, you can rename them all.
ht: StopWatch se ekselans kronomètr Sugar a, intuitivoy byen ke yo te fasil yo sèvi ak, sipòte bezwen yo nan tou de distribisyon ki senp epi avanse. Pami innovations li yo, chronomètre ofri kapasite nan jere miltip time ansanm ak fè li pi fasil nan jere mont yo, ou ka chanje non yo tout.

source: Where to get StopWatch
ht: Ki kote yo ka resevwa StopWatch

source: While the StopWatch activity does not come preinstalled on all distributions OLPC software, you can download activity from its `Activity page <http://activities.sugarlabs.org/en-US/sugar/addon/4263>`_
ht: Pandan ke aktivite la kronomètr pa vini preenstale sou tout distribisyon lojisyèl OLPC, ou ka download soti nan `aktivite paj aktivite li yo <http: // aktivite. sugarlabs. org / en-US / sik / addon / 4263> `_

source: Using
ht: Lè l sèvi avèk

source: Indeed, the StopWatch activity is very easy to use, but if you do not understand any of the features of this activity, the references are listed below:
ht: Vreman vre, aktivite la kronomètr se trè fasil yo sèvi ak, men si ou pa konprann anyen nan karakteristik yo ki nan aktivite sa a, referans yo yo ki nan lis pi ba a:

source: Select the name of a timing to keep your work organized.
ht: Chwazi non an nan yon distribisyon a kenbe travay ou òganize.

source: Start/Pause the timing.
ht: Kòmanse / Pòz distribisyon an.

source: Reset the timing.
ht: Reyajiste distribisyon an.

source: Create a mark of this time(in others timers, known as "A return").
ht: Kreye yon mak nan tan sa a (nan lòt moun time, yo konnen kòm "Yon retou").

source: The visor of actual time.
ht: Vizyèr a nan aktyèl tan.

source: A list of all times you checked.
ht: Yon lis tout fwa ou tcheke.
