Repository: tony37/sledhelp
Catalog: translated_po/ht/story.po
Languages: ht

source: Story
ht: Istwa

source: About
ht: Sou

source: |Story_ico| The Story Activity uses images to prompt a learner to tell a story.
ht: | Story_ico | Istwa aktivite a sèvi ak imaj nan pouse yon elèv k ap aprann yo rakonte yon istwa.

source: The Story activity is available for download from the `Sugar Activity Library Story <http://activities.sugarlabs.org/sugar/addon/4565>`_
ht: Aktivite nan istwa ki disponib pou download soti nan istwa a `Sugar Bibliyotèk aktivite <http: // aktivite. sugarlabs. org / sik / addon / 4565> `_

source: Story can use the images from `Art4Apps project <http://wiki.sugarlabs.org/go/Art4Apps>`_ if installed.
ht: Istwa ka itilize imaj yo soti nan `Art4Apps pwojè <http: // wiki. sugarlabs. org / ale / Art4Apps> `_ si enstale.

source: Using Story
ht: Lè l sèvi avèk istwa

source: The learner should try to tell a story that ties the images together into a comprehensive narrative.
ht: Elèv k ap aprann nan ta dwe eseye rakonte yon istwa ki lyen imaj yo ansanm nan yon naratif konplè.

source: (From left to right)
ht: (Soti nan gòch a dwat)

source: Activity-toolbar Button: Opens standard Sugar activity toolbar
ht: Aktivite-toolbar Button: Louvri estanda toolbar aktivite Sugar

source: Reload-images Button: loads nine new images
ht: Reload-imaj bouton: charj nèf imaj nouvo

source: View all images at once Button
ht: Wè tout zidòl nan yon fwa bouton

source: View images one at a time Button
ht: View imaj yon sèl nan yon bouton tan

source: Playback Button: playback audio recording
ht: Bouton Lecture: lèktur odyo anrejistreman

source: Save as image
ht: Save kòm imaj

source: Save as PDF
ht: Save kòm PDF

source: (From top to bottom)
ht: (Soti nan anwo jouk anba)

source: Record input from microphone
ht: D 'Dosye nan mikwofòn

source: Play the recording
ht: Jwe anrejistreman an

source: Speak the story (text to speech)
ht: Pale istwa a (tèks nan diskou)

source: Learning with Story
ht: Aprann ak Istwa

source: Story is a fun way to get children to engage in narration. Simply generate some images and let the children's imagination do the rest.
ht: Istwa se yon fason amizan jwenn timoun yo angaje yo nan narasyon. Senpleman jenere kèk imaj, ak kite imajinasyon timoun yo nan fè rès la.

source: Extending Story
ht: Pwolonje Istwa

source: Ask the students to transcribe and refine their stories using the Sugar Write activity. (They can save to the Journal the images used to prompt their story and then embed this image into their Write document.)
ht: Mande elèv yo transkripsyon epi amelyore istwa yo lè l sèvi avèk sik Ekri aktivite a. (Yo ka sove Journal la imaj yo itilize yo pouse istwa yo ak Lè sa a Afiche imaj sa a nan dokiman yo Ekri. )

source: A spoken story (or notes) can be recorded to the Journal.
ht: Ou ka jwenn yon istwa di (oswa nòt) pral anrejistre Journal la.

source: Story can be shared, so the narration can be created amongst multiple students. They can chain together a story by taking turns; each turn involving generating narration for one image.
ht: Ka Istwa kapab pataje, se konsa ka narasyon an dwe kreye pami elèv yo miltip. Yo kapab chèn ansanm yon istwa pa pran vire; chak vire ki enplike génération narasyon pou yon imaj.

source: Modifying Story
ht: Modifye Istwa

source: Add new images to Story by putting them in the images folder of the activity.
ht: Ajoute imaj nouvo nan istwa pa mete yo nan dosye a imaj nan aktivite a.

source: The source code is available on `GitHub server <https://github.com/walterbender/story>`_
ht: Kòd la sous ki disponib sou GitHub `sèvè <https: // GitHub. com / walterbender / istwa> `_

source: Reporting Bugs
ht: Rapòte Pinèz

source: To report a bug or to see what bugs have been reported and/or fixed, please go to the `bug tracking page <https://bugs.sugarlabs.org/newticket?component=Story>`_.
ht: Pou rapòte yon ensèk oswa yo wè sa ki pinèz yo te rapòte ak / oswa fiks, tanpri ale nan `ensèk paj an swiv <https: // pinèz. sugarlabs. org / newticket eleman = Istwa?> `_.

source: Credits
ht: Kredi

source: Story was written and is maintained by `Walter <http://wiki.sugarlabs.org/go/User:Walter>`_, `Ignacio_Rodríguez <http://wiki.sugarlabs.org/go/User:Ignacio_Rodr%C3%ADguez>`_. He was inspired in part by Claudia Urrea.
ht: Istwa te ekri epi li se konsève pa `Walter <http: // wiki. sugarlabs. sugarlabs. org / ale / Itilizatè: Ignacio_Rodr% C3% ADguez> `_. Li te enspire an pati pa Claudia Urrea.

source: Most of the images are from the `The Noun Project <http://thenounproject.com/>`_.
ht: Pifò nan imaj yo se soti nan `Pwojè a nan Non <http: // thenounproject. com /> `_.

source: References
ht: Referans

source: `Wiki page <http://wiki.sugarlabs.org/go/Activities/Story>`_
ht: `Paj Wiki <http: // wiki. sugarlabs. org / ale / Aktivite / Istwa> `_
