Repository: tony37/sledhelp
Catalog: translated_po/ht/sugar_ui.po
Languages: ht

source: The Sugar User Interface
ht: Itilizatè Entèfas a Sugar

source: The Sugar platform encourages learning through personal expression.
ht: Platfòm nan Sugar ankouraje aprantisaj atravè ekspresyon pèsonèl.

source: The user interface differs from the traditional Desktop metaphor. It uses a "zooming" metaphor—each view represents a different scale of interaction. You move between a view of the network "neighborhood", your "friends", your "home page", and your currently open application ("Activity"). Each view occupies the entire screen. There are no overlapping windows to deal with.
ht: Koòdone nan itilizatè diferan de metafò a Desktop tradisyonèl. Ou deplase ant yon gade nan rezo "katye a", "zanmi" ou, "paj lakay" ou, ak aplikasyon kounye a louvri ou a ("Aktivite"). Chak vi okipe ekran an tout antye. Pa gen okenn fenèt sipèpoze fè fas ak.

source: With Sugar, you zoom between views: from your network neighborhood to your current Activity.
ht: Ak sik, ou rale ant vues: nan katye rezo ou aktivite ou ye kounye a.

source: Sugar supports sharing and collaboration by default. Sugar brings many of the rich collaboration mechanisms we are accustomed to from the Internet directly into the user interface. Sharing a file, starting a chat, collaborating in a writing exercise, or playing a game with other people are never more than a single click away.
ht: Sugar sipòte pataje ak kolaborasyon pa default. Sugar pote anpil nan fòmil yo kolaborasyon rich nou yo abitye nan entènèt la dirèkteman nan koòdone nan itilizatè. Pataje yon dosye, kòmanse yon chat, kolabore nan yon egzèsis ekri, oswa jwe yon jwèt ak lòt moun yo pa janm pi plis pase yon sèl klike lwen.

source: Sugar incorporates a Frame around the border of the screen; the Frame holds status information, such as alerts, a clipboard, open activities, and your current collaborators.
ht: Sugar genyen ladan l yon Frame alantou fwontyè a nan ekran an; Frame la kenbe enfòmasyon estati, tankou alèt, yon papye, aktivite louvri, ak kolaboratè ou ye kounye a.

source: Sugar maintains a Journal (or diary) of everything you do; it is a place for reflection. You do not need to save files or create folders; Activities automatically save your work to the Journal.
ht: Sugar kenbe yon Journal (oswa jounal pèsonèl) nan tout sa ou fè; li se yon kote pou refleksyon. Ou pa bezwen pou konsève pou dosye oswa kreye dosye; Aktivite otomatikman sove travay ou a Journal la.

source: Sugar emphasizes discovery. Every object in the interface has a menu that reveals more details and options for action. Many Activities include a "view source" option; for example, the Browse activity lets you examine the HTML code that reveals how a web page is created. Most Activities are written in the Python scripting language. You can see how they work, and make changes to them.
ht: Sugar mete aksan sou dekouvèt. Chak objè nan koòdone la gen yon meni ki revele plis detay ak opsyon pou aksyon. Anpil Pami aktivite yo genyen yon "sous vi" opsyon; pou egzanp, aktivite a Browse pèmèt ou egzaminen kòd la HTML ki revele ki jan se yon paj wèb kreye. Pifò Aktivite sa ekri nan lang nan scripting Piton. Ou ka wè ki jan yo travay, epi fè chanjman yo.

source: Sugar has clarity of design. There is no need to "double click". There are no overlapping windows. Sugar uses color and shape throughout the interface to provide a fun, expressive, approachable platform for computing.
ht: Sugar gen klè nan konsepsyon. Pa gen okenn nesesite nan "doub klike sou". Pa gen okenn fenèt sipèpoze. Sugar sèvi ak koulè ak fòm nan tout koòdone a bay yon plezi, espresif, abòdab platfòm pou informatique.

source: For parents and teachers
ht: Pou paran yo ak pwofesè

source: **Activities, not Applications**
ht: ** Aktivite, pa Aplikasyon **

source: Sugar does not have applications in the traditional sense. Activities are distinct from applications in what they focus on (collaboration and expression) and in their implementation (journaling and iteration). This is more than a new naming convention; it represents an intrinsic quality of the learning experience we hope the children will have when using Sugar.
ht: Sugar pa gen aplikasyon nan sans nan tradisyonèl. Aktivite yo diferan de aplikasyon pou nan sa yo konsantre sou (kolaborasyon ak ekspresyon), ak nan aplikasyon yo (journal ak iterasyon). Sa a se pi plis pase yon nouvo konvansyon nonmen; li reprezante yon bon jan kalite intrinsèques nan eksperyans la aprann nou espere timoun yo pral gen lè w ap itilize Sugar.

source: **Presence is always Present**
ht: ** Prezans se toujou prezan **

source: Everyone has the potential for learning and teaching. Sugar puts collaboration at the core of the user experience in order to realize this potential. The presence of other learners encourages children to take responsibility for others' learning as well as their own. The exchange of ideas amongst peers makes the learning process more engaging and stimulates critical thinking skills. Sugar encourages these types of social interaction with the laptops.
ht: Tout moun gen potansyèl la pou edikasyon ak ansèyman. Sugar mete kolaborasyon nan nwayo a nan eksperyans nan itilizatè yo nan lòd yo reyalize potansyèl sa a. Prezans nan lòt elèv k ap aprann ankouraje timoun yo pran responsablite pou aprantisaj lòt moun 'kòm byen ke pwòp yo. Echanj la nan lide pami kamarad klas fè pwosesis aprantisaj la plis enteresan ak stimul aptitid pou panse kritik. Sugar ankouraje sa yo kalite entèraksyon sosyal ak laptops yo.

source: Most activities have the potential to become network enabled. For example, consider the Browse activity. With typical computer interfaces, you browse in isolation. In Sugar, sharing links is an integral part of Browse, transforming web-surfing into a group collaboration.
ht: Pifò aktivite gen potansyèl la yo vin rezo pèmèt. Pou egzanp, konsidere aktivite a Browse. Avèk interfaces òdinatè tipik, ou browse nan izolasyon. Nan Sugar, pataje lyen se yon pati entegral nan Browse, transfòme web-Navigasyon nan yon kolaborasyon gwoup.

source: **Tools of Expression**
ht: ** Zouti nan Ekspresyon **

source: Sugar emphasizes thinking, expressing, and communicating using technology. Sugar starts from the premise that we want to use what people already know in order to make connections to new knowledge. Computation is a "thing to think with". Sugar makes the primary activity of the children one of creative expression, in whatever form that might take. Most activities focus on the creation of some type of object, be it a drawing, a song, a story, a game, or a program. In another language shift describing the user experience, we refer to objects rather than files as the primary stuff of creative expression.
ht: Sugar mete aksan sou panse, eksprime, ak kominike lè l sèvi avèk teknoloji. Sugar kòmanse soti nan lan site ke nou vle sèvi ak sa moun deja konnen nan lòd fè koneksyon ak nouvo konesans. Kalkil se yon "bagay yo panse ak". Sugar fè aktivite a prensipal nan timoun yo youn nan ekspresyon kreyatif, nan tou sa fòm ki ta ka pran. Pifò aktivite konsantre sou kreyasyon an nan kèk kalite objè, se pou li yon desen, yon chan, yon istwa, yon jwèt, oswa nan yon pwogram. Nan yon lòt chanjman lang dekri eksperyans nan itilizatè, nou al gade nan objè olye ke dosye kòm bagay la prensipal nan ekspresyon kreyatif.

source: As most software developers would agree, the best way to learn how to write a program is to write one, or perhaps teach someone else how to do so. Studying the syntax of the language is useful, but it doesn't teach one how to code. We apply the principle of "learning through doing" to all types of creation. For example, we emphasize composing music over downloading music. We also encourage the children to engage in the process of collaborative critique of their expressions and to iterate upon this expression as well.
ht: Kòm pi fò devlopè lojisyèl ta dakò, pi bon fason pou aprann kijan pou ekri yon pwogram se yo ekri yon sèl, oswa petèt anseye yon lòt moun ki jan yo fè sa. Etidye sentaks la nan lang lan se itil, men li pa youn anseye ki jan yo kòd. Nou aplike prensip la nan "aprann nan fè" nan tout kalite kreyasyon. Pou egzanp, nou mete aksan konpozisyon mizik sou Téléchargez mizik. Nou menm tou nou ankouraje timoun yo angaje yo nan pwosesis la nan kolaborasyon kritike nan ekspresyon yo ak repekte sou ekspresyon sa a kòm byen.

source: Turning the traditional file system into objects speaks more directly to real-world metaphors: instead of a sound file, we have an actual sound; instead of a text file, a story. In order to support this concept, activity developers can define object types and associated icons to represent them.
ht: Vire sistèm nan dosye tradisyonèl nan objè pale plis dirèkteman nan metafò mond reyèl la: olye pou yo yon dosye son, nou gen yon son aktyèl; olye pou yo yon dosye tèks, yon istwa. Yo nan lòd yo sipòte konsèp sa a, aktivite devlopè ka defini kalite objè ak ikon asosye reprezante yo.

source: **Journaling**
ht: ** Journal **

source: The concept of the Journal, a written documentation of everyday events, is generally understood, albeit in various forms across cultures. A journal typically chronicles the Activities one has done throughout the day. We have adopted a journal metaphor for the file system as our approach to file organization. The underlying implementation of the journal does not differ significantly from file systems in contemporary operating systems. The file system layout is less important than the journal itself.
ht: Konsèp la nan jounal la, yon dokiman ekri nan evènman chak jou, se jeneralman konprann, kwake nan divès kalite fòm nan tout kilti. Yon jounal tipikman Istwa Aktivite yo youn te fè pandan tout jounen an. Nou te adopte yon metafò jounal pou sistèm nan dosye kòm apwòch nou pote òganizasyon. Aplikasyon an kache nan jounal la pa gen diferans siyifikativman soti nan sistèm dosye ki nan sistèm operasyon kontanporen. Layout a sistèm dosye se mwens enpòtan pase jounal la tèt li.

source: The journal embodies the idea of storing a history of the things a child has done and the activities a child has participated in. The child, parent, and teacher can reflect on the journal to assess progress.
ht: Jounal la defini lide a nan estoke yon istwa de bagay sa yo te yon timoun fè ak aktivite yo yon timoun te patisipe nan. Timoun, paran, ak pwofesè a ka reflechi sou jounal la evalye pwogrè.

source: The Journal stores objects created while the student runs an Activity. This function is secondary, although important. The Journal naturally lends itself to a chronological organization. Objects in the Journal can be tagged, searched, and sorted by a variety of means. The Journal records what a child has done, not just what the child has saved. The Journal is a portfolio or scrapbook history of the child's interactions with the machine and also with peers.
ht: Magazen yo Journal objè kreye pandan y ap elèv la kouri yon aktivite. Fonksyon sa a se segondè, byenke enpòtan. Jounal nan natirèlman Confer tèt li yon òganizasyon kwonolojik. Objè ki nan jounal la ka atenn, fouye, ak Ranje pa yon varyete de vle di. Jounal nan dosye sa yon timoun te fè, pa sèlman sa ki te timoun nan sove. Journal a se yon dosye oswa Scrapbook istwa nan entèraksyon timoun nan ak machin nan epi tou li ak lòt timoun parèy.

source: The Journal includes entries explicitly created by the children with entries that are implicitly created through the child's participation in an Activities. Developers must think carefully about how an activity integrates with the Journal more so than with a traditional file system that functions independently of an application. The Activities, the objects, and the means of recording all tightly integrate to create a different kind of computer experience.
ht: Journal a gen ladan antre klèman kreye pa timoun yo ak antre ke yo chal kreye atravè patisipasyon timoun nan nan yon Aktivite. Devlopè yo dwe panse ak anpil atansyon sou ki jan yon aktivite entegre ak jounal la plis konsa pase ak yon sistèm dosye tradisyonèl ki fonksyon poukont nan yon aplikasyon. Aktivite yo, objè yo, ak vle di la a anrejistreman tout byen sere entegre yo kreye yon lòt kalite diferan nan eksperyans òdinatè.
