Repository: tony37/sledhelp
Catalog: translated_po/ht/sugar_features.po
Languages: ht

source: Sugar Features
ht: Features Sugar

source: This page presents a number of Sugar features common to many Activities. The page is designed as a series of "reference topics".
ht: Paj sa a prezante yon nimewo nan karakteristik komen nan Sugar Aktivite anpil. Se paj la ki fèt kòm yon seri de "sijè referans".

source: This experimental page includes graphical spacers to separate non-related topics.
ht: Paj eksperimantal sa a gen ladan bag grafik separe sijè ki pa gen rapò.

source: View source
ht: View sous

source: You always can view the source code of Sugar Activities. In most cases, View Source will show you the python code of the activity, in other cases, like Browse, you can see the HTML code of the page seen in the activity.
ht: Ou toujou kapab wè kòd la sous nan Sugar Aktivite. Nan pifò ka, View Sous pral montre w kòd la piton nan aktivite a, nan lòt ka, tankou Browse, ou ka wè kòd la HTML nan paj la wè nan aktivite a.

source: You can see the source window pressing Fn-space in your XO or Ctrl-Shift-V or pressing right click on the Activity's icon in the :doc:`/frame`. Here is an example of viewing the source of a page in :doc:`/help` Activity. In the case of this activity, you see the simple text, which Help converts into HTML pages for display. This is useful in the process of editing Help pages as described here :doc:`/how_to_help`
ht: Ou ka wè fenèt la sous peze FN-espas nan XO ou oswa Ctrl-chanjman-V oswa peze dwa klike sou icon Aktivite a nan: doc la: `/ frame`. Isit la se yon egzanp sou gade sous la nan yon paj nan: doc: `/ Aktivite help`. Nan ka a nan aktivite sa a, ou wè tèks la ki senp, ki Ede konvèti nan paj HTML pou ekspozisyon. Sa a se itil nan pwosesis la nan koreksyon Ede Paj jan sa dekri isit la: doc: `/ how_to_help`

source: Duplicating activities
ht: Fotokopi aktivite

source: A option to duplicate an activity has been added to the View Source alert. By selecting this option, a copy of the activity is created in the user's $HOME/Activities directory. Thus we hope to encourage Sugar users to make modifications and improvements to the code they use without the risk of breaking the original activity.
ht: Yon opsyon yo kopi yon aktivite yo te ajoute nan View Sous alèt la. Pa chwazi opsyon sa a, se yon kopi nan aktivite a ki te kreye nan itilizatè a $ HOME / Aktivite anyè. Se konsa, nou espere ankouraje Sugar itilizatè yo fè modifikasyon ak amelyorasyon nan kòd la yo itilize san yo pa risk pou yo kraze aktivite a orijinal.

source: |more| For more information:
ht: | Plis | Pou plis enfòmasyon:

source: The Sugarlabs.org wiki has a informative article: http://wiki.sugarlabs.org/go/View_Source
ht: Sugarlabs yo. org wiki gen yon atik nan yon enfòmatif: http: // wiki. sugarlabs. org / ale / View_Source

source: *End of topic - spacer below.*
ht: * Fen topic - spacer anba a. *

source: Say selected text
ht: Di chwazi tèks

source: You can have :doc:`/speak`, or robot Alice, read aloud, selected text. Here we demonstrate Alice reading text framed by :doc:`/help`. In Help, for instance, you can select a whole page of text, and have it read aloud to you while you explore that Activity.
ht: Ou ka gen: doc: `/ speak`, oswa robo Alice, li awotvwa, chwazi tèks. Isit la nou demontre Alice lekti tèks ankadre pa: doc: `/ help`. Nan èd, pou egzanp, ou ka chwazi yon paj antye nan tèks, epi yo gen li li awotvwa nan ou pandan w ap eksplore ki aktivite.

source: Try it now, Select the text in this frame.
ht: Eseye li kounye a, Chwazi tèks la nan sa a ankadreman.

source: To select text, move the mouse to the top left of the text, there is a green arrow near the correct point. Click the left, or main, mouse button. Move the cursor to the bottom right of the text to select, there is a red arrow near the correct point.
ht: Pou chwazi tèks, deplase sourit la a gòch an tèt nan tèks la, gen yon flèch vèt tou pre pwen an kòrèk. Klike sou bò gòch, oswa prensipal yo, bouton an sourit. Deplase kurseur a sou bò dwat la anba nan tèks la nan chwazi, gen yon flèch wouj tou pre pwen an kòrèk.

source: Bring in the :doc:`/frame` with the "Frame key" or F6. Press on the "Speech lips" icon in the bottom of the frame, then press on *Say selected text*. Notice also that there is a pause feature, once *speech* has started.
ht: Pote nan: doc la: `/ frame` ak" kle a Frame "oswa F6. Peze sou "bouch Lapawòl" icon an nan pati anba a nan ankadreman an, Lè sa a, peze sou * Di chwazi tèks *. Avi tou ke gen se yon karakteristik pran yon poz, yon fwa * lapawòl * te kòmanse.

source: The *Say selected text* feature is available in many text based Activities including :doc:`/browse`, :doc:`/fototoon`, :doc:`/write`. Look out for the "Speech lips" icon in the bottom of the Frame, or as a button in the toolbar of an Activity, as in :doc:`/write`.
ht: Tèks la * Di chwazi * karakteristik se disponib nan anpil tèks Aktivite ki baze tankou: doc: `/ browse`,: doc:` / fototoon`,: doc: `/ write`. Gade deyò pou "bouch Lapawòl" icon an nan pati anba a nan ankadreman an, oswa kòm yon bouton nan ba ikòn a nan yon aktivite, tankou nan: doc: `/ write`.

source: This is a new unfinished page, you can modify it yourself following guidance here :doc:`/how_to_help`
ht: Sa a se yon paj nouvo fini, ou ka modifye li tèt ou suiv direksyon isit la: doc: `/ how_to_help`
