Repository: tony37/sledhelp
Catalog: translated_po/ht/tamtammini.po
Languages: ht

source: About TamTamMini
ht: Sou TamTamMini

source: Welcome to TamTamMini! This chapter of the Users manual is about TamTamMini which is part of a suite of four musical Activities for use on the XO computer. Each of the four Activities is a bit different. In general they require increasingly higher levels of musical skill to use.
ht: Byenveni nan TamTamMini! Chapit sa a nan manyèl la Itilizatè yo se sou TamTamMini ki se yon pati nan yon suite nan kat Aktivite mizik pou itilize sou òdinatè a XO. Chak nan kat Aktivite yo se yon ti jan diferan. An jeneral yo mande pou de pli zan pli pi wo nivo nan konpetans mizik yo sèvi ak.

source: **TamTamMini** is the simplest of the four TamTam Activities but it offers a surprising variety of sophisticated features. It is simple enough to have fun with and suitable for ages 2 -92! Yet, it is complex enough to let you experiment. It can be used by a single XO laptop or more but does not utilize the mesh network.
ht: ** TamTamMini ** se pi senp la nan kat Aktivite yo tamtam men li ofri yon varyete etone nan karakteristik sofistike. Li se senp ase yo pran plezi ak ak apwopriye pou laj 2 -92! Men, li se konplèks ase yo kite ou eksperyans. Li kapab itilize pa yon laptop XO sèl oswa plis, men se pa itilize rezo a may.

source: You can begin by choosing an instrument or sound and experimenting with playing simple scales and songs using the XO's QWERTY keyboard. This manual will help you learn to do that.
ht: Ou ka kòmanse pa chwazi yon enstriman oswa yon son ak fè eksperyans avèk jwe balans senp ak chante lè l sèvi avèk klavye kvèrti XO a. Manyèl sa a ap ede ou aprann fè sa.

source: For more about TamTamMini, including how to use the Drum Machine and Loops, see the "`Fun With TamTamMini <http://booki.flossmanuals.net/fun-with-tam-tam/_full/>`_" FLOSS manual.
ht: Pou plis enfòmasyon sou TamTamMini, ki gen ladan ki jan yo sèvi ak machin nan Tanbou ak loup, gade "` plezi a ak TamTamMini <http: // booki. flossmanuals. net / plezi-ak-tam-tam / _full /> `_" manyèl itilize fil dantè.

source: **TamTamJam** is more complex than TamTamMini, but still suitable for school age children and adults. It has a different main screen but the same instruments and is designed for performance. You can record small melodic phrases and can combine several customizable loops. You can also share the beat with other XOs through the mesh network.
ht: ** TamTamJam ** se pi plis konplèks pase TamTamMini, men yo toujou apwopriye pou timoun ki gen laj lekòl ak granmoun. Li te gen yon diferan ekran prensipal men enstriman mizik yo menm ak se fèt pou pèfòmans. Ou ka anrejistre ti fraz melodi ak ka konbine plizyè pasan customizable. Ou kapab tou pataje bat la ak lòt XO nan rezo a may.

source: **TamTamEdit** is the basic TamTamActivity and must be installed in order to run any of the other Tam Tan Activities. It has much more sophisticated loops where you can choose instruments, pitches and the duration of notes on five different tracks. It offers almost 100 different musical sounds and a limitless variety of musical styles.
ht: ** TamTamEdit ** se TamTamActivity debaz la, epi yo dwe enstale nan lòd yo kouri nenpòt nan lòt Tan Aktivite yo Tam. Li te gen pasan pi plis sofistike kote ou ka chwazi enstriman mizik, ton ak dire a nan nòt sou senk echantiyon tren diferan. Li ofri prèske 100 diferan son mizik ak yon varyete illimité nan Styles mizik.

source: **TamTamSynthLab** is a highly sophisticated synthesizer program suitable for advanced work in both music and physics.
ht: ** TamTamSynthLab ** se yon pwogram trè sofistike synthesizer apwopriye pou travay avanse nan tou de mizik ak fizik.

source: Starting TamTamMini
ht: Koumanse TamTamMini

source: Select the TamTamMini icon (little drum with drumsticks)from the Favorites View. If you aren't sure you have the right Activity, hover your cursor over the icon for a few seconds and, a little label that says "TamTamMini" will appear.
ht: Chwazi icon nan TamTamMini (ti tanbou ak pilon) soti nan Favorites View. Si ou pa w ke ou gen aktivite nan dwa, hover kurseur ou sou icon nan pou yon kèk segond, epi, yon etikèt sou ti kras ki di "TamTamMini" ap parèt.

source: If you cannot find TamTamMini, change to the List View
ht: Si ou pa ka jwenn TamTamMini, chanje Lis View

source: When you find it in List View first check the little star next to the name of the Activity. If it is not filled in, click on the star so you can move it to the Favorites View. In either view, when you find the icon, click on it to open TamTamMini.
ht: Lè ou jwenn li nan lis View premye tcheke ti kras zetwal la akote non an nan aktivite a. Si li pa plen nan, klike sou zetwal la pou ou kapab deplase li sou favori yo yo View. Nan nenpòt vi, lè ou jwenn icon a, klike sou li yo louvri TamTamMini.

source: Learning With TamTamMini
ht: Aprann Avèk TamTamMini

source: Choosing An Instrument
ht: W ap chwazi yon Enstriman

source: TamTamMini offers a wide variety of instruments and sounds. Before choosing the instrument you will use in these explorations, take time to try all of the sounds. If you hover your cursor over one of the pictures, the name of the instrument or sound will appear. Click on the picture and you will hear the sound. Clicking again repeats the sound.
ht: TamTamMini ofri yon gran varyete enstriman ak son. Anvan w ap chwazi enstriman an ou pral sèvi nan eksplorasyon sa yo, pran tan yo eseye tout nan son yo. Si ou hover kurseur ou sou youn nan foto yo, non an nan enstriman an oswa son ap parèt. Klike sou foto a, epi ou pral tande son an. Klike ankò repete son an.

source: After trying all of the sounds, choose the instrument you will use. Please choose a wind instrument or a bowed string instrument to get a sustained sound as you work. Later, after you understand how TamTamMini works, you can play with all of the other sounds. Some instruments that work well for this include the trumpet, flute, violin, or cello. Other wind and bowed instruments will also work fine.
ht: Apre ap eseye tout nan son yo, chwazi enstriman an ou pral sèvi avèk. Tanpri, chwazi yon enstriman van oswa yon enstriman fisèl bese yo ka resevwa yon son soutni pandan w ap travay. Apre sa, apre ou konprann ki jan TamTamMini ap travay, ou ka jwe ak tout lòt son yo. Gen kèk enstriman mizik ki travay byen pou sa a gen ladan twonpèt, flit, violon, oswa cello a. Lòt van ak bese enstriman ap travay tou amann.

source: Introduction To The Keyboard
ht: Entwodiksyon nan klavye a

source: TamTamMini utilizes the regular keyboard to play the musical notes. This can be confusing to people who have studied music before as the traditional names of the notes will not match the letters, numbers and symbols on the keys. For this reason, we suggest you use a "movable Do" where a major scale becomes Do-Re-Mi-Fa-Sol-La-Ti-Do. Note: Some countries replace the "Ti" with "Si."
ht: TamTamMini itilize klavye a regilye yo jwe nòt yo mizik. Sa a kapab konfizyon ak moun ki te etidye mizik anvan kòm non yo tradisyonèl nan nòt yo pa ap matche ak lèt, nimewo yo ak senbòl sou kle yo. Pou rezon sa a, nou sijere ou sèvi ak yon "mobil Èske" kote yon gam majè vin fè-Re-Mi-Fa-Sol-La-Ti-aji. Remak: Gen kèk peyi ranplase "Ti a" ak "Si. "

source: Playing A Major Scale
ht: Jwe yon gam majè

source: In most western music a 7 note scale is used and then the names of the notes start over on the eighth note. We call this an octave. Interestingly the eighth note, which has the same name as the first one has exactly twice as many vibrations per second as the first note.
ht: Nan pifò mizik lwès se yon echèl 7 nòt itilize ak Lè sa a, non yo nan nòt yo kòmanse sou sou nòt la wityèm. Nou rele sa yon oktav. Enteresan nòt la wityèm, ki te gen non an menm kòm youn nan premye gen egzakteman de fwa tankou anpil vibrasyon pou chak dezyèm kòm nòt nan premye.

source: Use the instrument you have chosen to try playing a 2 octave major scale using these keys on the XO keyboard. We have included the Do-Re-Mi syllables for you as well.
ht: Sèvi ak enstriman ou chwazi a eseye jwe yon gwo echèl 2 oktav l sèvi avèk kle sa yo sou klavye a XO. Nou te enkli silab a fè-Re-Mi pou ou kòm byen.

source: (First Octave)
ht: (Premye Octave)

source: Do Re Mi Fa Sol La Ti Do
ht: Èske Re Mi Fa Sol La Ti Fè

source: Z X C V B N M ,
ht: Zksvbm,

source: (Second Octave)
ht: (Dezyèm Octave)

source: Note: "Do" is repeated in the second line. Leave one out if you like. You may also want to practice the scale a bit until you feel comfortable with it.
ht: Remak: "Èske" se repete nan liy nan dezyèm. Kite yon sèl soti si ou renmen. Ou kapab vle tou yo pratike echèl la yon ti jan jiskaske ou santi ou konfòtab ak li.

source: Playing A Simple Song
ht: Jwe yon Song Senp

source: When you feel comfortable playing the 2 octave major scale, try this simple song. We think you may recognize it. The little line added to some of the Do-Re-Mi syllables indicates you hold that note twice as long as the other notes. (Example: Mi___)
ht: Lè ou santi ou alèz jwe 2 oktav gwo echèl la, eseye chante senp sa a. Nou panse ke ou ka rekonèt li. Liy lan ti kras te ajoute nan kèk nan silab a fè-Re-Mi endike ou kenbe ki nòt de fwa osi lontan ke lòt nòt yo. (Egzanp: Mi___)

source: Mi Re Do Re Mi Mi Mi___
ht: Re Mi Èske Re Mi Mi Mi___

source: Mi Re Do Re Mi Mi Mi Mi
ht: Re Mi Èske Re Mi Mi Mi Mi

source: X X C X Z___
ht: X X X C Z___

source: **Challenge:** Play this same song using QWERT for the notes.
ht: ** Defi: ** Jwe chante sa a lè l sèvi avèk menm qwert pou nòt yo.

source: **Challenge:** If you have more than one XO player, try with the same instrument but one using the ZXCVB keys and the other using QWERT. Experiment with other combinations of instruments to see how they sound together.
ht: ** Defi: ** Si ou gen plis pase yon sèl jwè XO, eseye ak enstriman a menm men se yon sèl lè l sèvi avèk kle yo ak lòt lè l sèvi avèk ZXCVB qwert la. Eksperyans ak lòt konbinezon nan enstriman mizik yo wè ki jan yo son ansanm.

source: **Challenge:** Chords are formed when 3 or more different notes are played at the same time. This happens when you strum on a guitar, ukulele, or similar instrument. Three or more wind or string instruments can combine to play chords together too. Here are 3 simple chords you can play using the notes you already know. In music these chords also have names based on the steps of the scale the main note is on, this is not always the lowest note. For example, a note with Do as the main note will be called a I (Roman numeral one) chord and a chord based on Sol will be called a V (Roman numeral five) chord.
ht: ** Defi: ** Chords yo ki te fòme lè 3 oswa plis nòt diferan yo yo te jwe nan menm tan an. Sa rive lè ou rakle sou yon gita, uklele, oswa enstriman ki sanble. Twa oswa plis van oswa fisèl enstriman ka konbine yo jwe chords ansanm twò. Isit la yo se 3 chords senp ou ka jwe lè l sèvi avèk nòt yo ou deja konnen. Nan mizik kòd sa yo yo te genyen tou non ki baze sou etap sa yo nan echèl la nòt prensipal la se sou, sa a se pa toujou nòt la ki pi ba. Pou egzanp, y ap fè yon nòt ak Èske kòm nòt nan prensipal dwe rele yon mwen (Women youn a chif) kòd ak yon kòd ki baze sou Sol pral dwe rele yon V (Women a chif senk) kòd.

source: Try these:
ht: Eseye sa yo:

source: ``Sol B La N Ti M Sol T``
ht: `` Sol B N M Sol Ti T`` a

source: ``Mi C Fa V Fa B Mi E``
ht: `` Mwen C V Fa Fa B mwen E``

source: ``Do Z Do Z Re X Do Q``
ht: `` Èske Z Z Èske Re X Èske Q``

source: ``I IV V I``
ht: `` Mwen IV V I``

source: Playing Other Songs
ht: Jwe Lòt Songs

source: Here is another song already figured out for you to try. It is an old European children's folk song. It was so popular that two famous composers, Mozart and Haydn, both it to use in their music.
ht: Isit la se yon lòt chante deja kalkile pou ou pou w eseye. Li se yon Ewopeyen an chante fin vye granmoun timoun yo popilè. Li te tèlman popilè ke de konpozitè pi popilè yo, Mozart ak Haydn, tou de li yo itilize nan mizik yo.

source: Do Do Sol Sol La La Sol____
ht: Èske Sol Sol La La Sol____

source: Challenges
ht: Defi

source: Try to figure out other simple songs on the XO. Write them down to help you remember the notes and to share them with other people.
ht: Eseye figi konnen lòt chante ki senp sou XO a. Ekri yo desann nan ede ou sonje nòt yo ak pataje yo avèk lòt moun.

source: If you have enjoyed working with TamTamMini, you can find more information and ideas in the FLOSS manual, "Fun With TamTamMini" which will be available soon.
ht: Si ou te jwi travay ak TamTamMini, ou ka jwenn plis enfòmasyon ak lide nan manyèl la itilize fil dantè, "Plezi ak TamTamMini" ki yo ap disponib byento.

source: Note: This introduction to TamTamMini has focused on the Major Scale which is commonly used in music with a European heritage. To learn about the Pentatonic Scale, which is used in folk music of almost all cultures worldwide see the FLOSS Manual, "Fun With TamTamMini," where it is included.
ht: Remake byen: gen entwodiksyon sa a konsantre sou TamTamMini Echèl la Gwo ki se souvan itilize nan mizik ak yon eritaj Ewopeyen. Pou aprann plis sou Echèl la pentatonic, ki te itilize nan mizik popilè nan prèske tout kilti atravè lemond ale nan manyèl itilize fil dantè, "Plezi ak TamTamMini," kote li se enkli.
