Repository: tony37/sledhelp
Catalog: translated_po/ht/terminal.po
Languages: ht

source: Terminal
ht: Tèminal

source: About
ht: Sou

source: Terminal is a full-screen text mode program that provides a Command-Line Interface (CLI) to the software on a Linux system, such as the Fedora Linux that Sugar on the XO is based on. Users type (sometimes cryptic) commands to perform file management, system administration, or in fact almost anything that can be done within Linux that does not involve graphics or video.
ht: Tèminal se yon pwogram mòd tèks plen ekran-ki bay yon Entèfas Kòmandman-Liy (kote klima a leplisouvan) nan lojisyèl an sou yon sistèm Linux, tankou Fedora Linux a ki Sugar sou XO a se ki baze sou. Itilizatè di (pafwa skre) kòmande fè jesyon dosye, administrasyon sistèm, oswa an reyalite prèske anyen ki ka fè nan Linux ki pa enplike grafik oswa videyo.

source: For example, typing **pwd** (Print name of current/Working Directory) at the command line in the home directory gives that location as /home/olpc, and typing **ls** at the command line lists the content of the current directory.
ht: Pou egzanp, ou tape ** PWD ** (Enprime non aktyèl / Anyè Travay) nan liy lan bay lòd nan anyè an kay bay ki kote kòm / Home / OLPC, ak sezisman ** ls ** nan liy lan lòd bay lis sa ki ekri nan anyè aktyèl la.

source: Where to get Terminal
ht: Ki kote yo ka resevwa Tèminal

source: Terminal is provided with Sugar on every XO. However, by default it is not selected for display in the Home view as a Favorite.
ht: Se Tèminal bay ak Sugar sou chak XO. Sepandan, pa default li pa chwazi pou ekspozisyon nan gade nan Kay kòm yon pi renmen.

source: To select Terminal as a Favorite, go to Home view, then click the List view icon. Type **Te** into the search box. Click the star next to Terminal. When you switch back to the ring of icons in Home view, Terminal will be visible.
ht: Pou chwazi Tèminal kòm yon pi renmen, ale nan Kay vi, Lè sa a, klike sou ikòn nan Lis View. Tape ** Te ** nan bwat rechèch la. Klike sou zetwal nan pwochen nan Tèminal. Lè ou chanje tounen nan bag la nan ikon nan gade Kay, Tèminal pral vizib.

source: Alternatively, you can leave Terminal unselected, and start it from list view by clicking its icon or selecting Start from its hover menu.
ht: Altènativman, ou ka kite Tèminal selèksyone, epi yo kòmanse li nan lis View pa klike icon li yo oswa chwazi soti nan meni Start hover li yo.

source: If for some reason Terminal is not installed, it can be downloaded from its `Activity page <http://activities.sugarlabs.org/en-US/sugar/addon/4043>`_
ht: Si pou kèk rezon Tèminal se pa sa enstale, li ka telechaje soti nan `paj aktivite li yo <http: // aktivite. sugarlabs. org / en-US / sik / addon / 4043> `_

source: Using
ht: Lè l sèvi avèk

source: Type commands with options that modify their effects and arguments, usually file names or other indications of where to get input and where to put output.
ht: Kalite kòmande ak opsyon ki modifye efè yo ak agiman, anjeneral, depoze non oswa lòt indications nan ki kote yo jwenn opinyon ak ki kote yo mete pwodiksyon.

source: Examples: **pwd** and **ls**, as shown above
ht: Egzanp: ** ** PWD ak ls ** **, jan yo montre pi wo a

source: Chain programs together, so that the following program processes the output of the earlier program.
ht: Pwogram Chain ansanm, se konsa ke pwogram nan sa ki annapre pwosesis pwodiksyon an nan pwogram nan pi bonè.

source: Get a listing of the current directory, but show only lines where the file or directory name includes the text "Sugar". The **|** symbol, read pipe, represents the data link between the programs.
ht: Jwenn yon lis nan anyè aktyèl la, men montre liy sèlman kote dosye oswa anyè non an gen ladan tèks la "Sugar". ** | ** Nan senbòl, li tiyo, reprezante lyen ki done ant pwogram yo.

source: Get information on programs. For example, many commands respond to the **-h** or **--help** options with a concise summary.
ht: Jwenn enfòmasyon sou pwogram. Pou egzanp, anpil kòmandman reponn a ** - h ** oswa ** - nan èd ** opsyon ak yon rezime brèf.

source: The **man** and **info** utilities are unfortunately not available on XOs, but will undoubtedly be included in Sugar whenever the XO of that time is capacious enough for all of the manual and information pages in all of the supported languages.
ht: ** Nonm ** la ak ** info ** sèvis piblik yo malerezman pa disponib sou XO, men yo pral san dout dwe enkli nan Sugar chak fwa XO a nan tan sa a se capacious ase pou tout moun nan manyèl ak enfòmasyon paj sa yo nan tout nan lang yo sipòte.

source: The Toolbar
ht: Toolbar la

source: Activity: Name this session and add a description to Journal
ht: Aktivite: Non sesyon sa a epi ajoute yon deskripsyon Journal

source: Edit (scissors icon): Copy and Paste
ht: Edit (sizo icon): Copy and Paste

source: View (eye icon): Increase or Decrease font size, view in full screen
ht: View (je icon): ogmante oswa diminye font size, wè nan ekran plen

source: Help: Display useful commands
ht: Èd: Montre kòmandman itil

source: Stop: Close terminal activity
ht: One Stop: Fèmen aktivite tèminal

source: Tabs: Open and close tabs
ht: Tabs: Louvri epi fèmen onglè

source: Learning with Terminal
ht: Aprann ak Tèminal

source: Terminal is essential to learning advanced Linux functions, such as system administration, compiling software, and many other such topics.
ht: Tèminal se esansyèl nan aprann avanse Linux fonksyon, tankou administrasyon sistèm, konpile lojisyèl, ak anpil lòt sijè sa yo.

source: Extending Terminal
ht: Tèminal Pwolonje

source: Users have the option of installing text-mode software that works in a terminal window. Examples include text editors such as pico, or file managers such as Midnight Commander. MC simplifies many command line activities for the user, providing equivalents to many command in menus and text windows. To install mc, enter
ht: Itilizatè yo gen chwa pou enstale lojisyèl tèks-mòd ki travay nan yon fenèt tèminal. Egzanp yo gen ladan editè tèks tankou Pico, oswa administratè dosye tankou minwi Kòmandan. MC senplifye anpil aktivite liy lòd pou itilizatè a, bay ekivalan nan anpil lòd nan meni ak fenèt tèks. Enstale mc, antre nan

source: This invokes the Yellow Dog Update Manager to install the Red Hat/Fedora package for mc, including the program, documentation, and other files. Then the user can type mc at the command line and get a two-panel display of files in the same or different directories, together with function buttons and menus for creating and deleting directories, moving or copying files, viewing or editing files, changing file permissions, and much more.
ht: Sa a susit Manadjè a Jòn chen Mizajou enstale pake a Wouj Hat / Fedora pou mc, ki gen ladan pwogram nan, dokiman, ak lòt dosye. Lè sa a, itilizatè a ka tape mc nan liy lan lòd epi pou yo jwenn yon ekspozisyon de-panèl nan dosye nan repèrtwar yo menm oswa diferan, ansanm ak bouton fonksyon ak meni pou kreye ak efase repèrtwar, k ap deplase oswa kopye dosye, gade oswa koreksyon dosye, chanje dosye autorisations, ak plis ankò.

source: See the FLOSS Manuals manuals
ht: Wè manyèl yo itilize fil dantè Manuals

source: `Terminal <http://en.flossmanuals.net/terminal/>`_ about the Sugar Terminal activity
ht: `Tèminal <http: // en. flossmanuals. net / tèminal /> `_ sou aktivite a Tèminal Sugar

source: `Introduction to the Command Line <http://en.flossmanuals.net/command-line/>`_ for a user's tutorial on command line functions
ht: `Entwodiksyon nan Kòmandman Liy la <http: // en. flossmanuals. net / lòd-liy /> `_ pou leson patikilye yon itilizatè a sou liy lòd fonksyon
