Repository: tony37/sledhelp
Catalog: translated_po/ht/troubleshooting_connectivity.po
Languages: ht

source: Troubleshooting Connectivity
ht: Depanaj Koneksyon

source: You can look at http://wiki.laptop.org/go/Support_FAQ for many technical troubleshooting tips, but you should read through all the information on this page to troubleshoot the wireless connectivity yourself. Understanding wireless router configuration
ht: Ou ka gade nan http: // wiki. laptop. org / ale / Support_FAQ pou anpil konsèy depanaj teknik, men ou ta dwe li nan tout enfòmasyon ki sou paj sa a yo rézoudr koneksyon a san fil tèt ou. Konprann konfigirasyon routeur fil

source: Connect your router to any computer, and then use a web browser to view the router's configuration page and change the router's settings.
ht: Konekte routeur ou a nenpòt òdinatè, ak Lè sa a, sèvi ak yon navigatè entènèt yo wè paj konfigirasyon routeur la ak chanje anviwònman routeur la.

source: Here are some common router manufacturer's administrative addresses, usernames, and passwords used for configuring router information. To find a more complete list, you may try visiting another computer that has an internet connection (for example, the local library) and searching the Internet for router default logins. Router
ht: Isit la yo se administratif adrès, usernames, ak modpas kèk komen manifakti routeur la itilize pou konfigirasyon enfòmasyon routeur. Pou jwenn yon lis pi konplè, ou ka eseye vizite yon lòt òdinatè ki gen yon koneksyon entènèt (pou egzanp, bibliyotèk lokal la) ak chache entènèt la pou routeur koneksyon default. Routeur

source: Manufacturer
ht: Fabricant

source: Address
ht: Adrès

source: Username
ht: Non itilizatè

source: Password
ht: Modpas

source: 3 Com
ht: 3 Avèk

source: Broadband
ht: Bande

source: Netgear
ht: Linksys

source: password
ht: modpas

source: If you are unable to connect a computer to your router to do this, call your Internet Service Provider and ask them for assistance. They should be able to access your router remotely, get the needed information for you, and even make any needed changes.
ht: Si ou se kapab konekte yon òdinatè nan routeur ou a fè sa a, rele Founisè Sèvis Entènèt ou epi mande yo pou asistans. Yo ta dwe kapab jwenn aksè nan routeur ou adistans, jwenn enfòmasyon ki nesesè pou ou, e menm fè nenpòt ki chanjman ki nesesè.

source: Your wireless router settings may contain Wired Equivalent Privacy (WEP) or Wi-Fi Protected Access (WPA) for security protection. Find out which type of security it uses and the passphrase either by asking your ISP or by using the router's configuration pages.
ht: Anviwònman routeur fil ou a ka gen ladan Branche Ekivalan Privacy (WEP) oswa Wi-Fi Pwoteje Aksè (WPA) pou pwoteksyon sekirite. Chache konnen ki di ki kalite sekirite li itilize ak pasfraz a swa pa mande ISP ou a oswa lè l sèvi avèk paj sa konfigirasyon routeur la.

source: Based on the type of security system being used (WPA or WEP), the Wireless Key type varies. For WPA, you use a Passphrase key (for example, "password", "tHisisAp4ssword"). For WEP, use either a Hex key (for example, "4f4c504321", usually all keys that consist of only of 0-9 and a-f) or its corresponding ASCII key ("OLPC!"). 40-bit Hex keys are 10 letters/numbers long, corresponding to 5 letter/number ASCII keys.
ht: Baze sou ki kalite sistèm sekirite ki te itilize (WPA oswa WEP), kalite a Wireless kle varye. Pou WPA, ou sèvi ak yon kle pasfraz (pou egzanp, "modpas", "tHisisAp4ssword"). Pou WEP, itilize swa yon kle Egzagòn (pou egzanp, "4f4c504321", anjeneral tout kle ki konpoze de sèlman nan 0-9 ak de) oswa kle li yo ASCII korespondan ("OLPC!"). Kle Egzagòn 40-ti jan yo se 10 lèt / nimewo long, ki koresponn a 5 lèt / nimewo kle ASCII.

source: Common connectivity problems and solutions
ht: Pwoblèm koneksyon Komen ak solisyon

source: Inability to connect with an Access Point from the Neighborhood View is the most commonly reported symptom. The symptom is usually a flashing circle icon where the access point circle icon never appears in the Frame or the circle's menu never contains "Connected." This flashing animation indicates the XO is trying to connect, but the lack of connection indicators tells you that it fails to connect. If this happens, try the troubleshooting suggestions just below. Is the wifi hotspot dot visible in the Neighborhood View?
ht: Enkapasite yo konekte ak yon pwen aksè nan Katye View la se sentòm ki pi souvan rapòte. Sentòm ki se nòmalman yon icon sèk ekla kote aksè pwen icon a sèk pa janm parèt nan ankadreman an oswa meni sèk la a pa janm gen "Konekte. "Animasyon flache Sa a endike XO a ap eseye konekte, men mank nan endikatè koneksyon di ou ke li echwe konekte. Si sa rive, eseye sijesyon yo depanaj jis anba a. Èske wifi otspo dot la vizib nan Katye View la?

source: Go to the Neighborhood View and type the name of your SSID in the Seach box to highlight your access point. Each circle network icon represents a Service Set Identifier (SSID). On one of the icons in the Neighborhood View, you should see your Wi-Fi hotspot's network name.
ht: Ale nan View nan Katye ak kalite non an nan ssid ou nan ti bwat la Seach nan mete aksan sou pwen aksè ou. Chak icon rezo sèk reprezante yon Lapòs Set Idantifikatè (ssid). Sou youn nan ikon yo nan gade nan Katye, ou ta dwe wè non otspo Wi-Fi ou a rezo.

source: If you cannot see the network name there may be a few reasons for this, so continue troubleshooting.
ht: Si ou pa ka wè non an rezo ka gen yon rezon ki fè kèk pou sa a, se konsa kontinye depanaj.

source: Is the name of the network a hidden SSID?
ht: Se non an nan rezo a yon ssid kache?

source: If your SSID/Network Name is set to be Hidden in the router configuration, it is not possible for the XO to connect to your wireless network through the Sugar User Interface.
ht: Si ssid ou / Rezo Non se mete yo dwe kache nan configuration la, te routeur, li pa posib pou XO a pou konekte avèk rezo san fil ou nan koòdone itilizatè la Sugar.

source: You may connect manually by typing commands in the Terminal Activity. To do so, launch the Terminal Activity and type these commands:
ht: Ou ka konekte manyèlman pa sezisman kòmandman nan Aktivite nan Tèminal. Pou fè sa, lanse aktivite nan Tèminal ak kalite kòmandman sa yo:

source: As an explanation, the su command creates a root process. The iwconfig command connects to your hidden network (of course, substitute the name of your access point for the string myhiddennetwork in the above example). Finally, dhclient asks for an IP address from the access point.
ht: Kòm yon eksplikasyon, su yo lòd, ki kreye yon pwosesis rasin. Lòd la iwconfig konekte nan rezo kache ou a (nan kou, ranplase non an nan pwen aksè ou pou myhiddennetwork la fisèl nan egzanp lan pi wo a). Finalman, dhclient mande pou yon adrès IP soti nan pwen an aksè.

source: Is your Wi-Fi router filtering connections based on a MAC Address?
ht: Èske Wi-Fi koneksyon routeur filtraj ou ki baze sou yon MAC adrès?

source: You can prevent other computers from using your wireless router by configuring it to filter by MAC Address. A MAC Address is a unique address embedded in your computer's network adapter. While MAC address filtering is not a secure method of protecting a network, some routers use it, and it could prevent your XO from using that access point.
ht: Ou ka anpeche lòt òdinatè soti nan lè l sèvi avèk routeur fil ou pa konfigirasyon li yo filtre pa MAC Adrès. Yon adrès MAC se yon adrès inik entegre nan rezo adaptè òdinatè w lan an. Pandan ke MAC adrès filtraj se pa yon metòd sekirite pou pwoteje yon rezo, kèk routeurs sèvi ak li, ak li te kapab anpeche ou soti nan lè l sèvi avèk XO ki pwen aksè.

source: To fix a filtering problem, you can find the MAC Address and add it to the list of allowed computers that can connect with the wireless router.
ht: Pou repare yon pwoblèm filtraj, ou ka jwenn adrès la MAC epi ajoute li sou lis la nan pèmèt òdinatè ki kapab konekte ak routeur la san fil.

source: To do so, launch the Terminal Activity and type these commands:
ht: Pou fè sa, lanse aktivite nan Tèminal ak kalite kòmandman sa yo:

source: The MAC address is in the first line next to the HWAddr tag: and is in the form of "00:17:C4:XX:XX:XX"
ht: Adrès postal la MAC se nan liy nan premye akote tag nan HWAddr: epi li se nan fòm lan nan "00: 17: C4: XX: XX: XX"

source: In the WiFi router configuration for filtering, add the MAC Address you found with the ifconfig command.
ht: Nan configuration la, te fil routeur pou filtraj, ajoute MAC la adrese nou jwenn ak yo lòd, ki ifconfig.

source: Is your WiFi router configured to support 802.11b or 802.11g or both?
ht: Èske routeur fil ou configuré sipòte 802. 11b oswa 802. 11g oswa toude?

source: Read the documentation for your wireless router to determine how to configure it for 802.11g support, or to determine if it is using the 802.11g protocol. In this example, the Mode drop-down list is where you would look for protocol settings. It may not work to have both g and b modes as shown, so try different configurations to see if another configuration works.
ht: Li dokiman an pou routeur fil ou a detèmine ki jan yo configured li pou 802. Sipò 11g, oswa yo detèmine si li se lè l sèvi avèk 802 la. Pwotokòl 11g. Nan egzanp sa a, Mode lis la gout-desann a se kote ou ta gade pou anviwònman pwotokòl. Li pa kapab travay gen tou de g ak b mòd menm jan yo montre, se konsa eseye konfigirasyon diferan yo wè si yon lòt travay konfigirasyon.

source: Are the access point settings not in channels 1, 6, or 11?
ht: Èske anviwònman yo pwen aksè pa nan chanèl 1, 6, oswa 11?

source: Is your access point working on another channel that is not in 1, 6, or 11? For some older builds, the XO expects to find access points in one of these three channels, the three non-interfering channels available to 802.11g wireless protocol.
ht: Se pwen aksè ou ap travay sou yon lòt kanal ki pa nan 1, 6, oswa 11? Pou kèk ki pi gran ap bati, XO a espere jwenn pwen aksè nan youn nan twa sa yo chanèl, twa chanèl yo ki pa Peye-entèfere disponib nan 802. 11g san fil pwotokòl.

source: Try changing your access point to one of the three channels and check if you can associate your XO to it. Refer to your access point's documentation for information on changing the frequency channel that your access point broadcasts on. This image shows an example of the settings for a wireless router. The Channel field is where you change the frequency setting.
ht: Eseye chanje pwen aksè ou a youn nan twa chanèl yo epi tcheke si ou ka asosye XO ou a li. Gade nan dokiman pwen aksè ou a pou enfòmasyon sou chanje kanal la frekans ki pwen aksè ou emisyon sou. Imaj sa a montre yon egzanp nan anviwònman yo pou yon routeur fil. Jaden an Chèn se kote ou chanje anviwònman an frekans.

source: Why can't the XO Browse when connected?
ht: Poukisa nou pa ka XO Browse nan lè ki konekte?

source: Symptom: Your XO shows that your Internet connection is working, but you cannot browse or search any pages.
ht: Senptòm: XO ou montre ke koneksyon entènèt ou ap travay, men ou pa ka browse oswa rechèch nenpòt paj.

source: Most likely, the XO has failed to receive DNS information from your internet access point. If this is the case, you would be able to access the Internet for sites named directly with IP addresses but not their common names. In other words, http://209.85.133.18 would work but http://www.google.com would not.
ht: Gen plis chans, li te XO a echwe pou pou resevwa enfòmasyon dns soti nan pwen aksè entènèt ou. Si sa a se ka a, ou ta dwe kapab jwenn aksè nan entènèt la pou sit yo te rele dirèkteman ak adrès IP, men se pa non komen yo. Nan lòt mo, http: // 209. 85. 133. 18 ta travay men http: // www. Google. com pa t 'vle.

source: Verify what the XO has received (from the Internet access point) for DNS information by using the Browse Activity and looking at this URL:
ht: Verify sa XO a te resevwa (ki soti nan pwen an aksè nan Entènèt) pou enfòmasyon dns lè l sèvi avèk Browse aktivite a ak gade nan URL sa a:

source: file://localhost/etc/resolv.conf
ht: dosye: // localhost / eksetera / resolv. konf

source: This page should show the IP address of the DNS server assigned by the Internet access point. If there isn't an IP address on this page, or if the IP address assigned is wrong, this would account for the behavior you're seeing.
ht: Paj sa a ta dwe montre adrès la IP nan sèvè a dns plase nan pwen an aksè nan Entènèt. Si pa gen yon adrès IP nan paj sa a, oswa si adrès la IP asiyen ki mal, sa a ta kont pou konpòtman an w ap wè.

source: If there is no IP address, or the address is wrong, you'll need to determine why the Internet access point is failing to supply one, but this is likely to be misconfiguration of the access point.
ht: Si pa gen okenn adrès IP, oswa adrès la se sa ki mal, ou pral bezwen detèmine poukisa pwen an aksè nan Entènèt se li pap resevwa yo bay yon sèl, men sa a se chans yo dwe movèz pwen an aksè.

source: Connecting to the Internet without wireless access
ht: Konekte sou entènèt la san yo pa aksè san fil

source: If you cannot successfully or consistently connect to the Internet using Wi-Fi, you can use a USB-to-Ethernet connector to hook up to a wired connection rather than wireless. Examples of products that have worked for other users include the Linksys USB100M and the Zoltan Tech USB2.0 Fast Ethernet adapter, which cost about USD $10-$25.
ht: Si ou pa kapab avèk siksè oswa toujou konekte sou entènèt la lè l sèvi avèk Wi-Fi, ou ka itilize yon Connector USB-a-Ethernet akwoche yon koneksyon branche olye ke san fil. Men kèk egzanp sou pwodwi sa yo ki te te travay pou itilizatè lòt gen ladan USB100M la Linksys ak USB2 nan Zoltán Tech. 0 Vit Ethernet adaptè, ki koute sou USD $ 10- $ 25.

source: If you want to connect to your XO wirelessly with a dial-up connection, you can do it with an older version of Apple's Airport Extreme (A1034). Apple no longer sells them, but they are available on the Internet for between $18 and $36. Be sure the one you get has a port for the phone line, and preferably, with a phone cord included. Directions for connecting with it are on the Wiki at http://wiki.laptop.org/go/Wifi_Connectivity#Apple_Airport. Connecting while traveling
ht: Si ou vle pou konekte avèk XO ou wirelessly ak yon koneksyon dial pou leve, ou ka fè l 'ak yon ansyen vèsyon Ayewopò ekstrèm Apple la (A1034). Apple pa gen okenn ankò vann yo, men yo ki disponib sou entènèt la pou ant $ 18 ak $ 36. Asire w ke yon sèl la ou jwenn gen yon pò pou liy telefòn nan, ak de preferans, ak yon kòd telefòn enkli. Esplikasyon pou konekte ak li yo sou Wiki a nan http: // wiki. laptop. org / ale / Wifi_Connectivity # Apple_Airport. Koneksyon pandan y ap vwayaje

source: Your XO makes a wonderful traveling companion. You can connect to a wide variety of public WiFi sites often found in community centers and libraries, even in restaurants and hotels. All you will need to do is to obtain a correct password and log on according to the instructions above. Many places will not require a password to connect and the process will be even easier. Remember, however, that passwords provide an extra layer of internet security. Without them, you run a slightly higher risk of experiencing some type of Internet fraud.
ht: XO ou fè yon konpayon vwayaje bèl bagay. Ou ka konekte nan yon gran varyete nan sit fil piblik souvan jwenn nan sant kominotè ak bibliyotèk, menm nan restoran ak otèl. Tout sa ou ap bezwen fè se jwenn yon modpas kòrèk epi yo ale sou selon enstriksyon ki anwo. Anpil kote pa yo pral mande pou yon modpas yo konekte ak pwosesis la pral menm vin pi fasil. Sonje, sepandan, ke modpas bay yon kouch siplemantè nan sekirite entènèt. San yo pa yo, ou kouri nan yon ti kras pi wo risk pou yo fè eksperyans kèk kalite fwod sou Entènèt.
