Repository: tony37/sledhelp
Catalog: translated_po/ht/turtleart.po
Languages: ht

source: About
ht: Sou

source: Turtle Art, also known as Turtle Blocks, is an activity with a Logo-inspired graphical "turtle" that draws colorful art based on snap-together visual programming elements. Its "low floor" provides an easy entry point for beginners. It also has "high ceiling" programming, graphics, mathematics, and Computer Science features which will challenge the more adventurous student.
ht: Turtle Art, konnen tou kòm Turtle blòk, se yon aktivite ak yon Logo-enspire grafik "tòti" ki trase atizay kolore ki baze sou ki enfichable-ansanm eleman pwogram vizyèl. Li yo "etaj faible" bay yon pwen antre fasil pou débutan. Li tou te gen "segondè plafon" pwogram, grafik, matematik ak Syans enfòmatik karakteristik ki pral defi elèv la plis avantur.

source: Where to get Turtle Art
ht: Ki kote yo ka resevwa Turtle Art

source: Is included in the OLPC image, and can be downloaded from the `Sugarlabs Activities repository <http://activities.sugarlabs.org/en-US/sugar/addon/4027>`_
ht: Se enkli nan imaj la OLPC, epi yo ka telechaje soti nan `Sugarlabs Aktivite depo a <http: // aktivite. sugarlabs. org / en-US / sik / addon / 4027> `_

source: There are two inter-compatible programs: Turtle Art and Turtle Blocks. Turtle Art, which closely parallels the Java version of Turtle Art maintained by Brian Silverman, offers a small subset of the functionality of Turtle Blocks. Turtle Blocks is the version included in the Sugar distribution. Sugar users probably want to use Turtle Blocks rather than Turtle Art. (Also see Turtle Confusion, a collection of programming challenges designed by Barry Newell.)
ht: Gen de pwogram entè-konpatib: Turtle Art, ak Turtle blòk. Turtle Art, ki byen paralèl vèsyon an Java nan Turtle Art konsève pa Brian Silverman, ofri yon ti gwoup ki sot nan fonksyonalite a nan Turtle blòk. Turtle blòk se vèsyon an enkli nan distribisyon an Sugar. Itilizatè Sugar pwobableman vle sèvi ak Turtle blòk olye ke Turtle Art. (Epitou gade Turtle Konfizyon, yon koleksyon nan defi pwogram ki fèt nan Barry Newell. )

source: Using Turtle Art
ht: Lè l sèvi avèk Turtle Art

source: Start by clicking on (or dragging) blocks from the Turtle palette. Use multiple blocks to create drawings; as the turtle moves under your control, colorful lines are drawn.
ht: Kòmanse pa klike sou (oswa trenen) blòk soti nan palèt a Turtle. Sèvi ak blòk miltip yo kreye desen; kòm tòti mouvman yo anba kontwòl ou, liy kolore yo trase.

source: You add blocks to your program by clicking on or dragging them from the palette to the main area. You can delete a block by dragging it back onto the palette. Click anywhere on a "stack" of blocks to start executing that stack or by clicking in the Rabbit (fast) , Turtle (slow) or Bug (debug) buttons |rabit-turtle| on the Project Toolbar.
ht: Ou ajoute blòk nan pwogram ou pa klike sou oswa antrenman yo soti nan palèt a nan zòn nan prensipal. Ou ka efase yon blòk pa trenen l 'tounen sou palèt a. Klike sou nenpòt kote sou yon "chemine" nan blòk yo kòmanse egzekite ki chemine oswa pa klike nan lapen nan (vit), Turtle (ralanti) oswa Bug bouton (debug) | rabit-tòti | sou ba zouti a Pwojè.

source: From left to right:
ht: De gòch a dwat:

source: Activity toolbar (includes sharing; saving/loading options);
ht: Toolbar (aktivite an gen ladan pataje; opsyon ekonomize / loading);

source: Edit toolbar (including copy and paste);
ht: Toolbar Edit (ki gen ladan kopi ak keratin);

source: View toolbar (including full-screen, coordinate overlays; turtle status, etc.);
ht: View toolbar (ki gen ladan plen ekran, kowòdone superpositions; estati tòti, elatriye. );

source: Palette toolbar (including all programming blocks);
ht: Toolbar palèt (ki gen ladan tout blòk pwogramasyon);

source: erase canvas;
ht: efase twal;

source: run project fast (rabbit);
ht: pwojè kouri vit (lapen);

source: run project slow (snail);
ht: pwojè kouri ralanti (kalmason);

source: stop project;
ht: sispann pwojè;

source: save a snapshot (save a copy of the current state of the project);
ht: sove yon snapshot (sove yon kopi aktyèl eta de pwojè a);

source: load examples;
ht: egzanp chaj;

source: display help palette;
ht: ekspozisyon èd palèt;

source: stop activity
ht: aktivite sispann

source: Keyboard short cuts for the above: Alt+ palette; blocks; run; walk; stop; erase; e.g., Alt+e will erase the screen. Esc will return from full-screen mode.
ht: Klavye koupe kout pou pi wo a: Alt + palèt a; blòk; kouri; mache; sispann; efase; e. g. , Alt + e pral efase ekran an. Kompitè ap retounen soti nan plen ekran mòd.

source: **Notes:** The run buttons are tied to the Start Block. If no Start Block is used, then all blocks are run when either run button is clicked. The "rabbit" button runs the blocks at maximum speed. The "snail" button pauses and displays the turtle and block values between each step.
ht: ** Nòt: ** Bouton sa yo kouri yo se mare nan blòk an Start. Si yo itilize pa gen okenn blòk Start, Lè sa a, tout blòk yo kouri lè se swa bouton kouri klike. Bouton an "lapen" kouri blòk yo nan vitès maksimòm. "Kalmason" poz yo bouton epi montre tòti ak blòk valè yo ant chak etap.

source: On older versions of Sugar (e.g., 0.84), the main toolbar will look like this:
ht: Nan vèsyon ki pi ansyen nan Sugar (e. g. , 0. 84), ba ikòn nan prensipal pral gade tankou sa a:

source: Project Toolbar
ht: Pwojè Toolbar

source: Project title;
ht: Tit Pwojè;

source: Write to Journal (on newer versions of Sugar)
ht: Ekri Journal (sou plus vèsyon an Sugar)

source: Keep button (not shown; only appears on older Sugar systems)
ht: Kenbe bouton (pa montre; sèlman parèt sou ki pi gran sistèm Sugar)

source: Share button;
ht: Bouton Share;

source: Share blocks; shown in disable state. Used to share stacks of blocks between collaborators.
ht: Share blòk; montre nan eta enfim. Itilize yo pataje pil nan blòk ant kolaboratè.

source: Save as image;
ht: Save kòm imaj;

source: Save as Logo;
ht: Save kòm Logo;

source: Load a previously saved project from the Sugar Journal;
ht: Chaj yon pwojè deja sove soti nan Sugar Journal a;

source: Load Python code into a programmable block
ht: Chaj Piton Kòd nan yon blòk pwogramasyon

source: **Notes:**
ht: ** Nòt: **

source: On older Sugar systems, these controls appear on the Import/Export toolbar.
ht: Nan ki pi gran sistèm Sugar, kontwòl sa yo parèt sou Import / ba zouti a Export.

source: On smaller screens, the load/save buttons are shown on a palette.
ht: Nan pi piti ekran, chaj la / sove yo montre bouton sou yon palèt.

source: To share a stack, click on the share button. The cursor will change to the hand shape Ta-hand-cursor.png. Place the cursor on any block or stack of blocks and click. The blocks will be shared and the cursor will change back to the arrow shape.
ht: Yo pataje yon pil, klike sou bouton an pataje. Kurseur a ap chanje nan fòm men Ta-men-kurseur a. png. Mete kurseur a sou nenpòt ki blòk oswa chemine nan blòk, epi klike. Blòk yo pral pataje ak kurseur a pral chanje tounen nan fòm nan flèch.

source: The Edit toolbar is used to copy stacks of blocks to the clipboard and to paste stacks from the clipboard. To copy a stack, click on the copy button or type Ctrl-c. The cursor will change to the hand shape Ta-hand-cursor.png. Place the cursor on any block or stack of blocks and click. The blocks will be copied to the Sugar clipboard and the cursor will change back to the arrow shape. To paste from the clipboard, type Ctrl-v or click the paste button.
ht: Se ba ikòn nan Edit itilize a kapab bay kopi pil nan blòk nan papye a ak kole pil soti nan papye a. A kapab bay kopi yon pil, klike sou bouton an kopi oswa tape Ctrl-c. Kurseur a ap chanje nan fòm men Ta-men-kurseur a. png. Mete kurseur a sou nenpòt ki blòk oswa chemine nan blòk, epi klike. Blòk yo pral kopye nan clipboard a Sugar ak kurseur a pral chanje tounen nan fòm nan flèch. Kole soti nan papye a, tape Ctrl-v oswa klike sou bouton an paste.

source: Copy
ht: Kopi

source: Paste
ht: Kole

source: Full-screen button;
ht: Bouton Plen ekran;

source: Cartesian-coordinate grid;
ht: Katezyen-kowòdone griy;

source: polar-coordinate grid;
ht: polè-kowòdone griy;

source: not shown: centimeter-coordinate grid (XO-only);
ht: pa montre: santimèt-kowòdone kadriyaj (XO-sèlman);

source: display of x,y coordinates, heading of turtle;
ht: ekspozisyon nan x, y kowòdone, tit nan tòti;

source: Rescale-coordinates button;
ht: Rescale-kowòdone bouton;

source: Grow block size;
ht: Grandi gwosè blòk;

source: Shrink block size
ht: Ratresi gwosè blòk

source: Disable/enable hover help
ht: Enfim / pèmèt hover èd

source: Palettes Toolbar
ht: Palèt Toolbar

source: The palette menus are revealed by clicking on the Block icon on the main toolbar. (On older Sugar systems, select the Projects toolbar. When running Turtle Art from GNOME, the palettes are visible by default.)
ht: Meni yo palèt yo devwale pa klike sou icon nan blòk sou ba zouti a prensipal. (Nan ki pi gran sistèm Sugar, chwazi ba ikòn nan Pwojè. Lè kouri soti nan Turtle Art GNOME, palèt yo yo vizib pa default. )

source: There are ten palettes of program elements available for program construction: Turtle movements; Pen attributes; Color attributes; Numeric operators; Logical operators; Logical blocks; Sensor blocks; Media blocks; Customization functions; and Presentation blocks. An eleventh palette is used for restoring blocks from the trash.
ht: Gen dis palèt nan eleman pwogram ki disponib pou konstriksyon pwogram: mouvman Turtle; Pen atribi figi; Koulè atribi figi; Operatè nimerik; Operatè lojik; Blòk lojik; Blòk Sensor; Blòk Media; Fonksyon pèrsonalizasyon; ak Prezantasyon blòk. Yon palèt onzyèm itilize pou restore blòk soti nan fatra a.

source: **Note:** Additional palettes may be loaded by plugin extensions to Turtle Blocks.
ht: ** Remak: ** palèt Lòt ka chaje pa ekstansyon Plugin Turtle blòk.

source: Blocks are dragged from the palette onto the canvas surface. To dispose of a block, drag it back onto the palette. (It will be placed onto the trash palette.)
ht: Blòk yo trennen soti nan palèt a sou sifas la twal. Jete tout fatra ki yon blòk, trennen l 'tounen sou palèt a. (Li pral mete sou palèt an fatra. )

source: The |Showblocks| button, which replaces the Stop button on the main toolbar while the program is executing, is used to reveal the program blocks. Individual palettes can be hidden by clicking on their highlighted tab.
ht: Showblocks | | bouton an, ki ranplase bouton an Stop sou ba zouti a prensipal pandan y ap pwogram nan ap egzekite, se sèvi ak blòk yo revele pwogram. Palèt Endividyèl kapab kache pa klike sou tab make yo.

source: Turtle Palette
ht: Turtle Palèt

source: These blocks are used to control the movements of the turtle.
ht: Sa yo blòk yo yo te itilize kontwole mouvman yo ki nan tòti a.

source: forward: move turtle forward
ht: pou pi devan: deplase tòti pou pi devan

source: back: move turtle backward
ht: tounen: deplase tòti bak

source: clean: clear the screen and position the turtle in the center of the screen, pen down, color red, heading 0
ht: pwòp: klè ekran an ak pozisyon tòti a nan sant la nan ekran an, plim desann, koulè wouj, tit 0

source: left: rotate turtle counterclockwise
ht: gòch: Thorne envers tòti

source: right: rotate turtle clockwise
ht: dwat: Thorne goch tòti

source: arc: move turtle along an arc
ht: arc: deplase tòti ansanm yon ak

source: set xy: set turtle x,y position (0,0) is the center of the screen
ht: mete xy: mete tòti x, y pozisyon (0,0) se sant la nan ekran an

source: seth: set turtle heading
ht: Sèt: seri tòti tit

source: xcor: holds current x-coordinate value of the turtle (can be used in place of a number block)
ht: xcor: kenbe aktyèl valè x-kowòdone nan tòti a (ka itilize nan plas yon blòk nimewo)

source: ycor: holds current y-coordinate value of the turtle (can be used in place of a number block)
ht: ycor: kenbe aktyèl valè y-kowòdone nan tòti a (ka itilize nan plas yon blòk nimewo)

source: heading: holds current heading value of the turtle (can be used in place of a number block)
ht: tit: kenbe aktyèl tit valè de tòti la (ka itilize nan plas yon blòk nimewo)

source: Pen Palette
ht: Pen Palèt

source: These blocks are used to control the attributes of the turtle's pen.
ht: Sa yo blòk yo yo te itilize kontwole atribi ki pou plim tòti a.

source: pen up: turtle will not draw when moved
ht: plim moute: tòti pa pral trase lè deplase

source: pen down: turtle will draw when moved
ht: plim desann: tòti pral trase lè deplase

source: set pen size: sets the width of the line drawn by the turtle
ht: seri plim gwosè: kouche lajè a nan liy lan desine pa tòti a

source: fill screen: fill the screen with a color/shade and reposition the turtle in the center of the screen
ht: ranpli ekran: ranpli ekran an ak yon koulè / lonbraj ak replace tòti a nan sant la nan ekran an

source: pen size: width of the line drawn by the turtle (can be used in place of a number block)
ht: plim gwosè: lajè nan jwèt la desine pa tòti a (ka itilize nan plas yon blòk nimewo)

source: set color: sets the pen color
ht: seri koulè: kouche koulè a ​​plim

source: set shade: sets the pen shade
ht: seri lonbraj: kouche lonbraj la plim

source: set gray: sets the gray-level of the pen (Only available in Turtle Blocks)
ht: mete gri: kouche-nivo nan gri nan plim la (Se sèlman disponib nan Turtle blòk)

source: color: current pen color (can be used in place of a number block)
ht: koulè: aktyèl koulè plim (ka itilize nan plas yon blòk nimewo)

source: shade: current pen shade (can be used in place of a number block)
ht: lonbraj: aktyèl lonbraj plim (ka itilize nan plas yon blòk nimewo)

source: gray: current pen gray level (can be used in place of a number block) (Only available in Turtle Blocks)
ht: gri: aktyèl plim nivo gri (ka itilize nan plas yon blòk nimewo) (Se sèlman disponib nan Turtle blòk)

source: start fill: starts a filled polygon (straight sides, not arcs)
ht: kòmanse ranpli: kòmanse yon poligòn ki te ranpli (bò dwat, pa ark)

source: end fill: ends a fill polygon (straight sides, not arcs)
ht: fen ranpli: fini yon poligòn ranpli (bò dwat, pa ark)

source: Color Palette
ht: Koulè palèt

source: These blocks can be used with the set-pen-color block in place of a number block.
ht: Sa yo blòk ka itilize ak blòk la mete-plim-koulè nan plas yon blòk nimewo.

source: Numbers Palette
ht: Numbers Palèt

source: These blocks are arithmetic and boolean operators.
ht: Blòk Sa yo se aritmetik ak Boolean operatè.

source: addition: adds two numeric inputs (also can be used to concatenate strings)
ht: de sa: ajoute de nimerik entrain (tou ka itilize yo anchene strings)

source: subtraction: subtracts the bottom numeric input from the top input
ht: soustraksyon: soustrè anba nimerik D 'a soti nan opinyon nan tèt

source: multiplication: multiplies two numeric inputs
ht: miltiplikasyon: miltipliye de nimerik entrain

source: division: divided top input (numerator) by bottom input (denominator)
ht: divizyon: divize tèt D '(nimeratè) pa opinyon anba (denominatè)

source: identity: identity function (used for spacing blocks)
ht: fonksyon idantite (itilize pou blòk espas): idantite

source: modulo (remainder): calculates remainder when dividing top input by the bottom input
ht: modulo (rès): kalkile rès lè divize tèt D 'pa D' a anba

source: square root (Only available with Turtle Blocks)
ht: rasin kare (Se sèlman disponib ak Turtle blòk)

source: random number: generates a random integer between the minimum and maximum values
ht: nimewo o aza: jenere yon nonb antye relatif o aza ant minimòm nan ak valè maksimòm

source: number block: a numeric input
ht: blòk Nimewo: A nimerik opinyon

source: greater than: boolean greater than operator (used with flow blocks)
ht: pi gran pase: Boolean pi gran pase operatè (itilize ak koule blòk)

source: less than: boolean less than operator (used with flow blocks)
ht: mwens pase: Boolean mwens pase operatè (itilize ak koule blòk)

source: equal to: boolean equal to operator (used with flow blocks)
ht: egal a: Boolean egal a operatè (itilize ak koule blòk)

source: not: boolean not (Only available with Turtle Blocks)
ht: pa: Boolean pa (Se sèlman disponib ak Turtle blòk)

source: and: boolean and (Only available with Turtle Blocks)
ht: epi: Boolean ak (Se sèlman disponib ak Turtle blòk)

source: or: boolean or (Only available with Turtle Blocks)
ht: oswa: Boolean oswa (Se sèlman disponib ak Turtle blòk)

source: Flow Palette
ht: Flow Palèt

source: These blocks control program flow.
ht: Sa yo blòk kontwole koule pwogram.

source: wait: pause program execution (unit is seconds)
ht: tann: pran yon poz ekzekisyon pwogram (inite se segonn)

source: forever: continuously repeat execute stack under the right flow
ht: pou tout tan: kontinyèlman repete egzekite chemine anba koule a dwat

source: repeat: repeat the execution of stack under the right flow a specified number of times
ht: repete: repete ekzekisyon an nan chemine anba dwat a koule yon nimewo ki espesifye nan fwa

source: if/then: conditional execution of the stack under the right flow (uses boolean operators found on the Number palette)
ht: si / lè: kondisyonèl ekzekisyon nan chemine a anba koule a dwa (sèvi ak operatè Boolean jwenn sou palèt a Nimewo)

source: if/then/else: conditional execution of the stack under the center and right flows (uses boolean operators found on the Number palette)
ht: si / lè / lòt bagay: kondisyonèl ekzekisyon nan chemine a anba sant la ak ap koule dwa (sèvi ak operatè Boolean jwenn sou palèt a Nimewo)

source: vertical spacer
ht: spacer vètikal

source: stop stack: interrupt execution
ht: sispann chemine: entèwonp ekzekisyon

source: while: execute stack under right flow while the condition is true (uses boolean operators found on the Number palette) (Only available with Turtle Blocks)
ht: pandan y ap: egzekite chemine anba dwat koule pandan y ap kondisyon an se laverite (sèvi ak operatè Boolean jwenn sou palèt a Nimewo) (Se sèlman disponib ak Turtle blòk)

source: until: execute stack under right flow until the condition is true (uses boolean operators found on the Number palette) (Only available with Turtle Blocks)
ht: jouk: egzekite chemine anba dwat koule jiskaske kondisyon an se laverite (sèvi ak operatè Boolean jwenn sou palèt a Nimewo) (Se sèlman disponib ak Turtle blòk)

source: **Note:** Nesting while and/or until blocks is not always reliable. If you encounter an error, try putting the nested block in a separate stack, accessed with an action block.
ht: ** Remak: ** anbwatman pandan y ap ak / oswa jiskaske blòk se pa toujou serye. Si ou rankontre yon erè, eseye mete blòk la enbrike nan yon chemine ki apa a, jwenn aksè ak yon blòk aksyon.

source: Blocks Palette
ht: Blòk Palèt

source: These blocks are for defining variables and subroutines.
ht: Blòk sa yo se pou defini varyab ak subroutines.

source: start: connects action to toolbar 'Run' button
ht: kòmanse: konekte aksyon nan ba ikòn bouton 'kouri'

source: store in box 1: store a number, string, or media object in box 1 (Only available with Turtle Blocks)
ht: magazen nan ti bwat 1: magazen yon nimewo, fisèl, oswa medya objè nan ti bwat 1 (sèlman ki disponib ak Turtle blòk)

source: store in box 2: store a number, string, or media object in box 2 (Only available with Turtle Blocks)
ht: magazen nan ti bwat 2: magazen yon nimewo, fisèl, oswa medya objè nan ti bwat 2 (Se sèlman disponib ak Turtle blòk)

source: text: string input
ht: tèks: fisèl D '

source: box 1: current value of box 1 (can be used in place of a number block) (Only available with Turtle Blocks)
ht: bwat 1: valè aktyèl la nan bwat 1 (ka itilize nan plas yon blòk nimewo) (Se sèlman disponib ak Turtle blòk)

source: box 2: current value of box 2 (can be used in place of a number block) (Only available with Turtle Blocks)
ht: bwat 2: valè aktyèl la nan bwat 2 (ka itilize nan plas yon blòk nimewo) (Se sèlman disponib ak Turtle blòk)

source: box: current value of named box (can be used in place of a number block)
ht: bwat: valè aktyèl la nan yo te rele bwat (yo ka itilize nan plas yon blòk nimewo)

source: store in: store a number, string, or media object in a named box
ht: magazen an: magazen yon nimewo, fisèl, oswa medya objè nan yon bwat ki te rele

source: action: top of named action stack
ht: aksyon: yo te rele tèt aksyon chemine

source: action 1: top of action 1 stack (Only available with Turtle Blocks)
ht: aksyon 1: tèt nan aksyon 1 chemine (Se sèlman disponib ak Turtle blòk)

source: action 2: top of action 2 stack (Only available with Turtle Blocks)
ht: aksyon 2: tèt nan aksyon 2 chemine (Se sèlman disponib ak Turtle blòk)

source: action: execute named action stack
ht: aksyon: egzekite yo te rele aksyon chemine

source: action 2: execute action 2 stack (Only available with Turtle Blocks)
ht: aksyon 2: egzekite aksyon 2 chemine (Se sèlman disponib ak Turtle blòk)

source: action 1: execute action 1 stack (Only available with Turtle Blocks)
ht: aksyon 1: egzekite aksyon 1 chemine (Se sèlman disponib ak Turtle blòk)

source: **Note:** When a named action or named box block are used, new blocks appear on the palette that correspond to these names; e.g., if a top of action stack is rename, "to square", an action block, "to square" is added to the palette.
ht: ** Remak: ** Lè yo te itilize yon aksyon yo te rele oswa rele bwat blòk, blòk nouvo parèt sou palèt an ki koresponn ak sa yo non; e. g. , Si yon tèt nan aksyon pil se chanje non, "nan kare kare", yon blòk aksyon, "nan kare kare" se ajoute nan palèt a.

source: Sensors Palette
ht: Detektè Palèt

source: query keyboard: check for keyboard input (results are stored in the keyboard block)
ht: query klavye: tcheke pou D 'klavye (rezilta yo estoke nan blòk la klavye)

source: keyboard: current value of keyboard input (can be used in place of a number block)
ht: klavye: valè aktyèl la nan D 'klavye (ka itilize nan plas yon blòk nimewo)

source: read pixel: push the RGB value of the pixel under the turtle onto the FILO (blue is first, red is last)
ht: li pixel: pouse valè a rgb nan pixel a anba tòti la sou Filo a (ble se premye, wouj se dènye)

source: turtle sees: the "palette color" of the pixel under the turtle
ht: tòti wè: "koulè a ​​palèt" nan pixel a anba tòti a

source: time: number of seconds since program began
ht: tan: kantite segonn depi pwogram te kòmanse

source: sound: raw data from microphone ranging -32000 to 32000
ht: son: done anvan tout koreksyon soti nan mikwofòn sòti -32000 32000

source: volume (loudness): ranging 0 to 32000
ht: volim (volim): sòti 0 a 32000

source: pitch: the resolution is +-8Hz
ht: anplasman: rezolisyon an se + -8Hz

source: brightness: average luminance seen through camera
ht: klète: mwayèn luminans wè nan kamera

source: camera: grab image from camera
ht: kamera: gen tan pwan imaj ki soti nan kamera

source: button down: current state of the mouse button (1 == down; 0 == ip)
ht: bouton desann: aktyèl eta de bouton an sourit (1 == desann; 0 IP ==)

source: mouse x: x position of mouse
ht: sourit x: x pozisyon nan sourit

source: mouse y: y position of mouse
ht: sourit y: y pozisyon nan sourit

source: The OLPC XO can measure external inputs with its microphone jack:
ht: OLPC XO a ka mezire entrain ekstèn ak jack mikwofòn li yo:

source: resistance: measurement range is 750 to 14k ohms, (OLPC XO1) and 2k ohms to open circuit (OLPC XO1.5)
ht: rezistans: seri mezi se 750 14k om, (OLPC XO1) ak 2K om yo louvri chan de kous (OLPC XO1. 5)

source: voltage: measurement range is DC 0.4V to 1.85V. (OLPC XO1) and 0.17V to 3.0V (OLPC XO1.5)
ht: vòltaj: seri mezi se DC 0. 4V nan 1. 85V. (OLPC XO1) ak 0. 17V nan 3. 0V (OLPC XO1. 5)

source: The OLPC XO 1.75 also includes an accelerometer.
ht: OLPC XO 1 nan. 75 gen ladan tou yon akseleromètr.
