Repository: tony37/sledhelp
Catalog: translated_po/ht/turtleart.po
Languages: ht

source: accelerate (not shown): measure the acceleration of the computer. Results are pushed to the stack and can be retrieved by using 3 'pop' blocks (one for X (horizontal), one for Y (vertical), and one for Z (forward/backward))
ht: akselere (pa montre): mezire akselerasyon an nan òdinatè a. Rezilta yo pouse chemine a epi yo ka Retrieved lè l sèvi avèk 3 'pòp' blòk (youn pou X (orizontal), yonn pou Y (vètikal), ak yonn pou Z (pou pi devan / bak))

source: See `Using Turtle Art Sensors <http://wiki.sugarlabs.org/go/Activities/Turtle_Art/Using_Turtle_Art_Sensors>`_ for more details about the sensor blocks.
ht: Wè `Sèvi Turtle Art Detektè <http: // wiki. sugarlabs. org / ale / Aktivite / Turtle_Art / Using_Turtle_Art_Sensors> `_ pou plis detay sou blòk yo Capteur.

source: Media Palette
ht: Media Palèt

source: These are a collection of blocks used for displaying media objects, such as images from the Journal.
ht: Sa yo se yon koleksyon nan blòk itilize pou montre medya objè, tankou imaj ki soti nan Journal la.

source: journal: Sugar Journal media object (used with show block) (also available in Turtle Art)
ht: jounal: Sugar Journal medya objè (itilize ak montre blòk) (disponib tou nan Turtle Art)

source: audio: Sugar Journal media object (used with show block)
ht: odyo: Sugar Journal medya objè (itilize ak montre blòk)

source: video: Sugar Journal media object (used with show block)
ht: videyo: Sugar Journal medya objè (itilize ak montre blòk)

source: description: Sugar Journal description field (used with show block)
ht: Deskripsyon: Sugar Journal jaden deskripsyon (itilize ak montre blòk)

source: text: text string (used with show block; also used with box and action blocks)
ht: tèks: fisèl tèks (itilize ak montre blòk; tou itilize ak bwat ak aksyon blòk)

source: show: draw text or display media object from the Journal
ht: montre: trase tèks oswa ekspozisyon medya objè nan Journal la

source: set scale: sets the scale of images displayed with show block
ht: seri echèl: kouche echèl la nan imaj parèt ak montre blòk

source: save picture: save the canvas to the Sugar Journal as a .png image (note: saves the canvas as displayed)
ht: sove foto: sove twal la Sugar Journal a kòm yon. png imaj (nòt: sove twal la kòm parèt)

source: save SVG: save turtle graphics to the Sugar Journal as a .svg image (note: only saves the changes to the canvas in the current execution run)
ht: sove SVG: sove tòti grafik Sugar Journal a kòm yon. imaj SVG (sonje: sèlman ekonomis chanjman yo nan twal la nan ekzekisyon aktyèl kouri nan)

source: scale: sets scale for show block (100% is full-screen)
ht: echèl: kouche echèl pou montre blòk (100% se plen ekran-)

source: wait for media: used to pause program while audio or video file plays
ht: rete tann pou medya: itilize yo pran yon poz pwogram pandan y ap odyo oswa videyo jwe dosye

source: media stop: stop current sound or video
ht: medya sispann: sispann son aktyèl oswa videyo

source: media pause: pause current sound or video
ht: medya pran yon poz: pran yon poz son aktyèl oswa videyo

source: media resume: resume playing paused media
ht: medya rezime: rezime jwe medya Sarepta

source: speak: sends text to the voice synthesizer
ht: pale: voye tèks nan synthesizer la vwa

source: sine wave: plays a sine wave of a given frequency, amplitude, and duration
ht: sinis onn: jwe yon vag sinis nan yon frekans, anplitid, ak dire bay

source: Extras Palette
ht: Extras Palèt

source: These are a collection of extra blocks for accessing advanced features only available in Turtle Blocks.
ht: Sa yo se yon koleksyon nan blòk anplis pou aksè karakteristik avanse sèlman ki disponib nan Turtle blòk.

source: push: push value onto FILO (first-in last-out) heap
ht: pouse: valè pouse sou Filo (premye-nan dènye-soti) pil wòch

source: show heap: show FILO in status block
ht: montre pil wòch: montre Filo nan blòk estati

source: empty heap: empty the FILO
ht: pil wòch vid: vide Filo a

source: pop: pop value off of the FILO (can be used in place of a number block)
ht: valè pòp koupe nan Filo a (yo ka itilize nan plas yon blòk nimewo): pòp

source: print: print value in status block (also available in Turtle Art)
ht: ekri ak lèt ​​detache: valè ekri ak lèt ​​detache nan blòk estati (disponib tou nan Turtle Art)

source: comment: program comment (displayed in "walk" mode)
ht: kòmantè: kòmantè pwogram (parèt nan "mache" mòd)

source: chr: Python chr primitive: converts ASCII to character (useful for converting keyboard input to text)
ht: chr: Piton chr primitif: konvèti ASCII nan karaktè (itil pou konvèti opinyon klavye nan tèks)

source: int: Python int primitive: converts input to integers
ht: int: Piton Int primitif: konvèti opinyon nonm antye

source: Python: a programmable block (can be used in place of a number block)
ht: Piton: yon blòk pwogramasyon (ka itilize nan plas yon blòk nimewo)

source: add your own math equation in the block, e.g., sin(x); This block is expandable to support up to three variables, e.g. f(x,y,z)
ht: ajoute ekwasyon pwòp matematik ou a nan blòk, e. g. , Peche (x); Blòk Sa a se dilatabl sipòte jiska twa varyab, e. g. f (x, y, z)

source: Import Python: import Python code from the Sugar Journal (a more general-purpose programmable block). This block accepts a single variable x, as an input or up to 3 variables as an array x[0], x[1] and x[2]
ht: Import Piton: enpòte Kòd Piton soti nan Sugar Journal la (yon plis jeneral-bi blòk pwogramasyon). Blòk Sa a aksepte yon sèl x varyab, kòm yon opinyon oswa jiska 3 varyab kòm yon etalaj x [0], x [1] ak x [2]

source: Cartesian: display Cartesian coordinate grid overlay
ht: Katezyen: ekspozisyon katezyen kowòdone kadriyaj kouvri

source: polar: display polar coordinate grid overlay
ht: polè: ekspozisyon polè kowòdone kadriyaj kouvri

source: turtle: specify which turtle is active
ht: tòti: presize ki tòti se aktif

source: turtle shell: import a image from the Journal to use as the turtle's 'shell', i.e., replace the turtle with a sprite.
ht: tòti koki: enpòte yon imaj soti nan Journal la yo itilize kòm 'koki' tòti a, mwen. ak. , Ranplase tòti a ak yon luten.

source: sandwich clamp: "clamp" a stack of blocks to hide
ht: sandwich kranpon: "kranpon" yon pil nan blòk yo kache

source: Portfolio Palette
ht: Portfolio Palèt

source: These blocks are used to make multimedia presentations only available in Turtle Blocks.
ht: Sa yo blòk yo yo te itilize fè prezantasyon miltimedya sèlman ki disponib nan Turtle blòk.

source: hide blocks: hides all blocks and palettes (useful for decluttering the screen during presentations) (also available in Turtle Art)
ht: kache blòk: kache tout blòk ak palèt (itil pou decluttering ekran an pandan prezantasyon) (disponib tou nan Turtle Art)

source: show blocks: shows blocks and palettes (useful for resuming programming after a presentation)
ht: blòk montre: montre blòk ak palèt (itil pou reprenan pwogram apre yon prezantasyon)

source: full screen: goes into full-screen mode (hides Sugar toolbars)
ht: plen ekran: ale nan mòd plen ekran-(kache Sugar bar)

source: list slide: used for bulleted lists; This block is expandable, allowing you to add as many bullets as you need
ht: lis glise: itilize pou lis pus; Blòk Sa a se dilatabl, ki pèmèt ou ajoute kòm anpil bal jan ou bezwen

source: Only available in Turtle Blocks:
ht: Se sèlman disponib nan Turtle blòk:

source: left: holds current x-coordinate value of the left edge of the screen (can be used in place of a number block)
ht: gòch: kenbe aktyèl valè x-kowòdone nan kwen an kite nan ekran an (ka itilize nan plas yon blòk nimewo)

source: top: holds current y-coordinate value of the top edge of the screen (can be used in place of a number block)
ht: tèt: kenbe aktyèl valè y-kowòdone nan kwen an tèt nan ekran an (ka itilize nan plas yon blòk nimewo)

source: right: holds current x-coordinate value of the right edge of the screen (can be used in place of a number block)
ht: dwa: kenbe aktyèl valè x-kowòdone nan kwen an dwa nan ekran an (ka itilize nan plas yon blòk nimewo)

source: bottom: holds current y-coordinate value of the bottom edge of the screen (can be used in place of a number block)
ht: anba: kenbe aktyèl valè y-kowòdone nan kwen anba a nan ekran an (ka itilize nan plas yon blòk nimewo)

source: width: screen width (can be used in place of a number block)
ht: lajè: lajè ekran (ka itilize nan plas yon blòk nimewo)

source: height: screen height (can be used in place of a number block)
ht: wotè: wotè ekran (ka itilize nan plas yon blòk nimewo)

source: **Note:** The slide blocks expand into stacks that can be edited for customized presentations.
ht: ** Remak: ** Blòk yo glise elaji nan pil ki ka revize pou prezantasyon Customized.

source: Trash Palette
ht: Palèt fatra

source: This palette holds any blocks that have been put in the trash. You can drag blocks out of the trash to restore them. The trash palette is emptied when you quit Turtle Art.
ht: Palèt Sa a kenbe nenpòt blòk ki te mete nan fatra a. Ou ka trennen blòk soti nan fatra a retabli yo. Se palèt a fatra vide rès dlo lè ou kite Turtle Art.

source: Vertical palettes
ht: Palèt Vètikal

source: An example of a vertical palette. Vertical palettes are used by default on the OLPC XO laptops running older versions of Sugar.
ht: Yon egzanp sou yon palèt vètikal. Palèt Vètikal yo te itilize pa default sou laptops yo XO OLPC kouri vèsyon ki pi ansyen nan Sugar.

source: Learning with Turtle Art
ht: Aprann ak Turtle Art

source: Tony Forster and Mokurai have created a number of Activities/Turtle Art/Tutorials Turtle Art Tutorials on a wide range of math, programming, art, and Computer Science topics. There is also a substantial literature of educational materials using the Logo programming language, from which Turtle Art and Turtle Blocks derive. The Exploring with Logo series from MIT Press is particularly recommended for showing how far beyond simple graphics Logo can go. Mokurai recommends starting with his first three, specifically designed for helping beginners of all ages, starting with the preliterate in preschool.
ht: Tony Forster ak Mokurai te kreye yon nimewo nan Aktivite / Turtle Art / Leson patikilye Turtle Art Leson patikilye sou nan yon pakèt domèn matematik, pwogram, atizay, ak sijè Syans enfòmatik. Genyen tou yon literati sibstansyèl nan materyèl edikasyonèl lè l sèvi avèk lang nan pwogram Logo, ki soti nan ki Turtle Art, ak Turtle Blòk dériver. Se patikilyèman rekòmande nan Eksplore ak seri Logo soti nan MIT Press pou ki montre ki jan byen lwen dèyè grafik senp Logo ka ale. Mokurai rekòmande pou kòmanse ak premye twa l 'yo, ki fèt espesyalman pou ede débutan ki gen tout laj, kòmanse avèk preliterate la nan lekòl matènèl.

source: `You be the Turtle <http://wiki.sugarlabs.org/go/Activities/Turtle_Art/Tutorials/You_be_the_Turtle>`_ without the computer.
ht: `Ou dwe Turtle an <http: // wiki. sugarlabs. org / ale / Aktivite / Turtle_Art / Leson patikilye / You_be_the_Turtle> `_ san yo pa òdinatè a.

source: `Mathematics and art <http://wiki.sugarlabs.org/go/Activities/Turtle_Art/Tutorials/Mathematics_and_art>`_, an introduction to TA.
ht: `Matematik ak atizay <http: // wiki. sugarlabs. org / ale / Aktivite / Turtle_Art / Leson patikilye / Mathematics_and_art> `_, yon entwodiksyon sou TA.

source: `Counting <http://wiki.sugarlabs.org/go/Activities/Turtle_Art/Tutorials/Counting>`_
ht: `Konte <http: // wiki. sugarlabs. org / ale / Aktivite / Turtle_Art / Leson patikilye / Konte> `_

source: Extending Turtle Art
ht: Pwolonje Turtle Art

source: There are versions of Turtle Art in several programming languages and environments, including Logo, Python, Smalltalk, and others. Turtle Art can export programs in Logo, as explained below. There are programmable blocks in Turtle Art which make it possible to include any Python program within the Turtle Art world. The simplest case is a single function call used in a graphing program, but there is no inherent limit on what capabilities of Python one can add to TA.
ht: Gen vèsyon nan Turtle Art nan plizyè lang programmation ak anviwònman, ki gen ladan Logo, Piton, smaltolk, ak lòt moun. Turtle Atizay ka ekspòtasyon pwogram nan Logo, jan yo eksplike pi ba a. Gen blòk pwogramasyon nan Turtle Art ki fè li posib genyen ladan yo nenpòt pwogram Piton nan mond lan Turtle Art. Ka a ki pi senp se yon apèl fonksyon sèl itilize nan yon pwogram syantifik, men pa gen okenn limit sou sa ki nannan kapasite nan Piton youn kapab ajoute TA.

source: Exporting to Berkeley Logo
ht: Ekspòtatè Berkeley Logo

source: Turtle Art can export its projects to `Berkeley Logo <http://www.cs.berkeley.edu/~bh/>`_ (using either **View Source** or the **Save as Logo** button on the **Project Toolbar**)
ht: Turtle Atizay ka ekspòtasyon pwojè li yo nan `Berkeley Logo <http: // www. CS. BERKELEY. edu / ~ bh /> `_ (lè l sèvi avèk swa ** View Sous ** oswa ** Save an kòm Logo ** bouton sou ** Pwojè Toolbar la **)

source: Python Blocks in Turtle Art
ht: Piton Blòk nan Turtle Art

source: There are two ways to create Python blocks: by loading sample code provided with Turtle Art or by loading Python code the your Journal.
ht: Gen de fason yo kreye Piton blòk: pa loading echantiyon Kòd bay ak Turtle Art oswa pa chaje Piton Kòd Journal la ou.

source: **Loading sample code**
ht: ** Loading echantiyon Kòd **

source: A number of individual sample programs are provided. Clicking on the Load Python Block button on the Load/Save Toolbar |loadpython| will invoke a file-selector dialog. Select the sample that you want and it will be both copied to the Journal and loaded into a Python block.
ht: Yon kantite pwogram echantiyon endividyèl bay. Klike sou bouton an chaj Piton blòk sou chaj / Save Toolbar | loadpython la | ap envoke yon dyalòg dosye-seleksyon. Chwazi echantiyon an ke ou vle epi li pral tou de kopye nan Journal la ak chaje nan yon blòk Piton.

source: **Loading code from the Journal**
ht: ** Kòd Loading soti nan Journal la **

source: Clicking on a Python block |pythoncodeblock| that has been dragged onto the canvas from the Extras palette will invoke an object-selector dialog.
ht: Klike sou yon blòk Piton | pythoncodeblock | ki te trennen sou twal la soti nan palèt a Extras pral envoke yon dyalòg objè-seleksyon.

source: Select the Python code that that you want and that code will be loaded into the selected block.
ht: Chwazi kòd la Piton ki ke ou vle epi yo pral ke kòd dwe chaje nan blòk la chwazi.

source: You can't run a Python block by clicking on it, as that opens the object selector; instead attach the block to another one and click elsewhere on the stack you have created.
ht: Ou pa ka kouri yon blòk Piton pa klike sou li, kòm ki ouvè seleksyon nan objè; olye pou tache blòk la nan yon lòt yon sèl, epi klike yon lòt kote sou pil la ou te kreye.

source: Which ever way you create them, multiple Python blocks can have different code loaded in them.
ht: Ki tout tan tout tan fason ou kreye yo, plizyè blòk Piton ka gen diferan Kòd chaje nan yo.

source: Modifying Turtle Art
ht: Modifye Turtle Art

source: Turtle Art is under the MIT license. You are free to use it and learn with it. You are also encourage to modify it to suit your needs or just for a further opportunity to learn.
ht: Turtle Art se anba lisans lan MIT. Ou yo gratis yo sèvi ak li ak aprann ak li. Ou ap tou ankouraje li modifye li nan kostim bezwen ou oswa jis pou yon opòtinite yo aprann plis.

source: Much of the motivation behind the Version 83 refactoring of the code was to make it easier for you to make changes. Most changes can be confined to two modules: taconstants.py and talogo.py. The former defines the blocks and palettes; the latter defines what code is executed by a block.
ht: Anpil nan motivasyon nan dèyè rfaktorizasyon la Version 83 nan Kòd la te fè li pi fasil pou ou pou w fè chanjman. Pifò chanjman ka rete sèlman nan de modil: taconstants. d ak talogo. d. Ansyen an defini blòk yo ak palèt; lèt la defini sa Kòd se egzekite pa yon blòk.

source: **Note:** As of Version 106, there is also support for plugins. If you can use the plugin mechanism to add support for additional devices, e.g., Arduino, or for making modifications such as are described below without making changes to the standard code base. (The advantage to the latter is that your changes will remain intact even after you upgrade to a newer version.)
ht: ** Remak: ** Kòm nan vèsyon 106, gen tou sipòte pou grefon. Si ou ka sèvi ak mekanis nan Plugin ajoute sipò pou aparèy adisyonèl, e. g. , Arduino, oswa pou fè modifikasyon tankou yo dekri anba a san yo pa fè chanjman nan baz la Kòd estanda. (Avantaj nan lèt la se ke chanjman ou a ap rete entak menm apre ou ajou ak yon vèsyon plus. )

source: The tabasics.py file contains the constants that by-in-large determine the behavior of Turtle Art. Notably, the block palettes are defined below. If you want to add a new block to Turtle Art, you could simply add a block of code to that file or to turtle_block_plugin.py, which contains additional blocks. (Even better, write your own plugin!!)
ht: Tabasics yo. dosye d gen konstan yo ki pa-nan gwo-detèmine konpòtman an nan Turtle Art. Miyò, palèt yo blòk yo defini pi ba a. Si ou vle ajoute yon blòk nouvo nan Turtle Art, ou ta ka tou senpleman ajoute yon blòk nan kòd ak sa yo ki dosye oswa turtle_block_plugin. d, ki gen blòk lòt. (Menm pi bon, ekri pwòp plugin ou !!)

source: Adding a new palette is simply a matter of:
ht: Ajoute yon nouvo palèt se tou senpleman yon kesyon de:

source: For example, if we want to add a new turtle command, 'uturn', we'd use the add_block method in the Palette class.
ht: Pou egzanp, si nou vle ajoute yon nouvo tòti lòd, 'uturn', nou ta sèvi ak metòd la add_block nan klas la Palèt.

source: Next, you need to define what your block will do. def_prim takes 3 arguments: the primitive name, the number of arguments—0 in this case—and the function to call—in this case, the canvas.seth function to set the heading.
ht: Next, ou bezwen defini ki sa blòk ou pral fè. Sèt fonksyone yo mete tit la.

source: That's it. When you next run Turtle Art, you will have a 'uturn' block on the 'mypalette' palette.
ht: Sa a li. Lè ou pwochen kouri Turtle Atizay, ou pral gen yon blòk 'uturn' sou 'mypalette' palèt a.

source: You will have to create icons for the palette-selector buttons. These are kept in the icons subdirectory. You need two icons: mypaletteoff.svg and mypaletteon.svg, where 'mypalette' is the same string as the entry you used in instantiating the Palette class. Note that the icons should be the same size (55x55) as the others. (This is the default icon size for Sugar toolbars.)
ht: Ou pral gen yo kreye ikon pou bouton sa yo palèt-seleksyon. Sa yo yo kenbe nan repèrtwar nan ikon. Ou bezwen de ikon: mypaletteoff. SVG ak mypaletteon. SVG, kote 'mypalette' se fisèl la menm jan ou antre nan yo itilize nan enstansyasyon klas la Palèt. Remake byen ke ikon yo ta dwe gwosè nan menm (55x55) kòm lòt moun yo. (Sa a se gwosè a icon default pou Sugar bar. )

source: Where to report problems
ht: Ki kote yo repòte pwoblèm

source: Please file bug reports `here <https://bugs.sugarlabs.org/newticket?component=Turtleart>`_.
ht: Tanpri ranpli rapò ensèk `isit la <https: // pinèz. sugarlabs. org / newticket? eleman = Turtleart> `_.

source: Credits
ht: Kredi

source: Alan Jhonn Aguiar Schwyn and the Butia Team have provided great feedback and many patches.
ht: Alan Jhonn Aguiar Schwyn ak Ekip la Butia te bay gwo fidbak ak anpil plak.

source: Brian Silverman is the first author of Turtle Art
ht: Brian Silverman se otè a premye a Turtle Art
