Repository: tony37/sledhelp
Catalog: translated_po/ht/upgrade_all.po
Languages: ht

source: Upgrade all your Software
ht: Upgrade tout lojisyèl ou

source: Your XO comes pre-loaded with the software OS (operating system) designed for the XO. It is a good idea to keep your software up to date because our latest builds fix bugs in earlier releases and they are awesome!
ht: XO ou vini pre-chaje ak eksplwatasyon an lojisyèl (opere sistèm) ki fèt pou XO a. Li se yon bon lide yo kenbe lojisyèl ou jiska dat paske dènye nou an bati ranje pinèz nan pi bonè degaje ak yo awizom!

source: The XO-1’s came with Sugar software. Did you know that with the latest software your XO can have both Sugar and GNOME? GNOME provides an option to teach older children in a learning environment that will be familiar and transferable to using Windows or Mac OS. This Chapter will tell you how to upgrade your software.
ht: Èske w te konnen ak lojisyèl an dènye XO ou ka gen tou de Sik ak luten? GNOME bay yon opsyon yo anseye timoun ki pi gran nan yon anviwònman aprantisaj ki pral dwe abitye ak transfere lè l sèvi avèk Windows oswa Mac OS. Chapter sa a pral di w kouman yo ajou lojisyèl ou.

source: The Software Releases can be found here: http://wiki.laptop.org/go/Releases
ht: Software Releases yo ka jwenn isit la: http: // wiki. laptop. org / ale / Releases

source: The main page of the OLPC Wiki also contains links to the latest releases. http://wiki.laptop.org
ht: Paj la prensipal nan OLPC Wiki a tou gen lyen ki mennen nan degaje yo dènye. http: // wiki. laptop. org

source: There several methods of upgrading. Which one is right for you? Most people will want to use the "clean install" method. An overview of the upgrade options can be found here. http://wiki.laptop.org/go/Updating_the_XO
ht: Gen metòd plizyè nan amelyore. Ki se yon sèl bon pou ou? Pifò moun ki pral vle sèvi ak metòd la "netwaye enstale". Ka Yon BECA de opsyon sa yo ajou ka jwenn isit la. http: // wiki. laptop. org / ale / Updating_the_XO

source: Clear instructions on how to to change, upgrade, downgrade, or replace your XO's OS can be found in the Release notes. Choose the release (build) that you want to install here: http://wiki.laptop.org/go/Releases Next click on the Release notes for the release you will install.
ht: Enstriksyon ki klè sou kòman yo chanje, ajou, à, oswa ranplase OS XO a ou ka jwenn nan nòt yo Release. Chwazi liberasyon an (bati) ke ou vle enstale isit la: http: // wiki. laptop. org / ale / Releases Next klike sou nòt yo Release pou yo lage nan ou pral enstale.

source: Decide whether you want to do a clean install (Installation) which will completely reformat your XO with files from a USB drive, or an online or offline update which will update the current software without erasing the existing Journal. Follow the instruction for the update method chosen.
ht: Deside si ou vle fè yon pwòp enstale (Enstalasyon) ki pral konplètman Fomatè XO ou a ak dosye soti nan yon kondwi USB, oswa yon ajou sou entènèt oswa offline ki pral mete ajou lojisyèl an san yo pa aktyèl efase Journal la ki deja egziste. Swiv enstriksyon a pou metòd la aktyalizasyon chwazi.

source: A clean install uses a USB stick and the "four button procedure" to begin the update. Warning Reminder: This method re-formats your XO and EVERYTHING on your XO will be deleted if you use this method. You will follow the instructions in the Release Notes for the build chosen, and you will need A USB storage device that has at least 1 GB of space free and a computer with Internet access that will allow you to download the required 300-400MB within about an hour.
ht: Yon pwòp enstale sèvi ak yon baton USB ak "kat pwosedi a bouton" yo kòmanse aktyalizasyon a. Avètisman Sonje: Metòd sa a ap re-fòma XO ou ak tout bagay sou XO ou dwe efase si ou itilize metòd sa a. Ou pral swiv enstriksyon ki nan nòt yo lage pou bati a chwazi a, epi w ap bezwen yon aparèy depo USB ki gen omwen 1 GB nan espas gratis ak yon òdinatè ki gen aksè nan Entènèt ki pral pèmèt ou download 300-400MB yo egzije nan apeprè yon èdtan.

source: 1 - Battery indicator
ht: 1 - Battery endikatè

source: 2 - Power indicator
ht: 2 - Pouvwa endikatè

source: 3 - Power button
ht: 3 - Pouvwa bouton

source: 4 - Game buttons
ht: 4 - Jwèt bouton

source: Follow these steps to upgrade your XO
ht: Swiv etap sa yo mete yo ajou XO ou

source: Connect your XO to its charger.
ht: Konekte XO ou nan plato li yo.

source: Turn off your XO.
ht: Etenn XO ou.

source: Connect your prepared USB storage device to your XO.
ht: Konekte aparèy depo USB prepare ou nan XO ou.

source: Next, hold down all four gamepad keys above the power button, and then push the power button to turn the XO on. You will see a message that tells you to "Release the game key to continue". Do not continue until you see this message.
ht: Next, kenbe desann tout kat kle gampad pi wo a bouton an pouvwa, ak lè sa a pouse bouton an pouvwa yo vire XO a sou. Ou gen pou wè yon mesaj ki di ou nan "Lage kle nan jwèt yo kontinye". pa kontinye jiskaske ou wè mesaj sa a.

source: Release the gamepad keys. The reflash process runs automatically; first you will see the XO arrange and color in a grid of boxes, then the XO will display "Rebooting in 10 seconds..."
ht: Lage kle yo gampad. Pwosesis la reflash kouri otomatikman; premye ou pral wè XO a fè aranjman pou ak koulè nan yon griy nan bwat, lè sa a XO a ap montre "Rdemar nan 10 segonn. . . "

source: The XO will then restart with a clean image.
ht: XO a pral Lè sa a, rekòmanse ak yon imaj pwòp.

source: Enter your name for your XO and then click Next.
ht: Ekri non ou pou XO ou ak Lè sa a klike sou Next.

source: Click the XO icon to change the colors and then click Done.
ht: Klike sou ikòn a XO chanje koulè yo ak Lè sa a klike sou Fè.

source: Optionally, connect your XO to the Internet, then use the Control Panel to download the latest Activities.
ht: Opsyonèlman, konekte XO ou a entènèt la, Lè sa a, sèvi ak panèl la kontwòl nan download Aktivite yo dènye.
