Repository: tony37/sledhelp
Catalog: translated_po/ht/write.po
Languages: ht

source: Write
ht: Ekri

source: About
ht: Sou

source: The Write Activity serves as the document creation Activity in Sugar. Its simple interface provides an easy starting point for children, presenting tools that make writing a story, poem, or essay simple and straightforward. It also supports tools for inserting images, creating tables, and performing layout operations.
ht: Ekri aktivite a sèvi kòm dokiman kreyasyon aktivite a nan sik. Koòdone senp li yo bay yon pwen fasil kòmanse pou timoun yo, prezante zouti ki fè ekri yon istwa, powèm, oswa redaksyon senp epi dwat. Li sipòte tou zouti pou mete imaj, kreye tab, ak fè operasyon Layout.

source: Write utilizes the :doc:`/journal`, your work is automatically saved, and :ref:`Collaboration` in the form of peer editing, group storytelling, etc.
ht: Ekri itilize: doc la: `/ journal`, se travay ou otomatikman sove, epi: ref:` Collaboration` nan fòm lan nan koreksyon kanmarad, gwoup rakonte istwa, elatriye.

source: The Write Activity can be used to open and edit most common file formats, including ODT, DOC, RTF, TXT, and HTML.
ht: Ka ekri aktivite a dwe itilize yo louvri ak fòma dosye modifye pi komen, ki gen ladan od, DOC, RTF, TXT, ak HTML.

source: Write is included in OLPC images and can be downloaded from `ASLO <http://activities.sugarlabs.org>`_, search for Paint.
ht: Se Ekri enkli nan imaj OLPC epi yo ka telechaje soti nan `aslo <http: // aktivite. sugarlabs. org> `_, rechèch pou Penti.

source: Using
ht: Lè l sèvi avèk

source: Here Write has been used to produce some colorful text.
ht: Isit la Ekri ki te itilize yo pwodwi kèk tèks kolore.

source: The Toolbars
ht: D yo

source: **Tip** Use the :ref:`say_selected_text` feature to have robot Alice read aloud this page in the background, while you explore the Write Activity.
ht: ** Ide ** Sèvi ak: ref la: `karakteristik say_selected_text` gen robo Alice li paj sa a byen fò nan background nan, pandan y ap ou eksplore ekri aktivite a.

source: We look first at the nine buttons in the top row of the toolbar. The buttons open the corresponding tab or toolbar.
ht: Nou gade an premye nan nèf bouton sa yo nan ranje nan tèt nan ba ikòn nan. Bouton sa yo louvri tab la ki koresponn oswa toolbar.

source: Activity tab, or button, here you can enter a name for the page or project. The Description button allows you to add a description to the :doc:`/journal` entry. Thirdly select Private, or My Neighbourhood.
ht: Tab pou Aktivite, oswa bouton, isit la ou ka antre nan yon non pou paj la oswa pwojè. Bouton an Deskripsyon pèmèt ou ajoute yon deskripsyon nan: doc la: `/ antre journal`. Anfen chwazi Prive, oswa Katye mwen.

source: The Edit button: Allows to Copy, Paste, Undo, Redo, and search inside your document.
ht: Bouton an Edit: Pèmèt kopi, keratin, Defèt, refè, ak rechèch andedan dokiman ou.

source: The View button: Allows you to zoom in and out of the document and to navigate through the pages quickly.
ht: Bouton an View: Pèmèt ou rale nan ak soti nan dokiman an ak navige nan paj sa yo byen vit.

source: The Speak button. You can have Speak, robot Alice, read your work aloud.
ht: Bouton an Pale. Ou ka gen Pale, robo Alice, li travay ou byen fò.

source: The Fonts button: Allows you to change the font, size, empphasis, colour and justify.
ht: Bouton an Polis: Pèmèt ou chanje font, gwosè, empphasis, koulè a ​​ak jistifye.

source: The Paragraph button : Allows you to set heading and list styles.
ht: Bouton an Paragraf: Pèmèt ou mete tit ak lis Styles.

source: The Insert table button : Allows you to insert and adjust a table.
ht: Tab Bouton an Antre: Pèmèt ou insert epi ajiste yon tab.

source: The Insert Image button : Allows you to insert images.
ht: Bouton an Imaj Antre: Pèmèt ou insert imaj.

source: Stop or clpose the Activity.
ht: One Stop oswa clpose aktivite a.

source: The Toolbar Sub Menus
ht: Sub nan Toolbar Meni

source: Activity button (1)
ht: Bouton (aktivite 1)

source: Allows you to name your file. Click the cursor in the field, the existing text is selected, and a new file name can be entered.
ht: Pèmèt ou non dosye ou. Klike sou kurseur an nan jaden an, se tèks la ki deja egziste chwazi, epi yo ka yon nouvo non dosye dwe antre.

source: The "pencil and book" icon, the Description button allows you to add a description to the :doc:`/journal` entry.
ht: "Kreyon ak liv" icon la, bouton an Deskripsyon pèmèt ou ajoute yon deskripsyon nan: doc la: `/ antre journal`.

source: This button is the collaboration, or sharing "switch". The options are
ht: Bouton Sa a se kolaborasyon an, oswa pataje "switch". Opsyon yo se

source: |Home_key_f3_small.png| Private, this is the non-sharing option, with no networking.
ht: | Home_key_f3_small. png | Espas, sa a se opsyon a ki pa Peye-pataje, ki pa gen okenn rezo.

source: |Neighborhood_key| My Neighbourhood, this is the sharing option, that is, networked with others.
ht: | Neighborhood_key | Katye mwen, sa a se opsyon a pataje, se sa ki, rezo ak lòt moun.

source: See also below, :ref:`Collaboration`.
ht: Gade tou anba a,: ref: `Collaboration`.

source: Export, or Save in Rrich Text Format.
ht: Export, oswa Save nan Rrich Fòma Tèks.

source: Export, or Save in HTML.
ht: Export, oswa Save nan HTML.

source: Export, or Save in Plain text.
ht: Export, oswa Save nan tèks plenn.

source: Export, or Save in Portable Document Format.
ht: Export, oswa Save nan Portable Dokiman Fòma.

source: Edit button (2)
ht: Edit bouton (2)

source: Copy
ht: Kopi

source: Paste
ht: Kole

source: Undo
ht: Defèt

source: Redo
ht: Ready

source: Back
ht: Retounen

source: View button (3)
ht: View bouton (3)

source: Zoom out
ht: Rale soti

source: Zoom in
ht: Rale nan

source: Zoom to width
ht: Rale lajè

source: Quick page navigation
ht: Quick paj Navigasyon

source: Speak button (4)
ht: Pale bouton (4)

source: Play / Pause the Speak function, robot Alice will read aloud any text which you select. See :ref:`say_selected_text`.
ht: Jwe / Pòz fonksyon an Pale, robo Alice ap li awotvwa nenpòt tèks ki ou chwazi. Al gade nan: ref: `say_selected_text`.

source: Stop robot Alice.
ht: Stop robo Alice.

source: Select robot Alice's language.
ht: Chwazi robo lang Alice an.

source: Fonts button (5)
ht: Polis bouton (5)

source: Name of font
ht: Non font

source: Size of font
ht: Kantite moun ki nan font

source: Italic
ht: Italik

source: Underline
ht: Souliyen

source: Choose a color
ht: Chwazi yon koulè

source: Justify your text to left, centre, right, or fill justify.
ht: Jistifye tèks ou a gòch, sant, dwa, oswa ranpli jistifye.

source: Paragraph button (6)
ht: Paragraf bouton (6)

source: Normal
ht: Nòmal

source: Heading 1
ht: Tit 1

source: Heading 2
ht: Tit 2

source: Heading 3
ht: Tit 3

source: Heading 4
ht: Tit 4

source: Block Text
ht: Blòk Tèks

source: Plain Text
ht: Plain tèks

source: Select list:
ht: Chwazi lis:

source: Bullet List
ht: Lis bal

source: Dashed List
ht: An tirè Lis

source: Numbered List
ht: Resansman Lis

source: Lower Case List
ht: Lower Lis Ka

source: Upper Case List
ht: Upper Ka Lis

source: The Insert Table button (7)
ht: Bouton an Antre Table (7)

source: Create table, in the grid you select the number of rows and columns you want to appear.
ht: Kreye tab, nan chema kadriye a ou chwazi ki kantite ranje ak kolòn ou vle parèt.

source: Insert row.
ht: Antre ranje.

source: Delete row.
ht: Netwaye ranje.

source: Insert column.
ht: Antre kolòn.

source: Delete column.
ht: Efase kolòn.

source: The Insert Image button (8)
ht: Bouton an Antre Imaj (8)

source: This button opens the Journal, or attached media, in "search image mode". In the default (non floating) mode the image is inserted and the text is before or after the image. If you insert text before the image, the image is displaced. Sometimes, use a two box table to contain associated text reliably. Use this mode only to place images in tables.
ht: Bouton Sa a ouvè Journal la, oswa medya tache, nan "rechèch mòd imaj". Nan default (ki pa k ap flote) mòd la se imaj la eleman ak tèks la se anvan oswa apre imaj la. Si ou Insert tèks anvan imaj la, se imaj la deplase. Pafwa, sèvi ak yon tab de bwat a ki genyen asosye tèks fiable. Sèvi ak sa a mòd sèlman nan plas imaj nan tab.

source: A checkbox allows to have image floating. In floating mode, the text will flush around the image, and the image will stay fixed in one place.
ht: Yon toulède kaz pèmèt yo gen imaj k ap flote. Nan mòd k ap flote, tèks la ap kole alantou imaj la, epi yo pral imaj la rete fiks nan yon sèl kote.

source: Collaboration
ht: Kolaborasyon

source: The Write Activity supports collaborative (peer) editing, which means that multiple people can edit the same document at the same time.
ht: Ekri aktivite a sipòte kolaborasyon (kanmarad) koreksyon, ki vle di ke plizyè moun ka edite dokiman an menm an menm tan an.

source: To start a collaboration, either:
ht: Pou kòmanse yon kolaborasyon, swa:

source: send an invitation, or
ht: voye yon envitasyon, oswa

source: share with the Neighborhood
ht: pataje ak Katye a

source: As with all Sugar Activities, invitations go to specific individuals, but sharing is open to anyone in the Neighborhood View.
ht: Menm jan ak tout aktivite Sugar, envitasyon ale nan moun espesifik, men pataje se ouvè a nenpòt moun ki nan katye View.

source: |more| For more on this subject, please see the chapter in this manual on :doc:`/collaborating`.
ht: | Plis | Pou plis sou sijè sa a, tanpri al gade chapit la nan manyèl sa a sou: doc: `/ collaborating`.

source: Note to parents and teachers
ht: Remake byen paran ak pwofesè

source: Collaboration is a powerful feature of Write, but it is recommended that when you do collaborate, keep the number of people editing the same document to just 2–3 people. Otherwise, there tend to be delays that cause the document to get out of synch from one computer to another. Also, try to avoid using too many large pictures or tables when collaborating, as these objects tend to get scrambled.
ht: Sinon, gen gen tandans yo dwe reta ki lakòz dokiman an jwenn soti nan senk soti nan yon òdinatè nan yon lòt. Epitou, eseye evite lè l sèvi avèk twòp foto gwo oswa tab lè kolabore, kòm bagay sa yo yo gen tandans jwenn grenpe moute.

source: Group Storytelling
ht: Rakonte istwa Group

source: The Dadaists, a cultural movement that began in Europe towards the end of World War I (1916) invented a number of art-construction techniques, including collage and photo montage. Many of their works were collaborative, including exquisite corpse, a method by which a collection of words or images was collectively assembled. Each collaborator adds to a composition in turn, either by following a rule or by being allowed to see the end of what the previous person contributed.
ht: Dadaists yo, yon mouvman kiltirèl ki te kòmanse nan Ewòp nan direksyon pou nan fen Premye Gè Mondyal la (1916) envante yon kantite teknik art-konstriksyon, ki gen ladan kolaj ak montaj foto. Anpil nan sa y'ap fè a tèt ansanm, ki gen ladan ekskiz kadav, yon metòd pa ki te yon koleksyon mo oswa imaj kolektivman reyini. Chak kolaboratè ajoute nan yon konpozisyon nan vire, swa pa swiv yon règ oswa pa ke yo te pèmèt yo gade nan fen sa moun lan anvan yo kontribye.

source: A shared instance of Write can be used in a similar way to create a collaborative story, poem, rhyme, or group stream of consciousness.
ht: Ou ka jwenn yon egzanp pataje nan Ekri dwe itilize nan yon fason ki sanble ak kreye yon istwa tèt ansanm, powèm, rime, oswa yon gwoup kouran nan konsyans.

source: Using Write for group storytelling
ht: Lè l sèvi avèk Ekri pou gwoup rakonte istwa

source: It is fun and easy to use Write for group storytelling. Simply share a document with a group of friends (or your class); take turns opening the document and adding to the story.
ht: Li se plezi ak fasil yo sèvi ak Ekri pou gwoup rakonte istwa. Senpleman pataje yon dokiman avèk yon gwoup zanmi (oswa klas ou); pran tou louvri dokiman an ak ajoute nan istwa a.

source: **Steps:**
ht: ** Etap: **

source: Open a document in Write.
ht: Louvri yon dokiman nan Ekri.

source: Type in a rule on the first line for everyone to follow. (Some examples are listed below.)
ht: Tape nan yon règ sou liy lan premye pou tout moun yo swiv. (Men kèk egzanp yo ki nan lis anba a. )

source: Go to the Activity tab.
ht: Ale nan tab la Aktivite.

source: Select "Share with Neighborhood".
ht: Chwazi "Pataje ak Katye".

source: One at a time, each person in the group should open the shared document by clicking it in the Neighborhood View.
ht: Youn nan yon moman, chak moun nan gwoup la ta dwe louvri dokiman an pataje pa klike li nan Katye View.

source: During their turn, they should follow the rule to add to the end of the story.
ht: Pandan vire yo, yo ta dwe swiv règ la pou ajoute pou nan fen istwa a.

source: They should exit Write after they have added to the story. (Important: the person who originally shared the document should not exit Write until everyone has taken their turn.)
ht: Yo ta dwe sòti Ekri apre yo te ajoute nan istwa a. (Enpòtan: moun ki orijinal pataje dokiman an pa ta dwe sòti Ekri jiskaske tout moun te pran vire yo. )

source: After each person has added to the story, the person who started the story should read it aloud to the group.
ht: Apre yo fin chak moun ajoute nan istwa a, moun nan ki te kòmanse istwa a ta dwe li li l 'nan gwoup la byen fò.

source: **Examples**
ht: ** Egzanp **

source: Add a sentence that continues the theme of a story.
ht: Ajoute yon fraz ki kontinye tèm nan nan yon istwa.

source: Add a new sentence that starts with the last word of the sentence that comes before it.
ht: Ajoute yon fraz nouvo ki kòmanse ak dènye mo an nan fraz la ki vini anvan li.

source: Add a new word that begins with the same letter as the last letter of the word before it.
ht: Ajoute yon nouvo mo ki kòmanse ak lèt ​​la menm jan ak lèt ​​ki sot pase a nan pawòl Bondye a anvan li.

source: Add an adjective after a noun, a noun after an adjective.
ht: Ajoute yon adjektif apre yon noun, yon non apre yon adjektif.

source: Add a word with one more letter than the word before it (this gets hard for a large group!)
ht: Ajoute yon mo ak yon sèl plis lèt pase pawòl Bondye a anvan li (sa a vin difisil pou yon gwo gwoup!)

source: Add words in alphabetical order.
ht: Ajoute mo yo nan lòd alfabetik.

source: Letter to the Editor
ht: Lèt ba editè a

source: Writing is one of the most powerful means of personal expression ever invented. The expression, "the pen is mightier than the sword" has rung true through out history.
ht: Ekri se youn nan mwayen ki pi pwisan nan ekspresyon pèsonèl janm envante. Ekspresyon an, "plim la se plis pouvwa anpil pase nepe a" te baro vre nan istwa soti.

source: It is important that the world hear your voice and you can make you voice heard, whether through a blog, a letter to the editor, a comment on a page in the Wikipedia, or by some other means. Write gives the power of expression as well as the means to share your expression with others.
ht: Li enpòtan pou ke mond lan tande vwa ou, epi ou ka fè w vwa tande, si wi ou non nan yon blog, yon lèt bay editè a, yon kòmantè sou yon paj nan Wikipedya a, oswa pa kèk lòt mwayen. Ekri bay pouvwa a nan ekspresyon kòm byen ke vle di la yo pataje ekspresyon ou ak lòt moun.

source: If you want to write a letter to the editor, you first need to look in the newspaper or on the paper's web site to find their e-mail address for letters. Some newspapers have a policy of publishing all appropriate letters sent to the editor, but most are more selective. All require you to include your complete name, address, and a contact telephone number. You can, however, request that your letter be published with "name withheld" if you want. Most editors call you to verify that you really did write the letter before printing it. They also reserve the right to edit your letter to fit the available space on the page.
ht: Si ou vle ekri yon lèt bay editè a, ou premye bezwen gade nan jounal la oswa sou sit entènèt papye a jwenn adrès e-mail yo pou lèt. Gen kèk jounal gen yon politik nan pibliye tout lèt ki apwopriye voye nan editè a, men ki pi gen plis selektif. Tout mande pou ou genyen ladan yo non ou konplè, adrès, ak yon nimewo telefòn kontak. Ou ka, sepandan, mande pou lèt ou a dwe pibliye ak "non kenbe" si ou vle. Pifò editè rele ou verifye ke ou reyèlman te fè ekri lèt la anvan enprime li. Yo menm tou yo gen dwa a edite lèt ou a nan anfòm espas ki la disponib sou paj la.

source: If you keep your letter short and to the point, you have a better chance of experiencing the thrill of seeing your own words in print. Good luck!
ht: Si ou kenbe lèt ou a kout ak nan pwen an, ou gen yon pi bon chans pou fè eksperyans frison la wè pwòp mo ou a ekri an lèt detache. Bon chans!

source: Examples
ht: Men kèk egzanp

source: Children in the Galadima School in Abuja, Nigeria used Write to write letters to the president of Nigeria with suggestions about how he could improve the conditions of school for all the children of Nigeria.
ht: Timoun ki nan lavil la nan Galadima nan Abuja, Nijerya itilize Ekri yo ekri lèt bay prezidan an nan Nijerya ak sijesyon sou ki jan li te kapab amelyore kondisyon yo nan lekòl la pou tout timoun yo nan Nijerya.

source: Children in Ban Samkha, Thailand used Write to share ideas with their teachers, their families, and their community.
ht: Timoun ki nan Ban Samkha, Thailand itilize Ekri yo pataje ide ak pwofesè yo, fanmi yo, ak kominote yo.

source: Children in Khairat, India use Write (and Record) to survey their village and compile a report to the community.
ht: Timoun ki nan Khairat, peyi Zend itilize Ekri (ak Dosye) nan sondaj ti bouk yo epi pou konpile yon rapò nan kominote a.

source: Children in Uruguay and Colombia are writing blog entries, also known as blogging. Blog entries are typically chronologically ordered essays or stories.
ht: Timoun ki nan Irigwe ak Kolonbi ap ekri antre blog, konnen tou kòm blog. Blog antre yo, se tipikman lòd kronolojik te bay lòd disètasyon oswa istwa.

source: Other learning activities
ht: Lòt aktivite aprantisaj

source: Start a school newspaper.
ht: Kòmanse yon jounal lekòl.

source: Write an autobiography.
ht: Ekri yon otobiyografi.

source: Interview someone from your community.
ht: Entèvyou yon moun nan kominote w la.

source: Write an article for the Wikipedia about your community.
ht: Ekri yon atik pou Wikipedia a sou kominote w.

source: Credits
ht: Kredi

source: Write is based upon Abiword; the Sugar port was done by J.M. Maurer, Martin Sevior, Tomeu Vizoso and Robert Staudinger
ht: Se ekri ki baze sou Abiword; pò a Sugar te fè pa J. M. Maurer, Martin Sevior, Tomeu Vizoso ak Robert Staudinger
